//xiaoyaogucity.h хавЃЙШ
//ЧиВЈ 2002ЁЂ12ЁЂ5

XiaoYao_BEGIN(CRXiaoYao_city);

virtual void create()
{
	set_name( "хавЃЙШ");

	add_door("хавЃЙШаЁЯЊБп", "хавЃЙШаЁЯЊБп", "хавЃЙШ");
	add_door("хавЃЙШаЁОЖ", "хавЃЙШаЁОЖ", "хавЃЙШ");
	add_door("хавЃЙШаЁдК", "хавЃЙШаЁдК", "хавЃЙШ");
	add_door("хавЃЙШаЁЮн", "хавЃЙШаЁЮн", "хавЃЙШ");
	add_door("хавЃЙШФОЮн", "хавЃЙШФОЮн", "хавЃЙШ");
	add_door("хавЃЙШСЗЙІГЁ", "хавЃЙШСЗЙІГЁ", "хавЃЙШ");
	add_door("хавЃЙШСЗЙІЪв", "хавЃЙШСЗЙІЪв", "хавЃЙШ");
	add_door("хавЃЙШЪЏЮн", "хавЃЙШЪЏЮн", "хавЃЙШ");
/*
	add_door("хавЃЙШдКЭт", "хавЃЙШдКЭт", "хавЃЙШ");
	add_door("хавЃЙШаЁТЗ1", "хавЃЙШаЁТЗ1", "хавЃЙШ");	
	add_door("хавЃЙШаЁТЗ2", "хавЃЙШаЁТЗ2", "хавЃЙШ");	
	add_door("хавЃЙШаЁТЗ3", "хавЃЙШаЁТЗ3", "хавЃЙШ");
	add_door("хавЃЙШаЁТЗ4", "хавЃЙШаЁТЗ4", "хавЃЙШ");
	add_door("хавЃЙШЩНТЗ3", "хавЃЙШЩНТЗ3", "хавЃЙШ");
	add_door("хавЃЙШЩНТЗ4", "хавЃЙШЩНТЗ4", "хавЃЙШ");
	add_door("хавЃЙШЩНТЗ5", "хавЃЙШЩНТЗ5", "хавЃЙШ");
	add_door("хавЃЙШПеЕи", "хавЃЙШПеЕи", "хавЃЙШ");	
	
	add_door("хавЃЙШДѓУХ", "хавЃЙШДѓУХ", "хавЃЙШ");
	add_door("хавЃЙШЛГдТЭЅ", "хавЃЙШЛГдТЭЅ", "хавЃЙШ");
	add_door("хавЃЙШОВЫМЭЅ", "хавЃЙШОВЫМЭЅ", "хавЃЙШ");
	add_door("хавЃЙШСЗЮфГЁ", "хавЃЙШСЗЮфГЁ", "хавЃЙШ");

	add_door("хавЃЙШЩННХ", "хавЃЙШЩННХ", "хавЃЙШ");
	add_door("хавЃЙШЩНТЗ1", "хавЃЙШЩНТЗ1", "хавЃЙШ");
	add_door("хавЃЙШЩНбќ", "хавЃЙШЩНбќ", "хавЃЙШ");
	add_door("хавЃЙШЩНТЗ2", "хавЃЙШЩНТЗ2", "хавЃЙШ");
	add_door("хавЃЙШЗхЖЅ", "хавЃЙШЗхЖЅ", "хавЃЙШ");

	add_door("хавЃЙШОЕдТКў", "хавЃЙШОЕдТКў", "хавЃЙШ");
	add_door("хавЃЙШЦйВМ", "хавЃЙШЦйВМ", "хавЃЙШ");
	add_door("хавЃЙШЗЩСшОХЯќИѓе§УХ", "хавЃЙШЗЩСшОХЯќИѓе§УХ", "хавЃЙШ");

	add_door("хавЃЙШЧрСњЫў", "хавЃЙШЧрСњЫў", "хавЃЙШ");	
	add_door("хавЃЙШаўЮфЫў", "хавЃЙШаўЮфЫў", "хавЃЙШ");	
	add_door("хавЃЙШжьШИЫў", "хавЃЙШжьШИЫў", "хавЃЙШ");	
	add_door("хавЃЙШАзЛЂЫў", "хавЃЙШАзЛЂЫў", "хавЃЙШ");	
*/	
};

XiaoYao_END;
