//helpnpc005.h
//不戊
//George 2001-07-07

NPC_BEGIN(CNhelpnpc005);

void create()
{
	set_name("不戊", "buwu");
	set("title","危险人物");

	set("icon", young_man5);
	set("gender", "男性" );
	set("age", 50);
	set("long","穿一双破草鞋");
	set("attitude", "friendly");    
	set("env/wimpy", 100);
	set("no_talk",1);
} 
int do_talk(CChar * me, char * ask = NULL)
{

	static char hua1[20][200]=
	{
		"用白驼山的蛇杖打人会被蛇咬中毒，蛤蟆功能够用内功驱毒，还能逆转经脉提升防御力。白少庄主比较好色，帮他找个mm的话会有好处，山庄里面有蛇胆膏（迷题），可以永久提升生命力上限",
		"丐帮的乞讨和偷窃都是相当无赖的技能，用的时候要看清楚对方是谁，不然可能会被追杀九条街",
		"回风七绝好象是一种很强的武功，不过无论学习还是使用的条件都非常变态，如果不是实在闷得无聊还是别打它的主意。",
		"峨嵋弟子可以向宁风师太索要药品和武器，还有几个峨嵋NPC身上也可以找到几件古怪的物品（迷题）。",
		"古墓收徒非常看重容貌，样子长得有点遗憾的就节哀顺变吧",
		"孙奶奶和龙儿是古墓派的正宗嫡传，洪绫绫和李清照却是古墓弃徒，武功自成一家，虽然份属同门，但龙、李两支相互间都不买对方的账。",
		"到蜂屋采到玉蜂蜜后可以向洪绫绫或者孙奶奶交换冰魄银针或玉蜂针的解药,最好多学几级驱蜂之术再去，不然会给叮得很惨,",
		"龙儿和李清照身上有很多好宝贝，过儿却要别人给东西才肯收徒弟，给什么？问龙儿吧。 ",
		"灵鹫宫可以算是逍遥派的一个分支，所拥有的功夫并不多，收徒弟的要求也不太高，不过限于尊主铁姥的规定，只收女弟子。",
		"天羽奇剑的绝招天女散花威力相当不俗",

		"六阳掌所种的生死符是一种没有解药的毒，只有会六阳掌的人才能解开，也可以上灵鹫宫找石姐交贡金解除",
		"王重阳还有一套全真剑法没有传给门下弟子，只有拜他为师以后才能学到，威力比普通的全真剑要高出不少。 ",
		"神龙八式和化骨绵掌可以组合使用，蛇岛奇功既可当剑法使，又可以当杖法使，而且惊魂三绝唱更是威力无比，",
		"听说黄老怪和白老庄主少年时是好朋友，玩耍的时候输了东西给他心里一直不服气，谁能把东西找到还给黄老怪会得到一些很特别的报酬",
		"太极神功和先天神功一样具有提升HP上限的功能；太极剑的功能比较齐全，随字诀可以增加防御力，缠字诀可以使敌人忙乱，连字诀可以连击，可谓进可攻退可守",
		"太极拳是虽然不能和其它拳法组合，但威力相当不俗，等级够高的话几乎可以跟六脉神剑媲美",
		"少林寺是武学正宗，寺中戒律森严等级分明，俗家弟子只能学习一些入门的基本功夫，剃渡为僧后才能正式学艺，想出家为僧要请清法比丘剃度",
		"雪山寺是西藏密宗佛教圣地，入门学艺一般都要出家为喇嘛，不过自从血刀王悟出血刀大法之后，寺中情况就稍有变化，正宗的喇嘛僧依旧虔诚向佛修习佛门武学",
		"逍遥是一个很莫名其妙的门派。入门的师傅什么都教，就是不教读书写字",
		"独孤九剑一向是传说中的最强之剑，拜入华山门下的弟子无不以此为目标",
	};
	say(hua1[random(20)],me);
	SendMenu(me);
	return 1;
}

virtual int accept_fight(CChar * me)
{
	char msg[255];
	say(snprintf(msg,255," %s我怎么是大侠的对手呢？",query_respect(me) ));
	return 0;
}

/*
virtual void die()
{
	revive(1);
//	message_vision("$N望空中深深的吸了口气。", this);
	set("max_hp",30000);
	set("eff_hp",30000);
	set("hp",30000);

}
*/
NPC_END;

