// 江湖拜师指南
// jaja 2002-10-23

ITEM_BEGIN(CIjh_zhinan1);

void create(int nFlag = 0)
{
    set_name("江湖拜师指南", "jh zhinan1");
    set_weight(100);
    
	set("long", "这是一份江湖拜师指南，里面列出了从佛山到所有门派初级师傅的所在地的行走路线。");        
}

int Can_Use()
{
	return 1;
}

int do_use(CChar * me, CContainer * target)
{		
	AddMenuItem("逍遥派", "$0xy $1", me);
	AddMenuItem("华山派", "$0hs $1", me);
	AddMenuItem("古墓派", "$0gm $1", me);
	AddMenuItem("星宿派", "$0xx $1", me);
	AddMenuItem("雪山寺", "$0xs $1", me);
	AddMenuItem("白驼山", "$0bt $1", me);
	AddMenuItem("大理段氏", "$0dl $1", me);
	AddMenuItem("少林寺", "$0sl $1", me);
	AddMenuItem("峨嵋派", "$0em $1", me);
	AddMenuItem("武当派", "$0wd $1", me);
	AddMenuItem("桃花岛", "$0th $1", me);
	AddMenuItem("丐帮", "$0gb $1", me);
	AddMenuItem("日月神教", "$0ry $1", me);
	AddMenuItem("全真教", "$0qz $1", me);
	AddMenuItem("灵鹫宫", "$0lj $1", me);
	AddMenuItem("神龙教", "$0slj $1", me);
	AddMenuItem("明教", "$0mj $1", me);

	SendMenu(me);
	return 1;
}

int handle_action(char * comm, CChar * me, char * arg)
{
	if(!strcmp(comm, "xy") )
	{	
		tell_object(me,"\n$HIW逍遥派拜师线路：$COM佛山→佛山北门→南岭山口→武当黄土路2→襄阳草地→逍遥林树林\n　　　　　　　　→逍遥林小道1→逍遥林小道2→逍遥林小木屋");
		tell_object(me,"$HIW逍遥派入门师傅：$COM薛仰陀");
		tell_object(me,"$HIW逍遥派拜师条件：$COM无条件\n");
		return 1;	
	}
	else if(!strcmp(comm, "hs") )
	{	
		tell_object(me,"\n$HIW华山派拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　　→襄阳西北→长安函谷关→长安大官道2→华山村青石大道→华山村→华山脚下\n　　　　　　　　→华山莎萝坪→华山云门→华山青柯坪→华山回心石→华山千尺幢→华山百尺峡\n　　　　　　　　→华山平心石→华山老君沟→华山猢狲愁→华山上天梯→华山金锁关→华山镇岳宫$HIR①$COM\n　　　　　　　　→华山玉女峰→华山练武场→华山群仙观→华山有所不为轩→华山花园→华山长廊→华山居室$HIR②$COM");
		tell_object(me,"$HIW华山派入门师傅：$COM①封不坦；②岳夫人");
		tell_object(me,"$HIW华山派拜师条件：$COM①悟性20；②无条件，只收女徒\n");
		return 1;	
	}
		else if(!strcmp(comm, "gm") )
	{	
		tell_object(me,"\n$HIW古墓派拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南");
		tell_object(me,"　　　　　　　　→襄阳西北→长安函谷关→长安大官道2→长安大官道→终南山山路2→终南山山路1");
		tell_object(me,"　　　　　　　　→终南山脚→终南山道路13→终南山山路12→终南山道路11→终南山金莲阁→终南山山路10");
		tell_object(me,"　　　　　　　　→终南山日月岩→终南山山道9→终南山树林9→终南山抱子岩→终南山树林8→终南山神禾原");
		tell_object(me,"　　　　　　　　→终南山树林7→终南山老妪岩→终南山山道8→终南山大校场→终南山山路7→终南山山路6\n　　　　　　　　→终南山山路5→终南山山路4→终南山主峰→古墓山路→古墓空地→古墓树林1\n　　　　　　　　→古墓树林2→古墓草地→古墓墓门");
		tell_object(me,"$HIW古墓派入门师傅：$COM孙奶奶");
		tell_object(me,"$HIW古墓派拜师条件：$COM容貌25、悟性25、身法20、正声望、不收无性人\n");
		return 1;	
	}
		else if(!strcmp(comm, "xx") )
	{	
		tell_object(me,"\n$HIW星宿派拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　　→襄阳西北→长安函谷关→长安大官道2→长安大官道4→长安→西域嘉峪关\n　　　　　　　　→西域丝绸之路4→西域丝绸之路3→西域丝绸之路2→西域丝绸之路1→西域天山脚下→西域天山山路1\n　　　　　　　　→西域天山山路2→星宿海天山山路1→星宿海天山山路2→星宿海");
		tell_object(me,"$HIW星宿派入门师傅：$COM摘月子；天虎子；狮叫子；阿绿");
		tell_object(me,"$HIW星宿派拜师条件：$COM无条件\n");
		return 1;	
	}
		else if(!strcmp(comm, "xs") )
	{	
		tell_object(me,"\n$HIW雪山寺拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→武当黄土路3→武当松林\n　　　　　　　　→武当青石大道1→武当三不管→成都东府河桥→成都东→成都中→成都西\n　　　　　　　　→成都南河桥→血刀门雪山路1→血刀门雪山路2→血刀门雪山路3→血刀门山路1→血刀门山路2\n　　　　　　　　→血刀门山路4→血刀门雪山北麓→雪山寺");
		tell_object(me,"$HIW雪山寺入门师傅：$COM哥伦布");
		tell_object(me,"$HIW雪山寺拜师条件：$COM男性\n");
		return 1;	
	}
		else if(!strcmp(comm, "bt") )
	{	
		tell_object(me,"\n$HIW白驼山拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　　→襄阳西北→长安函谷关→长安大官道2→长安大官道4→长安→西域嘉峪关\n　　　　　　　　→西域丝绸之路4→西域丝绸之路3→西域丝绸之路2→西域丝绸之路1→西域大漠→白驼山戈壁\n　　　　　　　　→白驼山东街→白驼山西街→白驼山小桥→白驼山广场→白驼山石阶→白驼山大门\n　　　　　　　　→白驼山院子→白驼山大厅→白驼山练功场");
		tell_object(me,"$HIW白驼山入门师傅：$COM李教头");
		tell_object(me,"$HIW白驼山拜师条件：$COM无条件\n");
		return 1;	
	}
		else if(!strcmp(comm, "dl") )
	{	
		tell_object(me,"\n$HIW大理段氏拜师线路：$COM佛山→佛山西门→佛山林间道7→佛山林间道6→佛山林间道5→佛山林间道4\n　　　　　　　　　→佛山林间道3→佛山林间道2→佛山林间道1→大理城黄土路→大理城南门→大理城西\n　　　　　　　　　→大理城东→大理城王府大厅");
		tell_object(me,"$HIW大理段氏入门师傅：$COM古、诸、傅三卫士");
		tell_object(me,"$HIW大理段氏拜师条件：$COM正声望，17岁以下，一万经验以下。\n");
		return 1;	
	}
		else if(!strcmp(comm, "sl") )
	{	
		tell_object(me,"\n$HIW少林派拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　　→襄阳西北→长安函谷关→长安关洛道→扬州西门大道→扬州西门→扬州西南\n　　　　　　　　→扬州东南→扬州东门→扬州东驿道→泰山大驿道→泰山山脚→黄河岸边5\n　　　　　　　　→南阳城→北京汝州城→嵩山太室阙→少林寺石阶→少林寺山门殿→少林寺台阶\n　　　　　　　　→少林寺天王殿→少林寺精进场→少林寺勤修场→少林寺后殿→少林寺练武场→少林寺方丈楼\n　　　　　　　　→少林寺广场");
		tell_object(me,"$HIW少林派入门师傅：$COM清法、清无、清为三比丘");
		tell_object(me,"$HIW少林派拜师条件：$COM无条件，只收男性俗家弟子\n");
		return 1;	
	}
		else if(!strcmp(comm, "em") )
	{	
		tell_object(me,"\n$HIW峨嵋派拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→武当黄土路3→武当松林\n　　　　　　　　→武当青石大道1→武当三不管→峨嵋小路→峨嵋青石阶→峨嵋报国寺山门→峨嵋报国寺\n　　　　　　　　→峨嵋密林1→峨嵋伏虎寺→峨嵋密林2→峨嵋解脱坡→峨嵋观音堂→峨嵋归云阁\n　　　　　　　　→峨嵋玉女峰");
		tell_object(me,"$HIW峨嵋派入门师傅：$COM李、方、贝、赵、苏等俗家弟子，这里只列出方碧仪所在地路线");
		tell_object(me,"$HIW峨嵋派拜师条件：$COM正声望，经验一万以下。\n");
		return 1;	
	}
		else if(!strcmp(comm, "wd") )
	{
	
		tell_object(me,"\n$HIW武当派拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→武当黄土路3→武当松林\n　　　　　　　　→武当解剑岩→武当玄岳门→武当遇真宫→武当柏林→武当好汉坡→武当山路1\n　　　　　　　　→武当太子坡→武当石梁→武当十八盘→武当紫霄宫大门→武当广场→武当三清殿");
		tell_object(me,"$HIW武当派入门师傅：$COM谷虚道长");
		tell_object(me,"$HIW武当派拜师条件：$COM正声望\n");
		return 1;	
	}
		else if(!strcmp(comm, "th") )
	{	
		tell_object(me,"\n$HIW桃花岛拜师线路：$COM佛山→佛山东门→佛山林间道8→佛山林间道9→佛山林间道10→佛山林间道11\n　　　　　　　　→佛山林间道13→佛山林间道14→泉州西门吊桥→泉州→泉州北门→泉州山路5\n　　　　　　　　→泉州山路4→泉州山路3→泉州山路2→嘉兴南门→嘉兴城→嘉兴南湖→归云庄");
		tell_object(me,"$HIW桃花岛入门师傅：$COM陆踏风");
		tell_object(me,"$HIW桃花岛拜师条件：$COM读书写字10级，身法20，正声望，不收僧、道、无性人\n");
		return 1;	
	}
		else if(!strcmp(comm, "gb") )
	{	
		tell_object(me,"\n$HIW丐帮拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　→襄阳西北→长安函谷关→长安关洛道→扬州西门大道→扬州西门→扬州西南\n　　　　　　　→扬州南门→扬州草地8→扬州密林9");
		tell_object(me,"$HIW丐帮入门师傅：$COM李小斧、左齐");
		tell_object(me,"$HIW丐帮拜师条件：$COM不收无性人，无其他条件\n");
		return 1;	
	}
		else if(!strcmp(comm, "ry") )
	{	
		tell_object(me,"\n$HIW日月神教拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　　　→襄阳西北→长安函谷关→长安大官道2→长安青石大道→黑木崖龙门渡口→黑木崖黄土路4\n　　　　　　　　　→黑木崖乱石坡→黑木崖林间小道→黑木崖山谷→黑木崖石道1→黑木崖石道2→黑木崖猩猩滩\n　　　　　　　　　→黑木崖长滩→黑木崖山道→黑木崖石阶→黑木崖石门→黑木崖日月坪→黑木崖成德殿\n　　　　　　　　　→黑木崖后厅→黑木崖小花园→黑木崖小舍→黑木崖小舍内室");
		tell_object(me,"$HIW日月神教入门师傅：$COM东方爱莲");
		tell_object(me,"$HIW日月神教拜师条件：$COM只收无性人\n");
		return 1;	
	}
		else if(!strcmp(comm, "qz") )
	{	
		tell_object(me,"\n$HIW全真教拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　　→襄阳西北→长安函谷关→长安大官道2→终南山大官道→终南山山路2→终南山山路1\n　　　　　　　　→终南山脚→终南山道路13→终南山山路12→终南山道路11→终南山金莲阁→终南山山路10\n　　　　　　　　→终南山日月岩→终南山山道9→终南山树林9→终南山抱子岩→终南山树林8→终南山神禾原\n　　　　　　　　→终南山树林7→终南山老妪岩→终南山山道8→终南山大校场→终南山石阶1→终南山石阶2\n　　　　　　　　→终南山石阶3→终南山石阶4→终南山试剑岩→终南山教碑→重阳宫大门");
		tell_object(me,"$HIW全真教入门师傅：$COM知客、掌园、掌药、堂理、掌经各道长。这里只列出知客道长所在地。");
		tell_object(me,"$HIW全真教拜师条件：$COM无任何条件\n");
		return 1;	
	}
		else if(!strcmp(comm, "lj") )
	{	
		tell_object(me,"\n$HIW灵鹫宫拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　　→襄阳西北→长安函谷关→长安大官道2→长安大官道4→长安→西域嘉峪关\n　　　　　　　　→西域丝绸之路4→西域丝绸之路3→西域丝绸之路2→西域丝绸之路1→西域天山脚下→西域天山山路1\n　　　　　　　　→西域天山山路2→灵鹫缥缈峰山脚→灵鹫断魂崖→灵鹫失足岩");
		tell_object(me,"$HIW灵鹫宫入门师傅：$COM九天各部首领，这里只列出周奶奶所在地。");
		tell_object(me,"$HIW灵鹫宫拜师条件：$COM只收女性，无其他条件\n");
		return 1;	
	}
		else if(!strcmp(comm, "slj") )
	{	
		tell_object(me,"\n$HIW神龙教拜师线路：$COM佛山→佛山东门→佛山林间道8→佛山林间道9→佛山林间道10→佛山林间道11\n　　　　　　　　→佛山林间道13→佛山林间道14→泉州西门吊桥→泉州→泉州北门→泉州山路5\n　　　　　　　　→泉州山路4→泉州山路3→泉州山路2→泉州山路1→泰山大驿道→泰山山脚\n　　　　　　　　→黄河岸边5→南阳城→北京汝州城→北京大驿道9→北京塘沽口→神龙教海滩\n　　　　　　　　→神龙教灌木林→神龙教空地→神龙教大道");
		tell_object(me,"$HIW神龙教入门师傅：$COM赤、黄、青、黑四龙使，这里只列出黑龙使张淡日所在地。");
		tell_object(me,"$HIW神龙教拜师条件：$COM负声望，只收神龙教徒。");
		tell_object(me,"$HIW神龙教入教条件：$COM神龙教的赤黄青黑四龙使都在各地出游，找到他们可以提出加入神龙教，\n　　　　　　　　不过因为洪教主近年来只喜欢少年男女（有恋童癖？怕怕），所以年龄大于24岁的\n　　　　　　　　玩家就免问了，入教以后才能拜教中人为师，学习蛇岛武功。\n");
		return 1;	
	}
		else if(!strcmp(comm, "mj") )
	{	
		tell_object(me,"\n$HIW明教拜师线路：$COM佛山→佛山北门→佛山南岭山口→武当黄土路2→襄阳草地→襄阳西南\n　　　　　　　→襄阳西北→长安函谷关→长安大官道2→长安大官道4→长安→西域嘉峪关\n　　　　　　　→西域丝绸之路4→西域丝绸之路3→明教昆仑山下→明教青石大道1→明教四门广场→明教天门男舍");
		tell_object(me,"$HIW明教入门师傅：$COM天、地、风、雷四门主，这里只列出天字门主天高所在地。");
		tell_object(me,"$HIW明教拜师条件：$COM只收明教教徒。");
		tell_object(me,"$HIW明教入教条件：$COM明教的情况比较特殊，既是一个门派，又是一个帮会。只要不是其他帮\n　　　　　　　会(如段府、丐帮等)的成员，就可以提出加入明教，先找到青龙白虎玄武朱雀\n　　　　　　　神蛇任意一位坛主，拿到推荐信后到昆仑山总坛把信交给接引使，就收入教。\n");
		return 1;	
	}
	return CItem::handle_action(comm, me, arg);
}

ITEM_END;