// wiz_teacher2.h 武侠考官

NPC_BEGIN(CNwiz_teacher2);

virtual void create()
{
	set_name("超级深蓝", "chao nao");
	set("title", "电脑怪才");
	set("long","节日快乐,高科技时代你对电脑了解多少？答对我的问题可有好东东啊！ ");
	set("gender", "女性");
	set("age", 75);
	set("class", "scholar");
	set("attitude", "friendly");
	set("shen_type", 1);
	set("str", 40);
	set("int", 40);
	set("con", 40);
	set("dex", 40);
	set("per", 40);
 	set("icon",young_woman1);
	
	set("max_hp", 15500);
	set("mp", 3000);
	set("max_mp", 5000);
	set("mp_factor", 100);
	set("combat_exp", 10000000);
	set("score", 200000);

}


int do_talk(CChar * me, char * ask = NULL)
{
	char msg[255];
	static struct{
		int key;											//正确答案
		char title[255];									//题目
		char key1[255],key2[255],key3[255],key4[255];		//答案
	}exam[1367] = {
{1,"源程序要正确地运行,必须要有什么函数?","main函数","printf函数","自定义的函数","不需要函数",},
{1,"硬盘工作时,因注意避免","强烈振动","环境卫生不好","噪声","光线直射",},
{1,"在FoxBASE数据库管理系统中,内存变量文件的扩展名是：",".MEM",".DBT",".DBF",".TXT",},
{1,"下列DOS组合控制键中,能使标准输出同时送到屏幕与打印机的是：","Ctrl+P","Ctrl+C","Ctrl+Break","Ctrl+H",},
{1,"adsl被通常称为","宽带网","一线通","微波","atm",},
{1,"MS-DOS环境中同时按[Ctrl]和[Break]两个键,其作用是：","终止当前操作","暂停当前操作","关机","热启动",},
{1,".mdb是什么类型文件？","数据库文件","文本文件","程序文件","图像文件",},
{1,"一张1.44兆的3.5英寸软盘的每一个扇区的存贮容量是多少？","512k","1024k","216k","128k",},
{1,"如果要中止一个正在运行的FoxBASE程序并返回圆点提示符,应当按：","Esc","F1","Ctrl+Break","Ctrl+Alt+Del",},
{1,"FoxBASE的ZAP命令可以删除当前数据库文件的：","全部记录","满足条件的记录","结构","有删除标记的记录",},
{1,"微型计算机使用的键盘中Ctrl键称为","控制键","换档键","强行退出键","回车键",},
{1,"计算机系统的硬件系统包括","主机和外设","CPU和外存","CPU和存储器","主机和外存",},
{1,"NETBIOS不使用下面哪一个端口","136","137","138","139",},
{1,"栈的操作特性是：","先进后出","随机进出","先进先出","出优于进",},
{1,"Windows XP核心基于何种技术?","NT技术","NF技术","NFTS技术","XP技术",},
{1,"计算机之所以能够按照人的意图自动的进行操作,主要是因为采用了","存储程序控制","高级语言","高速的电子元件","二进制编码",},
{1,"计算机病毒通常是","一段程序代码","一条命令","一个标记","一个文件",},
{1,"只读光盘是","CD-ROM","WO","MO","WORM",},
{1,"在微机中与VGR密切相关的设备是","显示器","鼠标","键盘","针式打印机",},
{1,"“水晶宝盒”是哪个电脑刊物出版的光盘？","《大众软件》","《电脑爱好者》","《新潮电子》","《计算机应用文摘》",},
{1,"“LCD”指的是什么？","液晶显示器","CPU的一种品牌","软件公司名称","一种应用软件",},
{1,"Cable Modem的中文意思是什么？","电缆调制解调器","机顶盒","小型调制解调器","光纤",},
{1,"10BASE5的接头是","AUI","BNC","Rj-45","都不对",},
{1,"路由器工作在____?","网络层","物理层","数据链路层","高三层",},
{1,"最高域名“.cn”代表_______","中国","日本","加拿大","美国",},
{1,"两台计算机利用电话线路传输数据信号时必备的设备是_______。","调制解调器","网卡","中继器","同轴电缆",},
{1,"在常用的传输介质中,带宽最宽、信号传输衰减最小、抗干扰能力最强的一类传输介质是_____。","光纤","双绞线","无线信道","同轴电缆",},
{1,"FLASH5中的ActionScript,从FLASH4的20个激增到多少个？","200个","220个","250个","180个",},
{1,"8086微处理器一共有多少个可编程寄存器？","14","13","20","18",},
{1,"Internet中的IP地址由四个字节组成,每个字节间用_____符号分隔开。。",".",",","；","。",},
{1,"以下哪一个电脑装置是纯输入装置?","键盘","硬盘","中央处理器","声卡",},
{1,"VBScript 有几种数据类型？","一种","二种","三种","四种",},
{1,"使用IE时,整理收理夹快捷键是","Ctrl+B","Ctrl+H","Alt+B","Alt+H",},
{1,"以下哪一种储存媒体,使用称为连续性方式的电脑技术？","磁带","光碟","软碟","硬碟",},
{1,"以下那个是没有生产主板的公司？","nvidia","Asus","Abit","ECS",},
{1,"现在微软的windows出到什么版本？","windowxp","window2000","windowme","window2001",},
{1,"所有标点符号都占一个汉字宽度称为（ ）制排法","全角","半角","开明","自由",},
{1,"在常用的物理量中1K表示的数量,与计算机中1K表示的数量是","后者大于前者","前者等于后者","前者大于后者","不能比较大小",},
{1,"软盘上索引孔主要作用是","对每个文件的起点定位","机械定位","“0”磁道定位","对每个磁道的起点定位",},
{1,"请问下面哪个DOS命令是外部命令?","xcopy","dir","del","copy",},
{1,"MCS-51单片机有几个I/O端口？","4","2","5","6",},
{1,"如何在IE中用快捷键打开新的窗口","CTRL+N","ALT+C","SHIFT+N","CTRL+C",},
{1,"在五筆字型中“乙 ”是：","NNLL","NNYY","NNYL","NLNY",},
{1,"電腦是由哪兩大部分組成？","硬件和軟件","顯示器和硬件、軟件","主機和儲存器","硬件和軟件、主機",},
{1,"请问热启动应按那几个组合键?","Ctrl+Alt+Del","Ctrl+Alt+End","Ctrl+Shift+del","Alt+Shift+del",},
{1,"javascript中的alert函数生成的提示窗口有几个按钮?","1","2","3","4",},
{1,"75的十六进制写法为","0x4b","113","0x3d","165",},
{1,"启动MS-DOS操作系统后下列文件已驻留内存是","COMMAND.COM","DISKCOPY.COM","FORMAT.COM","CCCC.EXE",},
{1,"请问下列那个不是压缩解压软件?","winamp","winrar","arj","winzip",},
{1,"tcp/ip协议有几层体系结构？","4","2","3","5",},
{1,"PC是什么意思？","个人电脑","信息技术","国贸","无特别用意",},
{1,"数据库系统的核心是","数据库管理系统","操作系统","数据库","编译系统",},
{1,"状态寄存器也叫","标志寄存器","通用寄存器","累加器","寄存器",},
{1,"请问下边哪个文件不是拷贝“命令”？","HD-COPY","XCOPY","COPY","DISKCOPY",},
{1,"奔4的最低主频是？","1.4G","1.3G","1.2G","1.5G",},
{1,"我国第一台晶体管计算机叫什么名字？","10.26","104","121","108",},
{1,"大型机时期是以哪个公司为领导的？","IBM","DEC","Intel","20",},
{1,"第一台晶体管计算机的叫什么名字？","Leprechan","UNIVAC_I","IBM7090","EDSAC",},
{1,"晶体管计算机是第几代计算机？","二","一","四","三",},
{1,"世界上第一台使用二进制的计算机叫什么？","EDVAC","ENIAC","UNIVAC_U","EDSAC",},
{1,"世界上第一台具有存储程序功能的计算机叫什么？","EDVAC","ENIAC","UNIVAC_U","EDSAC",},
{1,"一般说,TCP/IP的IP提供的服务是？","网络层服务","运输层服务","会话层服务","表示层服务",},
{1,"网址中的-http是","传输协议与资源类型","主机的IP地址或域名","资源在主机上的存放路径","用户名",},
{1,"两台电脑上网可以不用什么？","调制解调器","电话","网卡","服务器",},
{1,"哪一年,Intel公司推出80386标志着第四代微处理器的开始？","1985","1984","1986","1987",},
{1,"1973年12月,什么的研制成功,标志着第二代微处理器的开始？","8080","Z-80","M6800","3000",},
{1,"Internet时期是以哪个公司为领导的？","不知道","IBM","Intel","Microsoft",},
{1,"小型机时期是以哪个公司为领导的？","DEC","IBM","Intel","Microsoft",},
{1,"哪个不是PHOTOSHOP的储存格式文件？","CRD","JPG","PSD","GIF",},
{1,"下列哪一个不是DVD的标准容量？","DVD-13","DVD-9","DVD-10","DVD-5",},
{1,"办公自动化(OA)是目前文泛开展的一项计算机应用,按分类,它应属于下列哪一类？","数据处理","实时控制","科学计算","计算机辅助设计",},
{1,"使用超大规模集成电路制造的计算机应该归属于","第四代","第三代","第一代","第二代",},
{1,"CD-ROM属于","存储媒体","感觉媒体","表示媒体","表现媒体",},
{1,"MS-dos 文件系统目录的组织形式属于","树型结构","关系型结构","网络型结构","直线型结构",},
{1,"sound blaster 是哪间公司的品牌","CREATIVE","IBM","INTEL","SIS",},
{1,"魔法门VIII是那间公司制作的","3DO","EDO","ODO","牛蛙",},
{1,"Interner采用的协议类型为","TCP/IP","IEEE802.2","X.25","IPX/SPX",},
{1,"下列哪个软件可以浏览网页","IE5.5","PHOTOSHOP6.0","NETEYE","WORD",},
{1,"记事本中查看指定行代码的快捷键是什么","Ctrl+g","Ctrl+f","Ctrl+l","Ctrl+k",},
{1,"第一块CPU哪一年生产?","1978","1988","1979","1989",},
{1,"下面那种不是电脑的标准外部设备","扫描仪","鼠标","键盘","光驱",},
{1,"TCO制定的认证标准被广泛地应用在_____等计算机外部设备上：","显示器","中央处理器","电源","机箱",},
{1,"Windows 98中的“剪贴板”是","内存中的一块区域","硬盘中的一块区域","软盘中的一块区域","高速缓存中的一块区域",},
{1,"当个人计算机以拨号方式接入1nternet网时,必须使用的设备是","调制解调器（Modem）","网卡","电话机","浏览器软件",},
{1,"在计算机中用——个2进制位表示一个字节","8","4","16","32",},
{1,"操作系统是一种什么软件？？","系统","实用","应用","编辑",},
{1,"一般的《特丽珑》显象管有什么特征","两条平行线","两条直线","两条斜线","没有特别特征",},
{1,"enter键是？？","回车换行键","输入键","空格键","换挡键",},
{1,"计算机中的字节是个常用单位,它的英文名字是？","byte","bit","bout","baud",},
{1,"响应NMI请求的必要条件是","一条指令结束","IF=1","IF=0","无INTR请求",},
{1,"一个8259可提供多少个中断类型号","8","1","16","64",},
{1,"单片机是","微型计算机","微处理器","微机系统","中央处理器",},
{1,"8086微处理器的一个典型总线周期需要几个T状态","4","3","2","1",},
{1,"在中文windows 95中启动中文dos,应执行下面哪个命令？","PDOS95.BAT","CDOS.bat","PDOS.BAT","CDOS95.BAT",},
{1,"IBM-PC/xt微型计算机采用的cpu芯片是什么？","8088","8085","80286","80386",},
{1,"下列四种软件属于应用软件的是哪个？","财务管理系统","UCDOS系统","BASIC解释程序","pascal编译程序",},
{1,"当前微型计算机不能用于什么领域？","电源线与信号线","天气预报","辅助教学","医疗器械",},
{1,"微型计算机显示器一般有两组引线,它们是什么？","电源线与信号线","信号线与地址线","控制线与地址线","电源线与控制线",},
{1,"微型计算机存储系统中,PROM表示什么？","可编程只读存储器","可读写存储器","动态随机存取存储器","只读存储器",},
{1,"文件型病毒传染的对象主要是（   ）类文件。","COM,EXE,","WPS","PRG","DBF",},
{1,"在表示存储的容量时,KB的准确含义是（   ）字节。","1024","1000","512","2048",},
{1,"加法的十进制调整指令格式","DAA","DAS","CWD","CBW",},
{1,"设二叉树有n个节点,则其深度","不确定","n-1","n","n+1",},
{1,"在因特网(internet)中,电子公告板的缩写是","BBS","ftp","WWW","E-mail",},
{1,"Word文档文件的扩展名是","DOC","WPS","TXT","BLP",},
{1,"下列哪个品牌是我国销量最大的？","联想","喜力","方正","四通",},
{1,"bit的意思是","二进制位","字","字长","字节",},
{1,"在微机系统中,最基本的输入输出模块BIOS存放在","ROM中","RAM中","硬盘中","寄存器中",},
{1,"IBM公司是指以下哪家公司？","美国商用机器公司","美国通用机器公司","美国商用电脑公司","美国商用电器公司",},
{1,"硬盘最常用的两种接口是","IDE/SCSI","LIP","LIP","PCI",},
{1,"k7的芯片生产厂商是","AMD","intel","cyrix","VIA",},
{1,"数字字符“1”的ASCII码的十进制表示为49,那么数字字符“8”的ASCII码的十进制表示为","56","54","60","58",},
{1,"下列设备中,只能作输出设备的是","打印机","磁盘存储器","鼠标器","键盘",},
{1,"计算机硬件能直接识别和执行的只有","机器语言","高级语言","符号语言","汇编语言",},
{1,"下面列出的四种存储器中,易失性存储器是","RAM","ROM","PROM","CD-ROM",},
{1,"计算机中数据的表示形式是","二进制","八进制","十进制","十六进制",},
{1,"windows98属于","操作系统","系统文件","游戏软件","文字处理软件",},
{1,"E-mail是什么意思","邮件","短信息","提示","病毒",},
{1,"微型计算机中使用的关系数据库,就应用领域而论,是属于","数据处理","实时控制","科学计算","计算机辅助设计",},
{1,"以体坛明星命名的病毒是什么名字？","库尔尼科娃","辛吉斯","达文波特","伏明霞",},
{1,"被人们称为第九艺术的是什么？","电脑游戏","电影","电视","京剧",},
{1,"下列诸因素中,对微型计算机工作影响最小的是","噪声","温度","湿度","尘土",},
{1,"下面列出的四项中,不属于计算机病毒特征的是","免疫性","潜伏性","激发性","传播性",},
{1,"下列哪些软件不是杀毒软件？","命令与征服","kill98","kv300","瑞星",},
{1,"高速缓冲存储器称为（）","CACHE","ROM","RAM","CAM",},
{1,"下列四种设备中,属于计算机输入设备的是","鼠标","打印机","显示器","硬盘",},
{1,"一张普通3.5英寸双面高密度软盘片的容量为","1.44MB","1.2MB","2.88KB","1.44KB",},
{1,"下面哪种设备经常使用“分辨率”这一指标","显示器","针式打印机","键盘","鼠标",},
{1,"以下哪一种不是图片格式？","inf","jpg","bmp","gif",},
{1,"FoxBASE的数据类型有（   ）种。","6","4","5","3",},
{1,"FoxBASE系统允许最多同时打开的数据库文件数是：","10个","48个","1个","7个",},
{1,"下列命令中属于内部命令的是：","DIR","SYS","COMP","DISKCOMP",},
{1,"在文字编辑时,以下哪个组合键是表示复制的？","ctrl+c","ctrl+v","ctrl+n","ctrl+b",},
{1,"特洛伊木马式黑客程序BO2K是由哪个黑客组织开发的？","cDc","aDa","eDe","oDo",},
{1,"关闭窗口的快捷键是以下哪组？","Alt+F4","Alt+F5","Alt+F3","Alt+F6",},
{1,"综合业务数字网的英文缩写是：","ISDN","ISSN","IAKN","ITCN",},
{1,"以下哪款是屏幕捕捉软件？","以上都是","Capture Professional","CapturEze Pro","Snaslt",},
{1,"“32位微机”中的32指的是","机器字长","内存容量","存储单位","微机型号",},
{1,"regedit 的作用是什么？","修改注册表","格式化","从新启动","关几",},
{1,"_____由深圳腾讯计算机系统公司开发,是基于Internet的免费网络寻呼软件","OICQ","ICQ","SINAPAGER","MESSANGER",},
{1,"因特网起源的前身是什么网？","ARPANET网","INTERNET网","NSFNET网","WWW网",},
{1,"后缀名是  “.edu“  的站点一般表示什么机构？","教育","军事","政府","网络",},
{1,"后缀名是.mil的站点一般指什么机构？","军事","政府","教育","网络",},
{1,"浏览网页可用：","ie","ic","id","ip",},
{1,"硬盘分区的命令是","fdisk","copy","dir","format",},
{1,"PDA如何理解?","个人数字助理","掌上电脑","掌上便携式电脑","模拟光驱",},
{1,"cgi可以为我们提供很多功能,下面错误的是：","动态矢量图形","顾客信息表格的提交以及统计","搜索程序","web数据库",},
{1,"fpe的制作公司是那间？","第三波","金山公司","北京豪杰","MICRSOFT",},
{1,"於______年时,美国正式使用TCP/IP协定,并将此协定当成整个国防部网路的标准协定。","1982","1986","1977","1980",},
{1,"DOS中,命令TYPE可以显示哪种文件","文本","目标","机器代码","可执行",},
{1,"根据DOS系统关于文件的命名规则,下列命令中合法的是","3AB.TXT","A3B,TXT","3BC〈.BAT","C＼ABC.COM",},
{1,"k7是那个公司的产品","AMD","TDA","ADM","ADT",},
{1,"下列四个无符号十进制整数中,能用八个二进制位表示的是","201","257","313","296",},
{1,"Windows NT视窗式IP查询法","WinIPcfg","ping","tracert","Show me the ip",},
{1,"扫描仪属于什么设备？","输入","输出","显卡","不是电脑设备",},
{1,"计算机所能辨认的最小信息单位是?","位","字节","字","字符串",},
{1,"ACDSEE是什么工具？","图片浏览器","汉化工具","压缩软件","播放软件",},
{1,"cih病毒的发作日期是每月的那天?","26","25","24","27",},
{1,"winzip属于什么软件？","压缩软件","音频软件","MP3播放器","编程软件",},
{1,"常用的打印机的种类不包括","机械式","针式","喷墨式","激光式",},
{1,"随机存贮器的英文缩写是","RAM","CRT","ROM","CPU",},
{1,"微机系统中的外设有显示器,打印机等外还有","键盘","RAM","ROM","CPU",},
{1,"HUB的中文名称是什么？","集线器","交换器","信号放大器","文件服务器",},
{1,"标准的ASCII码采用什么制的编码","七位二进制","八位二进制","六位三进制","五位四进制",},
{1,"OSI机构所成立的时间___TCP/IP","晚於","早於","同时於","不确定",},
{1,"DOS命令中的attrib是个什么命令？","显示文件属性","显示文件大小","显示文件位置","显示文件创造时间",},
{1,"LINUX属于那种软件","FREE","NOT FREE","测试版","共享版",},
{1,"我们日常生活中常见的PC系列机属于","微型机","大型机","中型机","小型机",},
{1,"CAD的含义是什么？","计算机辅助设计","计算机辅助教学","计算机辅助管理","计算机辅助测试",},
{1,"第一台电脑的中量有多重？","50斤","40斤","30斤","20斤",},
{1,"DOS命令分为內部命令和外部命令前者是常驻---的","C）内存","A）ROM","B）磁盘","D）盘",},
{1,"金山词霸三是那间公司制作？","金山公司","银山公司","铜山公司","铁山公司",},
{1,"打开Windows资源管理器的快捷键是","Win＋E","Win＋W","Win＋Q","Win＋S",},
{1,"硬盘格式化的命令是","FORMAT","COPY","XCOPY","DIR",},
{1,"下列那些不是显卡","Sound","VooDooV","TNT2","GeForce",},
{1,"要快速格式化硬盘应加参数","/Q","/S","/C","/U",},
{1,"www.mydrivers.com是一个什么类型的网站？","下载硬件驱动程序","下载MP3歌曲","下载软件","搜索系统",},
{1,"cs是什么寄存器","代码寄存器","段寄存器","数据寄存器","地址寄存器",},
{1,"windows XP 将在什么时候正式发布？","37189","37149","37126","37202",},
{1,"OICQ是什么工具？","寻呼工具","编程工具","MP3播放器","黑客工具",},
{1,"CD-ROM中标称40x、45x、50x、52x等的数值是指什么？","CD外圈的最大速度","CD内圈的最大速度","CD-ROM外圈的最大速度","CD-ROM内圈的最大速度",},
{1,"查看磁盘卷标的DOS命令是","VOL","VER","DIR","VERIFY",},
{1,"微机的诊断程序属于","系统软件","应用软件","管理软件","编辑软件",},
{1,"用FORTRAN语言编制的源程序,要变为目标程序,必须经过","编译","汇编","编辑","解释",},
{1,"微机计算机的发展是以什么的发展为表征的","微处理器","主机","软件","控制器",},
{1,"在微机中,应用最普遍的字符编码是","ASCII码","BCD码","汉字编码","补码",},
{1,"使用高级语言编写程序称为","源程序","编辑程序","编译程序","连接程序",},
{1,"ENTER键是","回车换行键","输入键","换档键","空格键",},
{1,"十六进制数1000转换成十进制数是","1024","4096","2048","8192",},
{1,"所谓的“冰河”软件是？","远程控制工具","防病毒工具","克隆工具","防火墙工具",},
{1,"SnagIt 5是属于什么软件？","抓图软件","系统检测软件","图形制作软件","聊天软件",},
{1,"foxmail是用来干什么的？","收发电子邮件","防邮件病毒","远程控制邮件系统","专用的整理邮件",},
{1,"FLASH5.0是什么软件","制作动画","制作图片","杀毒","下载",},
{1,"内存和硬盘存储相比,哪个正确？","速度快,容量小。","速度快,容量大。","速度慢,容量小。","速度慢,容量大。",},
{1,"有一个数值152,它与十六进制6A相等,那么该数值是","八进制数","二进制数","十进制数","四进制数",},
{1,"硬盘工作时应特别注意避免","震动","潮湿","日光","噪声",},
{1,"使用软磁盘写保护后,则该软磁盘（）。","只能读而不能写","既不能读也不能写","只能写而不能读","既能读也能写",},
{1,"计算机存储器中的一个字节可以存放：","一个英文字母","一个汉字","一个分数","一个小数",},
{1,"第三代计算机的逻辑器件采用的是","中、小规模集成电路","小规模集成电路","大、小规模集成电路","中规模集成电路",},
{1,"在计算机中,常用的数制是：","二进制","十进制","十六进制","八进制",},
{1,"在微型计算机的汉字系统中,一个汉字的内码占多少字节？","2","1","4","8",},
{1,"FOXBASE的俗名叫什么？","数据库","编辑库","文档库","程序库",},
{1,"电脑整机中cpu又名什么?","中央处理器","内存","硬盘","主板",},
{1,"哪个不是网络三剑客？","Photoshop","Flash","Dreamweaver","Fireworks",},
{1,"MS-DOS文件系统目录的组织形式属于","树型结构","关系型结构","网络型结构","直线型结构",},
{1,"一片存储容量是1,44MB的软磁盘,可以存储大约140万个","ASCII字符","子目录","磁盘文件","中文字符",},
{1,"只能作为输入设备的是","图形扫描仪","硬盘","软驱","绘图仪",},
{1,"我们通常所说的猫是？","调制解调器","调制器","解调器","显示器",},
{1,"什么是SMTP？","邮件传输协议","安全验证协议","邮件接收协议","身份验证协议",},
{1,"bit的意思是","二进制位","字节","字长","字",},
{1,"下面哪一个是术语“认证”的英文","Authentication","Authorization","Accountability","Application",},
{1,"agenow.com的中文名字叫什么？","新生代","现代青年","新所代","青年时代",},
{1,"DOS命令中cls有什么作用？","清屏","时间","日期","列表",},
{1,"1MB的含义是","1024K个字节","1000K个字节","1000K个汉字","1024K个汉字",},
{1,"内存中ROM中的数据在断电后会丢失吗？","不会","会","部分","有时",},
{1,"WPS是一种","文字处理软件","数据库管理软件","操作系统","CAD软件",},
{1,"创建一个新的目录应使用DOS命令","MD","CD","CREATE","RD",},
{1,"WPS属于","应用软件","操作系统","实时处理软件","系统软件",},
{1,"以下什么不是DOS的命令","LIST","COPY","FORMAT","TYPE",},
{1,"以下哪条命令是的文件拷贝命令？","COPY","DISKCOPY","FORMAT","TYPE",},
{1,"在汉字系统下,计算机中一个汉字相当于多少个英文字符？","2","4","1","半",},
{1,"c语言是什么语言？","低级语言","高级语言","机器语言","汇编语言",},
{1,"FLASH又名闪客它的功能是什么","做动画","做视频","音频","听歌",},
{1,"unix下最基本的访问模式没有","调试","读","写","执行",},
{1,"随机存贮器的简称是？","RAM","rom","CAI","OIS",},
{1,"用什么键杀掉任务进程？","ctrl+del+alt","ctrl+del+shift","ctrl+del+tab","del+shift+ctrl",},
{1,"Photoshop6.0默认的文字编排变形有几种方式？","15","16","14","13",},
{1,"AMD Duron 和 Althlon 处理器超频的方法是下列哪种","铅笔超频法","加电压法","冷却法","以上都对",},
{1,"怎样全屏观看IE","按F11","按F10","按IE上方的正方形","快速点击2下窗口",},
{1,"要删除文件时,按住什么键可以直接把文件永久删除","SHIFT","TAB","CTRL","ALT",},
{1,"微型计算机的性能产要取决于：","中央处理器","硬盘","显示卡","内存",},
{1,"AMD的Socket A接口处理器有几个管脚？","462","423","370","295",},
{1,"下面哪一种语言不是编程语言？","pasic","basic","c","c++",},
{1,"AGP全称是什么？","加速圖形系統","加速器","加速软件","即插即用",},
{1,"在dos中,删除当前目录下的一个空子目录,","rd","del","deltree","md",},
{1,"____不是BBS的功能。","听歌","讨论及交流","聊天","收发电子邮件",},
{1,"C程序中的指针变量是用来直接控制：","内存地址","普通变量","函数","表达式",},
{1,"那种技术不属于对CPU的描述","MDLP","MMX","多指令","3DNOW！",},
{1,"Java不仅提供了一个丰富的语言和运行环境,而且还提供了一个免费的Java开发工具集:","JDK","SDK","SGI","CGI",},
{1,"Java来自于Sun公司的一个____的项目","Green","Black","Yellow","Brown",},
{1,"液晶显示器和普通显示器相比主要有什么好处啊","几乎无辐射","分辨率高","画面更清晰","省电",},
{1,"下列哪个技术是形容声卡的？","光纤输出","MDLP","3D NOW！","MMX",},
{1,"MicrosoftExchangeServer,GroupWise,LotusNotes属于什么系统：","群件系统","单件系统","操作系统","邮件系统",},
{1,"在标准C++中有多少个三目运算符？","只有一个","两个","三个","四个",},
{1,"“世界计算机教育会议”简称？","WCCE","WCDE","WDCE","WCCC",},
{1,"哪个不是Microsoft的产品？","UNIX","WORD","WINDOWS","POWRPOINT",},
{1,"一个1.2MB的软磁盘可存储多少个汉字？","60万","12万","120万","80万",},
{1,"以下均为FoxBASE中的命令是：","COPY,DIR,CLEAR","QUIT,PAUSE,CREATE","DO,REM,APPEND","INPUR,ECHO,REPLACE",},
{1,"按着什么键可以停止光驱自动运行？","SHIFT","CTRL","ALT","SPACE",},
{1,"WINDOWS98没有那一个游戏？","弹珠台","扫雷","空当接龙","纸牌",},
{1,"IE里停止正在进行的快捷键是什么？","ESC","F5","F6","CTRL+C",},
{1,"五笔里面的Z起什么作用？","查询","边旁","字根","单字",},
{1,"网络蚂蚁是哪里产的软件？","大陆","香港","台湾","美国",},
{1,"网络蚂蚁是哪里产的软件？","大陆","香港","台湾","美国",},
{1,"电脑硬件中网卡英文全称为？","network interface card","network incorrect system","network intel card","network interst cray",},
{1,"计算机能够直接识别和处理的语言是（）。","机器语言","自然语言","汇编语言","高级语言",},
{1,"通常所说的24针打印机属于","击打式打印机","热敏打印机","喷墨打印机","激光打印机",},
{1,"DOS命令中的逻辑删除是永久性删除吗？","不是","是","对扩展名是exe的文件是","以上都不对",},
{1,"显示Ｂ盘上的目录正确操作命令是？","Ａ＞ＤＩＲ　Ｂ：／Ｐ","Ａ＞Ｂ：ＤＩＲ／Ｗ","Ａ＞ＤＩＲ／ＭＢ：","Ｂ＞Ａ：ＤＩＲ／Ｐ",},
{1,"计算机中地址和数据全部相信的存储和运行是用？","二进制数","八进制数","十进制数","十六进制数",},
{1,"重复显示上次使用的整个ＤＯＳ命令可用？","Ｆ３","Ｆ４","Ｆ２","ＥＳＣ",},
{1,"当Ａ盘上的文件拷入当前盘应该是？","COPY A:*.*","A;","DIR A;","DIR ???.*",},
{1,"主板外频的标准频率有：","都对","100","66","都不对",},
{1,"“南桥,北桥”在计算机上的哪个部件：","主板","cpu","显卡","声卡",},
{1,"win98的密码匙有多少位：","25","20","24","30",},
{1,".prg是什么文件？","数据库程序文件","数据库文件","文本文件","图形文件",},
{1,"以下什么代码代表了计算机测试？","CAI","CAD","CAM","CAH",},
{1,"以下什么代码代表了计算机辅助制造？","CAM","CAD","CDD","CBD",},
{1,"微型机使用的3.5英寸软盘的写保护窗口打开时","只能读不能写","只能写不能读","既能读又能写","不起任何作用",},
{1,"DOS命令分为内部命令和外部命令两种,前者是常驻什么的？","内存","ROM","C盘","磁盘",},
{1,"计算机热启不用那个键","SHIFT","CTRI","ALT","DELETE",},
{1,"MS-DOS是一个什么操作系统？","单用户单任务","多用户多任务","单用户多任务","多用户单任务",},
{1,"以下什么程序负责服务器于html之间的接口","CGI","API","GUI","AVI",},
{1,"哪个是路由器著名品牌","cisco","philips","gigabyte","inter",},
{1,"哪个是著名显示器生产厂家：","philips","microsoft","sun","compaq",},
{1,"HP(惠普)公司的原名是","Hewlett-Packard","HuiPu","HumanPersonality","HugeProbe",},
{1,"DDR是什么?","双倍速数据传输","内存类型","双内存","双数据",},
{1,"HTML是编写什么的语言？","网页","游戏","操作系统","网页动画",},
{1,"电脑中哪个键能开小键盘","numlock","home","pgup","end",},
{1,"计算机当中,是以多少进制来传输数据的？","二进制","十进制","八进制","十六进制",},
{1,"下面各个操作系统不是UNIX的是：","DOS","AIX","SOLARIS","SCOUNIX",},
{1,"中文ward7.0是在什么环境下运行?","windows 95","windows 3.2","ucdos","dos",},
{1,"下列那一项软件是用于下载的软件？","netants","outlook express","winamp","voxphone",},
{1,"在Windows的热键中,Alt+F4键是做什么用的？","关闭当前窗口","关闭计算机","打开一个新窗口","关闭所有窗口",},
{1,"Fantasis浏览器是哪个国家的人编制的？","中国","日本","美国","印尼",},
{1,"执行COPY A.TXT+B.TXT这个DOS命令后得到的磁盘文件是","A.TXT","B.TXT","A+B.TXT","B+A.TXT",},
{1,"东软公司是原来的哪一家公司啊？","东大阿尔派","东方网景","金山公司","北大方正",},
{1,"在下列命令中不是dos内部命令的是：","fc","copy","ver","dir",},
{1,"下面哪一个不属于计算机语言","windows","cobol","fortran","basic",},
{1,"pentium是哪个公司的cpu","intel","ibm","nec","microsoft",},
{1,"在关系数据库的三种基本关系运算中不包括","比较","连接","选择","投影",},
{1,"从计算机的键盘中输入汉字时,输入的是汉字的","外码","内码","交换码","ASCII",},
{1,"不属于计算机网络设备的是","光驱","网卡","HUB","网桥",},
{1,"要把一台计算机与网络连接起来,需要的设备是","网络适配器","HUB","GATEWAY","ROUTER",},
{1,"在计算机领域中,字符ASCII码属于","表示媒体","表现媒体","存储媒体","感觉媒体",},
{1,"能够重写的光盘是","MO","WORM","WO","CD-ROM",},
{1,"能够重写的光盘是","MO","WORM","WO","CD-ROM",},
{1,"在WORD主窗口的右上角,可以同时显示的按钮是——","最小化,还原,关闭","最小化,还原,最大化","还原,最大化,关闭","还原,最大化",},
{1,"一台微机的内存是4M是指-----的容量","RAM","PROM","ROM","EPROM",},
{1,"一般情况下,winnt和win98双操作系统中,怎样的分区才能互访所有的文件","fat16","fat32","ntfs","fat32和ntfs",},
{1,"我们常说的ASCII是：","美国标准信息交换码","中国标准信息交换码","英国标准信息交换码","法国标准信息交换码",},
{1,"电脑的存储容量主要取决于","硬盘","CPU","显示器","RAM",},
{1,"C语言程序是由？组成的","函数","过程","子函数","主程序和子程序",},
{1,"五笔字型输入法是属于","字型编码","数字编码","字音编码","音型编码",},
{1,"下面哪个不属于网络操作系统？","DOS","Windows NT","NetWare","Unix",},
{1,"以下主板可以上赛扬IICPU","GA-6OXE","GA-7ZMM","GA-7IXE4","GA-7ZX",},
{1,"下面那一个不是生产CPU的公司？","AOL","Intel","Motorola","Viacn",},
{1,"下面哪一个不是MS OFFICE系列的应用程序","Microsoft　Project","Microsoft　Excel","Microsoft　Frontpage","Microsoft　Acess",},
{1,"下列哪个软件不是属于Windows媒体播放的","WinZip","RealPlayer","WinAMP","Mplayer",},
{1,"一张1.44兆的3.5英寸软盘有多少个扇区？","18","20","16","22",},
{1,"一张1.44兆的3.5英寸软盘有____个磁道。","80","78","70","69",},
{1,"怎么样提高电脑性能？","磁盘碎片整理","清空回收站","磁盘清理程序","磁盘扫描程序",},
{1,"下面各项中,不是微机基本组件的是","打印机","CPU","I/O接口","存储器",},
{1,"十进制数28.625的二进制数为","11100.101","101000.101","101000.101","11101.101",},
{1,"一个字节包含的二进制位数是:","8位","16位","32位","256位",},
{1,"CPU：P3的下一代叫什么？","安腾","P4","PP","奔腾",},
{1,"传送速率单位“bps”代表什么意义。","Bits　Per　Second","Bytes　Per　Second","Billion　Per　Second","Baud　Per　Second",},
{1,"C++语言是面向（）的语言。","对象","过程","结果","编辑",},
{1,"“LAN”是指什麽？","local area network","land area network","language area network","都不是",},
{1,"windows98系统有多大兆？","350","300","400","450",},
{1,"不同计算机中(  )的长度是固定不变的.","字节","字段","字长","指令",},
{1,"下面属于网页编辑的软件是？","frontpage","RichWin Viever","Winzip","mIRC",},
{1,"在以太网中,如果两站最大传播延迟是1,则一站点发送信号后需继续监听的时间为多少？","2","1","4","直至发送完毕",},
{1,"FIREWORK是用来干什么的","网页制作","图像处理","文本编辑","动画制作",},
{1,"下列属于微机所特有的设备是","服务器","显示器","UPS电源","鼠标器",},
{1,"计算机病毒是可以造成机器故障的——","一种计算机程序","一种计算机设备","一种计算机芯片","一种计算机部件",},
{1,"下列哪个IP地址是正确的？","10.1.155.23","255.256.2.1","256.255.23.5","10.1.156.256",},
{1,"REALPLAY播放器能播放MP3吗？","能","不能","不知道","没有这种播放器",},
{1,"网络的IP地址是唯一的吗？","是","有三个","不是","有两个",},
{1,"下面哪种播放格式最小？","mid","avi","mepg","rm",},
{1,"SISoft Sandra Standard是什么软件","系统测试软件","图形处理软件","文本处理软件","网页制作软件",},
{1,"令牌帧的？字段被目的计算机更改","帧状态字","帧检测","结束界符","目的地址",},
{1,"下列哪一项是汇编源程序文件的扩展名。",".ASM",".OVL",".LIB",".DOC",},
{1,"在msdos里哪个不是可执行的文件","*.bak","*.bat","*.exe","*.com",},
{1,"UNIX操作系统改文件名用","my","ren","del","open",},
{1,"比尔盖茨是哪个公司的总裁：","Microsoft","IBM","Intel","Tencent",},
{1,"硬盘的分区用的什么命令？","FDISK","COMS","LOAD","PASSWORD",},
{1,"DATE是什么意思？","日期","时间","硬盘","帮助",},
{1,"EAX是哪间公司的专利？","创新","傲锐","YAMAHA","没有EAX这个专利",},
{1,"在WINDOWS的操作中下列哪项正确","可以用鼠标也可以用键盘","必须用鼠标","必须用键盘","键盘、鼠标都可不用",},
{1,"指出下面错误的表达式","5.6+6.2%3.1","a+b=5","i=i++","a=5,b=6,c=7",},
{1,"计算机存储系统中,高速缓冲存储器可以：","提高整个系统的存储速度","增加存储容量","提高存储可靠性","作暂存存储器用",},
{1,"企业要想在全球范围内招聘人才,最好的途径是通过______进行。","国际互联网络","报纸","电视","人才中介",},
{1,"一般的浏览器用____来区别访问过和未访问过的连接。","不同的颜色","不同的字体","不同的光标形状","没有区别",},
{1,"AGP PRO插槽比一般的AGP插槽长,作用是什么？","保证供电充足","样子漂亮一点","新的AGP16x标准","专为大的显卡服务",},
{1,"BIOS属于哪一类型？","ROM","RAM","VCM","DRAM",},
{1,"WDM的全名是什么？","Windows 32 Driver Mode","Windows 16 Driver Mode","Windows Driver Mode","Windows Drivers Mode",},
{1,"MP3同CD相比,有什么区别？","MP3没有高频","MP3没有中频","MP3没有低频","两者一样",},
{1,"光缆的缆芯是____。","玻璃纤维","铜芯","铁芯","塑料纤维",},
{1,"指出下面合法的标识符:","ABC","3ab","abc f","sum.a",},
{1,"下列哪个是CPU的制造商:","Intel","microsoft","tencent","sun",},
{1,"C语言中整形常量按进制划分,以下几种哪种不是","二进制常量","十六进制常量","十进制常量","八进制常量",},
{1,"指出下面哪些是合法的用户定义的标识符?","putchar","double","*par","sheep!",},
{1,"Microsoft Visual FoxPro中的Form是什么？","表单","字体","页框","容器",},
{1,"可以同时在两个方向上传输数据的通信方式称为？","全双工通信方式","单工通信","半双工通信","模拟通信",},
{1,"我国帧中继业务是哪一年开通的？","1994","1990","1989","1996",},
{1,"OSI的哪一层涉及数据加密？","表示层","网络层","会话层","传输层",},
{1,"内部信息对外提供的什么性称为信息封装？","不可见性","可见性","透明性","隐藏性",},
{1,"CD中存放着什么信息？","0和1","MP3","歌曲","电影",},
{1,"下面四个选项中,均不是正确的八进制数或十六进制数的选项是＿","oabc","16","10","0a12",},
{1,"C语言中的标识苻只能由字母,数字和下划线三种字符组成,且第一个字符＿。。","必须为字母或下划线","必须为字母","必须为下划线","可以是字母,数字和下划线中任意一种字符",},
{1,"下面四个选项中,均不是合法的拥护标识苻的选项是＿","b_a　goto　int","A　P_0　do","float　1a0 _A","_123　temp　INT",},
{1,"下列四组选项中,均不是C语言关键字的选项是＿","define　IF　type","getc　char　printf","include　scanf　case","while　go　pow",},
{1,"假设所有变量均为整型,则表达式（a=2,b++,a+b)的值是＿","8","7","6","2",},
{1,"下面哪一种交换方式将信息分成小的部分,分别在独立的路径中发送？","分组","报文","线路","虚拟",},
{1,"以下哪一种函数能被内联？","简单函数","递归函数","用指针调用的函数","含register的函数",},
{1,"以下哪一种能作为类的数据成员？","枚举类型","自动类型","寄存器类型","外部类型",},
{1,"对话控制是OSI参考模型哪一层的功能？","会话层","网络层","传输层","表示层",},
{1,"要连接Windows NT网络和Unix网络,需要","网关","网桥","路由器","桥式路由器",},
{1,"下载工具网络蚂蚁是谁的作品：","洪以容","李立波","刘晨军","王方一",},
{1,"通常我所说的16位增强色,其实有多少种颜色？","65535","3","32767","16",},
{1,"目前市场上光驱的速度已达多少倍速以上？","50","40","60","45",},
{1,"下列哪一种操作系统需要专用的服务器","Netware　V3.xx","Netware　Lite","Lansmart","Lansoft",},
{1,"perl做的程序原码是否公开?","是的","不是","可以公开也可以不公开","半公开",},
{1,"以下几种CSMA坚持退避算法中什么在监听到介质是空闲时仍可能不发送？","P-坚持CSMA","L-坚持CSMA","不坚持CSMA","以上都不是",},
{1,"网络操作系统三大阵营不包括：","win2000","unix","netware","microsoft windows",},
{1,"下面哪个命令是外部命令","ATTRIB","PATH","EXIT","PRIMPT",},
{1,"NFS的实现机制是","RPC","RSVP","XDR","TCP",},
{1,"NDIS规范包括OSI模型的第几层","2","1","2和3","1和2",},
{1,"子网中的数据交换方式可分为:","都对","线路交换","报文交换","分组交换",},
{1,"介质存取控制访问的方式:","都对","csma/cd","token king","token bus",},
{1,"csma/cd是由____公司的局域网概念提出的,并于____年发行","xerox     1972","ibm       1972","microsoft      1970","novell         1970",},
{1,"令牌环网主要用于的局域网","ibm","novell","unix","nt",},
{1,"光纤的纤芯由____制成","玻璃或槊料","玻璃","槊料","都不对",},
{1,"rg－11的阻抗是欧","50","75","100","25",},
{1,"数据信号在环形网络中一般以____方向转播","顺时针","逆时针","先顺后逆","先逆后顺",},
{1,"_____年microsoft推出winnt 4.0","1996","1995","1994","1993",},
{1,"netcaptor是什么工具？","浏览器","听歌","游戏","网页编辑",},
{1,"19XX年,Brian Kernighan为UNICS这个双人多工操作系统取的名字？","1970年","1965年","1972年","1958年",},
{1,"计算机正在运行的程序和数据放在(  )中.","主存","寄存器","辅存","硬盘和软盘",},
{1,"PCI系列586/60微软计算机,其中PCI是指(  )","总线标准","产品型号","微机系统名称","微处理器型号",},
{1,"PCI系列586/60微软计算机,其中PCI是指(  )","总线标准","产品型号","微机系统名称","微处理器型号",},
{1,"TCP/IP是一个( )","相关网络通信协议的集合","网络通信软件","单一的网络通信协议","链路层的通信协议",},
{1,"计算机局域网采用的拓扑结构主要有( )种","3","4","2","1",},
{1,"frontpage是哪间公司的产品？","微软","网景","INTER","第三波",},
{1,"java的数据库连接器是下面的哪一个？","jdbc","jbcd","dcbd","jbdc",},
{1,"快乐时光病毒可能感染下列哪种类型的文件？","*.htm","*.exe","*.com","*.txt",},
{1,"windows98中刷新的快捷键是?","f5","f6","f4","f7",},
{1,"在WORD中什么组合键可以实行辙回功能","CTRL+Z","CTRL+V","CTRL+C","CTRL+N",},
{1,"在类中,能被本类和派生类中的成员函数直接访问,但不能被外界访问的成员是：","保护成员","公有成员","私有成员","对象成员",},
{1,"IEEE 802.5是针对下列哪一个而制定的：","Token　Ring","CAMA/CD","Token　Bus","MAN",},
{1,"html中表单的两种提交方式是什么？","get和post","push和pull","get和put","put和set",},
{1,"javascript与java的关系是什么？","没关系","javascript是java的子集","java是javascript的子集","两者相同",},
{1,"在下列扩展名的文件中能,直接执行的是:",".BAT",".C",".BAK",".DAT",},
{1,"第二届中国网络小姐的冠军是？","蒋静","钟慧","余小楠","虞嘉",},
{1,"一个24位地址总线的微机系统,最大的内存容量是","16384KB字节","16384MB字节","1024MB字节","1024KB字节",},
{1,"TCP/IP协议的全称是？","Transmission　Control　Protocol","Transaction　Control　Protocol","Transact　Control　Protocol","Transalpine　Control　Protocol",},
{1,"ICMP的全称是_____?","Internet　Control　Message　Protocolata","Internet　Control　Message　Protocol","Internet　Control　Message　Proton","Internet　Conrtol　Message　Protocolota",},
{1,"其实“防火墙”是一种____技术","隔离","加密","拦截","解析",},
{1,"CAD图形输出的精度最主要的是取决于","绘图仪分辨率","显示器分辨率","图形输入仪分辨率","捕捉分辨率",},
{1,"哪个不是MODEM的芯片制作厂商","sony","cirrus logic","rockwell","ESS",},
{1,"在Internet上主机间使用什么协议进行相互通信？","TCP/IP","DNS","FTP","TELNET",},
{1,"32根地址总线所能寻址的地址范围是","4GB","1GB","2GB","8GB",},
{1,"公用电话网的简称是","PSTN","ISDN","DDN","X.25",},
{1,"哪个不是取出的按键？","F5键","F7键","F8键","F9键",},
{1,"哪个不是光驱的机楷结构","滚轮","主轴电机","激光头控制","托盘操控系统",},
{1,"ELSA影雷者GTS,影雷者MX等高档显示卡质保期是多少年？","6年","1年","2年","3年",},
{1,"ELSA影雷者MX采用什么显示芯片？","NVIDNA　GEFORCE2MX","NVIDIA　GEFORCE256","NVIDIA　GEFORCE2　GTS","RIVA　TNT2　M64",},
{1,"著名的多媒体厂商艾尔莎（ELSA）是什么地方的厂商？","德国","美国","中国","英国",},
{1,"C语言可执行程序的开始执行点是：","程序中的Main函数","包含文件中的第一个函数","程序中的第一条可执行语句","程序中的饿第一个函数",},
{1,"描述扫描仪的分辨率经常用的是?","PPI","DPI","PPI","BPI",},
{1,"在MS-DOS 6.0 中文件管理命令是:.......","MOVE,MSBACKUP","CHOPICE.COM","DELTREE","MIRROR",},
{1,"x-box是哪一个公司出的？","Microsoft","INTEL","Eidos","bestbuy",},
{1,"SRAM存储器是-----","静态随机存储器","静态只读存储器","动态随机存储器","动态只读存储器",},
{1,"不需要驱动程序的电脑配件是：","多媒体音箱","显卡","声卡","CD ROM",},
{1,"在WPS的一个文件中,最多可以定义几个块？","1个","2个","3个","4个",},
{1,"BIOS CMOS设定中,按什么快捷键是储存并离开设定的","f10","esc","f9","f5",},
{1,"linux中下面哪个命令是更改文件所有权的","chgrp","umask","attrib","touch",},
{1,"linux中下面哪个命令是更改文件所有权的","chown","umask","attrib","touch",},
{1,"linux中下面哪个命令是更改文件属性的","chmod","umask","attrib","touch",},
{1,"Linux中,下面各个命令哪一个是察看当前所在目录名字的。","pwd","ls","dir","whoami",},
{1,"下面的unix系统哪一个是AT&T公司的","UNIX　SVR4","SUNOS","HP-UX","XENIX",},
{1,"B语言是谁开发的？","Thompson","Ritchie","Richard","Tom",},
{1,"下列unix的shell中哪一个是所有unix系统都提供的","sh","bash","ksh","csh",},
{1,"POP邮件协议的默认端口是多少？","110","21","80","1080",},
{1,"下面的系统哪一个不属于非商业来源","Redhat　LINUX","BSD","FreeBSD","Debian　ＧＮＵ／Ｌｉｎｕｘ",},
{1,"下面的unix系统哪一个是IBM公司的","AIX","IRIX","NCR UNIX","FreeBSD",},
{1,"下面的unix系统哪一个是SantaCruzOperation(SCO)公司的","XENIX","SUNOS","HP-UX","UNIX SVR4",},
{1,"下面哪一个人参与了七十年代初unix的开发","KenThompson","BillGates","DouglasComer","PaulAllen",},
{1,"七十年代初unix的开发是在什么地方？","AT&T的贝尔实验室","美国国防部","英国剑桥大学","瑞典",},
{1,"下面哪一个人参与了七十年代初unix的开发","DenniaRitchie","BillGates","DouglasComer","PaulAllen",},
{1,"早期的unix使用什么语言写的","汇编语言","c语言","cobol语言","fortran语言",},
{1,"现在PC机中普遍采用的ISA总线（AT总线）扩充插槽可供插卡使用的硬中断有","11级","16级","15级","8级",},
{1,"unix系统中用___分隔一行中输入的多个命令。","分号","句号","逗号","冒号",},
{1,"80年代中国最大的计算机公司是哪一家？","太极计算机公司","联想","方正","长城",},
{1,"下列哪个是最快的网络传输方式？","光缆连入","卫星连入","电话线连入","ISDN连入",},
{1,"下列命令不属于LINUX的是","LS","CP","WHOAMI","MOVE",},
{1,"虚拟内存是指","一种利用硬盘的支持,以小的物理内存来模拟大的内存,使程序能够使用整个内存地址空间的技术。","一种利用光驱的支持,以小的物理内存来模拟大的内存,使程序能够使用整个内存地址空间的技术。","在软盘上建立交换文件来模拟内存,文件大小无限制。","在硬盘上建立交?",},
{1,"一个关系是一张二维表。在FoxBASE中,一个关系对应一个:","数据库文件","字段","记录","索引文件",},
{1,"FoxBASE 数据库文件允许每条记录的最大长度是?","4000字节","256字节","1000字节","10亿",},
{1,"在微机系统中,BIOS存放在(  )","ROM","RAM","CPU","寄存器",},
{1,"下列FORTRAN77源程序的变量名之中,不符合规则的是:","W─3","W","W3","W3W",},
{1,"普通电话线用MODEM上网的理论极限系几多？","64K","56K","33.6K","48K",},
{1,"在用TC++中的PRINTF（打印函数）时,应调用什么头文件？","stdio.h","stdlib.h","dos.h","graphics.h",},
{1,"用TC++编写的程序的扩展名是：","*.CPP","*.C","*.C++","*.BAT",},
{1,"IP地址是一个多少位的二进制地址？","32位","8位","64位","16位",},
{1,"以下几个软件中,不属于断点续传软件的是哪一个？","Acdsee","Netants","Flashget","Go!zilla",},
{1,"Amazon.com是谁创办的","Jeff_Bezos","BILL_GATES","Stallman","Dell_Amazon",},
{1,"用于大小写字母转化的键是？","Caps","Lock","Esc","Ctrl",},
{1,"AIX是哪一家公司的UNIX操作系统","IBM","MICROSOFT","REDHAT","CA",},
{1,"SOLARIS是哪个公司的操作系统","SUN","MICROSOFT","INPRISE","IBM",},
{1,"到今天2001.6.22为止,REDHAT的最高版本是","7.1","7.2","6.2","6.7",},
{2,"下面哪个品牌有没有LINUX产品","RED HAT","SCO","XTEAM","TURBO",},
{2,"UNIX下常用编辑器是","EDIT","VI","NOTEPAD","WORD",},
{2,"CD质量的立体声音频bit深度为____；采样频率为____khz。","0.0060659722222","0.011621527778","0.0058107638889","0.011366319444",},
{2,"premiere5.5中帧画面地纵横比为____.","0.67291666667","0.16875","1.0527777778","0.21111111111",},
{2,"必须以高于采样信号最高频率的__倍频率作为采样频率对其进行采样,才能完全保真地恢复原信号。","4","2","6","9",},
{2,"下面哪一家没参加ＴＣＰ【Transmission Control Protocol 】协定的制定","美国史丹佛大学","英国剑桥大学","ＢＮＮ公司","英国伦敦大学",},
{2,"C语言可执行程序从什么地方开始执行","程序中第一条可执行语句","程序中的main函数","程序中第一个函数","包含文件中的第一个函数",},
{2,"以下C语言运算符中最高的是：","逻辑运算符","算术运算符","赋值运算符","关系运算符",},
{2,"SNMP中的MIB是什么意思啊？","MAN IN BLACK","管理信息基","多线程信息基","多线程信息块",},
{2,"微机控制系统中的监控定时器也称为：","82531PIT","看门狗（watchdog）","相对时钟","绝对时钟",},
{2,"下列字符中,ASCII码值最小的是","a","A","x","Y",},
{2,"ASP的全称","ActingServerPages","ActiveServerPages","ActionServerPages","ActivateServerPages",},
{2,"下面四组DOS命令中,意义完全相同的一组是（ ）","COMP和DISKCOMP","RENAME和REN","COPY和DISKCOPY","DEL和RD",},
{2,"上NT局域网要装下面哪个协议？","TCP/IP","NetBEUT","IPX/SPX","ATM LAN",},
{2,"出现在顶级域名中的net是","政府实体","服务提供商","特殊互联网组织","教育组织",},
{2,"出现在顶级域名中的edu是","政府实体","教育组织","特殊互联网组织","军队部门",},
{2,"出现在顶级域名中的arpa是","教育组织","特殊互联网组织","政府实体","军队部门",},
{2,"15寸特利珑显象管的特征有以下哪点？","显示屏上有一条垂直直线","显示屏上有一条水平直线","显示屏上有一条斜线","显示屏上有一条曲线",},
{2,"下列文件名中是DOS保留文件名的是：","MEM","CON","LPRN","COM3",},
{2,"几位二进制数为一个字节？","2","8","4","6",},
{2,"出现在顶级域名中的mil是","政府实体","军队部门","特殊互联网组织","教育组织",},
{2,"出现在顶级域名中的gov是","教育组织","政府实体","特殊互联网组织","军队部门",},
{2,"出现在顶级域名中的com是","教育组织","公司、企业","特殊互联网组织","军队部门",},
{2,"一个foxbase+数据库中有三个备注型字段,这些字段的内容存放在","三个.dbt 文件中","同一个.dbt文件中","三个.dbf 文件中","同一个.dbf文件中",},
{2,"下面不是杀毒软件的是","kill","jetcar","mcafee virussan","av98",},
{2,"以下哪个是专业设计软件?","Netscape","CAD","Word","kv3000",},
{2,"第四代声卡的是：","mci","pci","aci","dci",},
{2,"cpu超频的方法包括：","改变总线频率","三者都行","改变倍频","改变cpu电压",},
{2,"Windows中的控制面版的执行文件名叫什么?","Content","Control","Command","Clspack",},
{2,"在Windows中按住Shift键后,用鼠标双击我的电脑会?","打开我的电脑","打开资源管理器","打开注册表管理器","打开我的文档",},
{2,"操作系统的主要作用有：","发挥硬件资源","都对","为其他实用软件构筑一个平台","管理硬件资源",},
{2,"Water pro 是下面哪个的降温软件？","显卡","cpu","机箱","硬盘",},
{2,"赛扬2CPU里,没有以下那种主频？","633","766","750","400",},
{2,"汉字在计算机内以什么码存储?","五笔字型","内","拼音","输入",},
{2,"扫描仪和MO常用的接口是：","IDE","SCSI","EIDE","都不对",},
{2,"以下属于按支持的cpu分类的主板类型的是：","I486","ISA","Intel 430","pentium 2",},
{2,"CIH病毒是破坏硬件的病毒么？","是","不是","看情况而定","以上都不对",},
{2,"ＷＰＳ提供了一种多窗口编辑功能最多可设置的窗口数是？","３个","４个","２个","１个",},
{2,"电脑上网浏览信息会不会染上病毒？","会","不会","有时会","以上都不对",},
{2,"显示器属于","输入设备","输出设备","终端","输出系统",},
{2,"一般来说,DIY族买鼠标时不用注意的有","接口","品牌","造型","耐用性",},
{2,"国内磐英主板是由哪家公司代理的？","新浪潮","双敏","新天地","蓝德",},
{2,"所谓的网络三剑客中firework的功能？","页面设计","图象设计","声音制作","动画制作",},
{2,"OSI中最高位的是_______","传输层","应用层","数据链路层","网络层",},
{2,"在国家标准GB2312-80汉字编码中规定的二级汉字共有多少个？","5482","3008","946","6764",},
{2,"在MS-DOS 1.x 中磁盘管理命令,是什么","TYPE,DEL","CHKDSK,DISKCOPY","COPY,COMP","REM",},
{2,"网页的扩展名是什么？","sys","htm","bat","dll",},
{2,"电子邮件标准主要有以下哪两个：","X.500和SMTP","X.400和SMTP","X.500和POP","TCP和X.400",},
{2,"猫modem是指?","内存","调制解调器","中央处理器","只读解调器",},
{2,"Internet常用术语‘BBS’的释义是什么？","综合业务数字网络","电子公告牌系统","两个网段的连接设备","文件传送协议",},
{2,"DDR的英文名字全称是—?","Duoble　daie　Rambus","Double　Data　Rate","Double　Date　Reta","以上都不是",},
{2,"MPEG标准分成3个部分,其中不属于的是？","MPEG视频","MPEG混频","MPEG音频","视频音频同步",},
{2,"微处理器的字长、主频、ALU结构以及什么是影响其处理速度的重要因素？","是否微程序控制","有无CACHE存储器","有无中断处理","有无DMA功能",},
{2,"第一块celeron(赛扬)正式发布于：","35796","35886","36008","36130",},
{2,"UNIX分作系统属于以下哪种？","批处理操作系统","分时操作系统","实时操作系统","都不是",},
{2,"ASP是什么意思？","静态服务器主页","动态服务器主页","动态服务器","静态服务器",},
{2,"msn是哪个电子邮件的副产品","263.net","hotmail","usa.net","micrrsoft.com",},
{2,"FoxPro有几种工作方式？","2","3","1","4",},
{2,"下面哪一个不是为共享信息提供主框架的企业级系统","Lotus　Notes","IBM　Viavoice","Microsoft　Exchange　Server","Novell　Group　Wise",},
{2,"Java语言面向对象编程的基本元素是：","命令","类","代码","程序",},
{2,"在DOS系统中,不同目录下的同名文件或目录能同时存在吗？","不能","能","不可能有这种情况","以上都不是",},
{2,"下面软件中有查毒功能的是？","acdsee","winzip","xyz","winamp",},
{2,"以下那种上网方式理论上最快？","电话线上网","CABLE","ISDN","手机上网",},
{2,"WINDOWS操作系统是哪家公司的产品？","IBM","MICRSOFT","APPLE","金山",},
{2,"用DEL命令删初文件属于什么删除？","物理删除","逻辑删除","不能删除","以上都不是",},
{2,"主板的控制芯片组不包括：","pcmc","bios","lbx","sio",},
{2,"计算机系统中的外部设备不包括：","输入设备","主机","输入设备","外部存储设备",},
{2,"第一个图形界面的浏览器,其开发者是","MICH.　BOLTON","MARC　ANDREESSEN","TIM　BERNERS-LEE","BRUCE　LEE",},
{2,"是谁编写了第一个WEB服务器,定义了WEB语言及协议","BILL　GATES","TIM　BERBERS-LEE","PAUL　ALLEN","RICHARD　STEVENCE",},
{2,"第一个图形WEB浏览器是哪个","INTERNET EXPLORE","MOSAIC","NETSCAPE","APACHE",},
{2,"在计算机网络通讯中,频分多路复用的简写是什么？","WDM","FDM","TDM","PDM",},
{2,"电脑硬盘在读写时,硬盘电源指示灯","常亮","闪烁","不亮","不知道",},
{2,"计算机工作时突然电源中断,则计算机（）将全部丢失,再次通电后也不能恢复。","软盘中的信息","RAM中的信息","硬盘中的信息","ROM中的信息",},
{2,"下面哪个是城域网的简写？","LAN","MAN","WAN","CAN",},
{2,"EPROM 的中文名为：","电可擦可写ROM","可擦可写ROM","可写ROM","标准ROM",},
{2,"英特尔最新Tualatin处理器采用什么样的制程生产？？","0.18制程","0.13制程","0.20制程","0.25制程",},
{2,"第一台电脑是用来干什么的","医疗","军事","经济","计算",},
{2,"常见的内存插槽有多少线：","30,82.168","30,72,168","36,72,168","30,72,189",},
{2,"如何使用Outlook Expree收发你的邮件","按菜单“邮件”栏中的新邮件使用","按菜单“工具”栏中邮件中添加邮件属性","无须任何操作就可以收发邮件","以上都不对！",},
{2,"在OFFICE软件中,按什么快捷键可以保存文件","CTRL+V","CTRL+S","CTRL+A","CTRL+ALT+S",},
{2,"在WINDOWS操作界面中, 刷新键是？","F3","F5","F6","F2",},
{2,"在操作系统中,可以并行工作的基本单位是","作业","进程","函数","过程",},
{2,"BNC连接头允许网卡和____相连","粗缆","细缆","双绞线","光纤",},
{2,"网卡和网络的物理连接是指收发器类型。标准的连接类型不包括：","RJ-45","F16","BNC","AUI",},
{2,"RJ-45接口允许网卡和____相连","粗缆","双绞线","细缆","光纤",},
{2,"AUI接口允许网卡和____相连","细缆","粗缆","光纤","双绞线",},
{2,"下列字符中,ASCII码值最小的是","a","A","x","Y",},
{2,"NETBIOS的137端口是做什么的：","数据服务","命名服务","会话服务","特殊服务",},
{2,"premiere中提供了多少个音频的轨道：","88","99","100","78",},
{2,"显示桌面的快捷方式是什么？","windows+break","windows+d","alt+s","ctrl+x",},
{2,"内部命令的文件名","后缀为.EXE","包含在文件COMMAND.COM中","后缀为.COM","为所有可执行文件名",},
{2,"电脑又称什么？","电子数字模拟机","电子数字计算机","电子数字控制机","电子数字模拟控制机",},
{2,"操作系统的基本功能包括？","设备管理","以上都是","文件管理","存储管理",},
{2,"微机在工作中,由于某种原因突然“死机”,重新启动后则计算机中（  ）将全部消失。","ROM中的信息","RAM中的信息","ROM和RAM中的信息","硬盘中的信息",},
{2,"键盘可分为多少个区？","3","4","5","2",},
{2,"计算机中统一指挥和控制计算机各部分协调一致地运行的部件是","运算器","控制器","存储器","显示器",},
{2,"DOS从软件归类来看是属于","应用软件","操作系统","文字处理软件","数据库",},
{2,"以下四个字符中,哪个不能作为一个文件的文件名的部分？","$","*","A","#",},
{2,"计算机中信息主要存放在","CPU","存储器","键盘","微处理器",},
{2,"DOS规定文件如果有扩展名必须由1至几个字符组成？","2","3","4","8",},
{2,"已记录在磁盘上的一组相关信息的集合称为","外存储器","文件","内存储器","数字",},
{2,"CPU每执行一个什么就完成一步基本运算或判断?","软件","指令","语句","软盘",},
{2,"剪贴板是（　　）中一块临时存放交换信息的区域。","ＲＡＭ","应用程序","ＲＯＭ","硬盘",},
{2,"Ｗｉｎｄｏｗｓ　９８允许安装最多几个图形卡？","6","8","2","16",},
{2,"下列协议不属于内部网关协议的是：","RIP","FTP","HELLO","OSPF",},
{2,"下面文件中可以做为批处理文件名的是","AUTOEXEC.C","ATX.BAT","AUTOEXEC","AUTO.TXT",},
{2,"Puffer这软件是用来做什么？","Word文件加密","E-Mail加密","目录加密","Window加密",},
{2,"ATA66的硬盘线是多少PIN？","40","80","33","66",},
{2,"决定显示器分辨率的主要因素是：","显示器的尺寸","显示器适配器","显示器的种类","操作系统",},
{2,"什么是ADSL???","非对称数字用户网","非对称数字用户线","对称数字用户线","对称数字用户网",},
{2,"什么是PHP？","超级文本汇编语言","超级文本预处理语言","超级汇编语言","超级图片处理语言",},
{2,"下列DOS命令中哪个指令是外部指令？","DIR","FORMAT","COPY","DEL",},
{2,"WINNT操作系统使用的格式是什么","FAT32","NTFS","FAT16","FAT",},
{2,"电擦除可编程只读存储器的缩写是？","EPROM","EEPROM","ROM","PROM",},
{2,"在internet 的大量应用中,网络安全主要受到的威胁不包括下面哪一种：","电子攻击","电压不稳","物理攻击","密码窃取",},
{2,"下面的ip地址属于哪一类？130.2.5.6","A","B","C","D",},
{2,"下面关于IBM叙说错误的是","深蓝","全称是I BEG MICROSOFT","昔日的COMPUTER巨人","美国的一家计算机公司",},
{2,"下列IP地址中哪一个是不合法的","240.0.0.2","202.14.22.256","127.0.0.1","192.168.0.7",},
{2,"在未来的中国,可能取代WINDOWS的操作系统是哪个？","SPDOS","LUNIX","WPS","UCDOS",},
{2,"微型计算机的计算性能主要取决于","显示卡","中央处理器","硬盘","内存",},
{2,"硬盘容量与什么有关","磁盘面数,扇区","磁道,扇区,磁面数","磁道和面数","磁道和扇区",},
{2,"内存容量是指","RAM的容量","RAM,ROM的容量","ROM的容量","硬盘的容量",},
{2,"以下不是外设的是","键盘","CPU","鼠标","显示器",},
{2,"使用超大规模集成电路制造的计算机应该归属于","第一代","第四代","第三代","第二代",},
{2,"微机的速度快慢表示","启动速度","时钟频率","执行程序个数","内存访问速度",},
{2,"机器指令在计算机内部是以___数存放","十进制","二进制","十六进制","八进制",},
{2,"在因特网（Internet）中,电子公告板的缩写是？","BBC","BBS","E-mail","FTP",},
{2,"586的字长是","64","32","8","16",},
{2,"486的字长是","8","32","16","64",},
{2,"386的字长是","16","32","8","64",},
{2,"286的字长是","8","16","32","64",},
{2,"IBM-PC/AT的字长是","8","16","32","64",},
{2,"微机处理器是指","CPU","CPU和内存","内存","控制器和运算器",},
{2,"在FoxBASE＋中,数据库文件的后缀名是",".PRG",".DBF",".TXT",".DBT",},
{2,"微机的字长取决于","CPU","数据总线长度","内存","硬盘",},
{2,"在汉字库内,存放的汉字是","汉字的内码","汉字的字模","汉字外码","汉字的变换码",},
{2,"硬盘是计算机的?","主存","存储器","控制器","外设",},
{2,"第一台电子计算机诞生在何地？","英国","美国","法国","俄罗斯",},
{2,"在下列存储器中,访问速度最快的是?","硬盘存储器","RAM","软盘存储器","磁带存储器",},
{2,"通常,在微机中所指的80486是?","产品型号","微处理器型号","主频","微机名称",},
{2,"通常说1.44MB软盘中1.44MB指的是?","厂家代号","磁盘容量","商标号","磁盘编号",},
{2,"断电会使原存信息丢失的存储器是?","硬盘","RAM","ROM","软盘",},
{2,"我国研制的“银河I”的速度是？","20亿/秒","10亿/秒","100亿/秒","200亿/秒",},
{2,"哪一个不是总线类型?","地址总线.","传输总线.","控制总线.","数据总线.",},
{2,"世界上第一台电子计算机占地：","150平方米","170平方米","190平方米","250平方米",},
{2,"显示当前日期,并允许重新设置系统日期的DOS内部命令是?","DAY","DATE","DATA","DAL",},
{2,"设当前工作盘是硬盘,存盘命令中没有指明盘符,则信息将存放于?","内存","硬盘","软盘","硬盘和软盘",},
{2,"安装中文输入法后,用户在WINDOWS工作环境中随时使用什么来启动或关闭中文输入法","Ctrl+Tab键","Ctrl+Space键","Alt+Tab键","Alt+Space键",},
{2,"Windows系统中,缺省能在各种中文输入法之间切换的是？","Ctrl＋空格键","Ctrl＋Shift键","用Alt＋F功能键","Shift＋空格键",},
{2,"世界第一台电子计算机是？年诞生的","1945","1946","1944","1943",},
{2,"INTERNET中域名与IP之间的翻译是由（ ）来完成的？","用户计算机","域名服务器","代理服务器","INTERNET服务商",},
{2,"PC机所配置的显示器,若显示控制卡上显示存储器的容量是1MB当采用800×600分辨率模式时,每个象素最多可以有多少种不同的颜色？","8192色","4096色","2048色","16384色",},
{2,"拥有计算机并以拨号方式接入网络的用户需要使用？","CD—ROM","Modem","鼠标","电话机",},
{2,"5.25英寸,存储量1.2MB的软盘是","SS-DD","DS-HD","DSDD","DSSD",},
{2,"微型计算机主存储器的基本编址单元的长度为：","1位","8位","16位","32位",},
{2,"计算机病毒是可以造成机器故障的？","一种计算机设备","一种计算机程序","一块计算机芯片","一种计算机部件",},
{2,"DOS系统启动后,能自动执行的批处理文件是：","AUTOEXEC.BAR","AUTOEXEC.BAT","AUTOEXE.BAR","AUTOEXE.BAT",},
{2,"Windows 95操作系统是？","单用户单任务系统","单用户多任务系统","多用户多任务系统","多用户单任务系统",},
{2,"计算机突然断电__将全部丢失","ROM","RAM","ROM,RAM","硬盘",},
{2,"微型计算机中存储数据的最小单位是？","字节","位","字","KB",},
{2,"CD-ROM是什么","硬盘","多媒体外存储器","软盘","外存",},
{2,"DOS系统中负责处理输入和输出请求的系统文件是：","IBMBIO.EXE","IBMBIO.COM","IBMBIOS.COM","IBMBIOS.EXE",},
{2,"微型计算机中,运算器、控制器和内存储器的总称是？","MPU","主机","CPU","ALU",},
{2,"微型计算机,ROM是？","顺序存储器","只读存储器","随机存储器","高速缓冲存储器",},
{2,"金山游侠3是一种什么软件？","压缩软件","游戏修改软件","游戏","翻译软件",},
{2,"第三代计算机CPU是什么为代表","80286","80386","80486","8080",},
{2,"语言编译软件按分类来看是属于：","应用软件","系统软件","操作系统","数据库管理系统",},
{2,"在存储系统中,PROM是指：","固定只读存储器","可编程只读存储器","可读写存储器","可再编程只读存储器",},
{2,"下列几种存储器中,存取周期最短的是","光盘存储器","内存储器","硬盘存储器","软件盘存储器",},
{2,"下列四种软件中,属于系统软件的是","WPS","DOS","Word","Excel",},
{2,"486的计算机的字长为多少位","16","32","8","64",},
{2,"如果你想在同一分区下实现98和2000的双启动,需要用什么文件系统格式","fat","fat32","ntfs","都可以",},
{2,"世界上首次实现存储程序计算机是","ENVAC","EDSAC","EDVAC","UNIVC",},
{2,"计算机内存的组成","ROM","ROM,RAM","RAM","磁盘",},
{2,"可以用来做系统备份的软件是？","Netant","Ghost","Pqmgic","Notorn NDD",},
{2,"c语言主函数MAIN最多允许有几个参数","1","2","0","3",},
{2,"ARPAnet诞生于多少年？","1970","1969","1971","1972",},
{2,"AMD的HyperTransport的高速总线峰值可以达到多少？","3.2GB/Sec","6.4GB/Sec","1.6GB/Sec","256MB/Sec",},
{2,"TCO99的哪一方面是在TCO95中没有的？","辐射方面","环保方面","色彩方面","人工体学方面",},
{2,"交换式局域网增加带宽的方法是在交换机多个端口之间建立：","点——点连接","并发连接","数据连接","物理连接",},
{2,"ASCII码中的65至90是什么？","26个数字","26个大写英文字母","26个汉字","26个小写英文字母",},
{2,"要快速重新启动电脑要同时按什么健","enter","shift","alt","ctrl",},
{2,"STR是什么意思？","远程控制","悬挂内存","定时开机","电源管理",},
{2,"以下操作系统中,netware工作站支持的有","dos/windows3.1","以上都能","windows95/98","windows NT workstation",},
{2,"在DOS用什么命令可以查自己的IP号","netstat　-s","netstat　-n","debug","dir",},
{2,"windows2000采用什么内核？","NT4","NT5","DOS","windows98",},
{2,"应用软件 的分类 中没有的是","字处理软件","汇编、解释或编译软件","数据库管理系统","通信、网络软件",},
{2,"下列字符中,ASCII码值最小的是？","R","B","X","a",},
{2,"NetAnts V1.0beta2.51版是那间公司制的？","Netscape","HongLewis","Microsoft","RIT Research Labs",},
{2,"超级解霸V5.5是那间公司制作？","北京江民公司","北京豪杰公司","北京微软公司","北京冠群公司",},
{2,"微机中1K字节表示的二进制位数是","8x1000","8x1024","1024","1000",},
{2,"MCSE是什么认证？？","CISCO","微软","ORCAL","IBM",},
{2,"premiere6.0是什么软件?","图象浏览","影片剪辑","制作3D动画","修改游戏",},
{2,"下列哪个多用于同类局域网之间的互联？","中继器","网桥","路由器","网关",},
{2,"“32位微型计算机”中的指的是？","微机型号","机器字长","内存容量","储存单位",},
{2,"下面哪个不是一种语言？","jsp","pws","css","php",},
{2,"显示或设置系统时间命令是：","data","TIME","set data","set time",},
{2,"Dos系统启动后,下例文件中常驻内存的是？","sys.com","command.com","fornat.com","diskcopy.com",},
{2,"2进制数101110转换为等值的八进制数是","45","56","67","78",},
{2,"GeForce Pro的核心频率是多少？","333","400","466","366",},
{2,"一个8位寄存器能存放补码整数范围用十进制表示是：","-127至+128","-128至+127","-128至+128","-127至+127",},
{2,"创立了网景通信公司,并开发出了众所周知的NETSCAPE","DOUGLAS　COMMER","MARC　ANDREESSEN","TIM　BERNERS-LEE","BILL　GATES",},
{2,"第一个图形WEB浏览器是哪年开发出来的","1986","1993","1994","1991",},
{2,"PhotoImpact 是哪个公司推出的？","Adobe","Ulead","Macromedia","Metacreations",},
{2,"我们通常用＿＿＿代表显示器","AGP","CRT","VGA","USB",},
{2,"20世纪60年代后期,由Dijkstra提出的,用来提高程序设计的效率和质量的方法是","模块化程序设计","结构化程序设计","并行化程序设计","标准化程序设计",},
{2,"RM的格式文件由什么播放器播放？","Winamp","Realplayer","Winplayer","Powerdvd",},
{2,"用两只中断控制器8359A级联后,CPU的可屏蔽硬中断可扩大到","64级","15级","32级","16级",},
{2,"在RQBE窗口中可以指定条件,FoxPro提供六种比较算符,若要判断某一字段的值是否比某个值小,应使用的比较算符是：","More Than","Less Than",">","<",},
{2,"下面哪个表达式的值为4","37563","(int)(11.0/3+0.5)","(float)11/3","11.0/3",},
{2,"FDD总线是用来连接（    ）","硬盘","软驱","打印机","显示卡",},
{2,"一个24*24点阵的汉字字形信息所占的字节数为","24","72","36","64",},
{2,"php支持的操作系统","unix","unix,win32","win32","无限制",},
{2,"ATX电源的最大特点是：","3.3伏输出","软电源控制","不间断","独不对",},
{2,"下列四个选项中,用于在线视听的软件是：","Flashget","Realplayer","Netants","Netonline",},
{2,"切换窗口的快捷建应是","Ctrl+Tab","Alt+Tab","Ctrl+Alt+Tab","Shift+Tab",},
{2,"按通信距离划分,计算机网络可以分为局域网和广域网。下列网络中属于局域网的是","CERNET","Novell","CHINANET","Internet",},
{2,"下列关于IPv6中的CBC叙述错误的是：","CBC的全称是Cipher Block Chaining","IPv6中没有CBC","CBC是数据加密标准（DES）的一部分","CBC是IPv6的缺省加密策略。",},
{2,"一个字长的二进制位数是","8","随计算机系统而不同的","16","32",},
{2,"冯.诺依曼体系的计算机是五大部分组成,下列不是其中的是","存储器","工资管理系统","输入设备与输出设备","运算器与控制器",},
{2,"属于操作系统的是","dbase","xenix","oracle","foxbase",},
{2,"不属于操作系统的是","dos","oracle","unix","xenix",},
{2,"AI是什么意思","辅助教学","人工智能","输入法","辅助制作",},
{2,"IBM的第二代个人计算机的简称是","PC/2","PS/2","PD/2","PA/2",},
{2,"在C语言中,哪个不是用于控制循环的？","do...while","switch","while","for",},
{2,"计算机的主机有什么组成","CPU、内存、外存","控制器、运算器、内存","CPU、输入、输出设备","控制器、运算器",},
{2,"第一台计算机诞生于","1941","1946","1949","1964",},
{2,"AVI的全称是什么？","Audioes　Video　Interleaved","Audio　Video　Interleaved","Audio　Videoes　Interleaved","Audio　Video　Interleaving",},
{2,"十进制中的255等于十六进制中的？","fe","ff","fd","255",},
{2,"HTTP的常用端口是：","69","80","119","21",},
{2,"导致IP报文丢失的说法,下面错误的是？","报文遭到电磁干扰(EMI)","掉线","报文遭到无线电频率干扰(RFI)","网络拥塞",},
{2,"下列术语中,属于显示器性能指标的是?","精度","分辨率","可靠性","速度",},
{2,"在微机中,1MB的准确含义是[　]","1024*1024个字","1024*1024个字节","1000*1000个字节","1000*1000个字",},
{2,"1KB的准确数值是[　]","1000个字节","1024个字节","1024个二进制位","1000个字",},
{2,"鼠标是计算机外设的什么设备？","输出设备","输入设备","操控设备","都不是",},
{2,"计算机中,一个浮点数由两部分组成,它们是","基数和尾数","阶码和尾数","阶码和基数","整数和小数",},
{2,"比1023大的端口号通常被称为：","大端口号","高端口号","用户自定义子号","子端口号",},
{2,"纯文本文件传输协议TFTP常使用的端口是:","119","69","80","21",},
{2,"在批处理文件中,REM的作用是","修改某个文件名","对批处理文件作注释","暂停执行批处理文件","改变原命令执行顺序",},
{2,"当前使用的微型计算机其主要器件是由什么构成的？","集成电路","超大规模集成电路","晶体管","电子管",},
{2,"计算机的输出设备中没有哪个?","打印机","键盘","显示器","绘土仪",},
{2,"计算机最早的应用领域是[　]","信息处理","数值计算","过程控制","人工智能",},
{2,"计算机病毒的特点是","传播性,破坏性,易读性","传播性,潜伏性,破坏性","潜伏性,破坏性,易读性","传播性,潜伏性,安全性",},
{2,"无线数据和语音通信的开放性全球规范  是什么技术","WAP技术","蓝牙技术","GPRS技术","PDA技术",},
{2,"在微型计算机中,其内存容量为8M,指的是[ ]","8M位","8M字节","8M字","8000K字",},
{2,"Flash中导出文件默认的扩展名是：","*.exe","*.swf","*.gif","*.tif",},
{2,"ip地址内的网络id和主机id用_____区分","网络代码","子网掩码","主从代码","路由掩码",},
{2,"通常所说的计算机是指?","电子模拟计算机","电子数字计算机","模拟电子计算机","电子程控计算机",},
{2,"微处理器研制成功的时间是（）","1946","1971","1965","1978",},
{2,"ASP（Active Server Page,活动服务页面）是Microsoft从Internet Information Server（IIS）____开始开发的。","4","3","5","2",},
{2,"8086/8088通用寄存器中堆栈指示器是?","IP","SP","BP","DI",},
{2,"IPSec（IP Security）产生于____的制定之中","IPv7","IPv6","IPv5","IPv4",},
{2,"清华大学的电子公告牌（BBS）吸引了众多上网者,它的名称是","龙腾清华","水木清华","中华清华","清华BBS",},
{2,"winamp有什么作用？","处理图片","播放mp3","处理视频","制作网页",},
{2,"wps2000板是那间公司制作的？","第三坡","金山公司","北京江民公司","北京实达铭泰公司",},
{2,"组成cgi程序的是两部分,一部分是html页面,另一部分则是_________","运行在本机的程序","运行在服务器上的程序","运行在服务器的页面","没有另一部分",},
{2,"DOS下,当前目录中有下列文件,打入命令EXEC后执行的是其中的：","EXEC.BAT","EXEC.COM","EXEC.EXE","EXEC.OBJ",},
{2,"局域网的网络软件住要包括？？、网络数据库管理系统和网络应用软件","服务器操作系统","网络操作系统","网络传输协议","工作站软件",},
{2,"下面几条DOS命令中哪个是内部命令？","deltree","cd","tree","format",},
{2,"分辨率的单位是？","pix","dpi","pci","ipc",},
{2,"密码学大体可以分为密码编码学和_____两大部分","密码解码学","密码分析学","密码心理学","密码研究学",},
{2,"密码学（cryptology）一词的正式使用是在_____年,戴维.卡恩（David Kahn）在其一篇文章中首次使用了这个词 。","1978","1963","1961","1972",},
{2,"要同步音频和视频,一般要考虑三个因素,其中不包括：____","音频地偏差","视频地偏差","帧速率","卷号",},
{2,"Javascript提供的脚本语言的编程与___非常类似。","vb","C++","C","perl",},
{2,"下列对Javascript描述正确的是","是静态的","是一种安全性语言","不依赖于浏览器","是非描述性语言",},
{2,"捕获视频影像地方式不包括：____","实时捕获","虚时捕获","单帧捕获","多帧捕获",},
{2,"dreamweaver是制作什么的软件？","画图","网页","下载","音乐",},
{2,"WPS是由谁开发的？","张朝阳","求伯君","丁磊","雷军",},
{2,"dreamweaver是哪间公司的产品？","microsoft","macromedia","adobe","softstar",},
{2,"一个字节的二进制位数为＿＿＿＿","2","8","16","32",},
{2,"数据在网络上是以很小的称为“____”的单位传输的","贞","帧","数据流","比特",},
{2,"_____是利用计算机的网络接口,截获目的地是其他计算机的数据报文的一种技术","Snort","Sniffer","John","DoS",},
{2,"一个普通的Windows系统支持日文的吗？","跟本不支持的！！","当然支持了！！","加个日文平台就行...","以上都错",},
{2,"系统软件中最重要的是＿＿＿＿","语言处理程序","操作系统","工具软件","数据库管理系统",},
{2,"在turbo C中,c+=c代表什么意思？","c=c+1","c=c+c","c=c+1+c","无此用法",},
{2,"WINCAB是什么软件？","杀毒软件","解压缩软件","摸似器","汉化",},
{2,"非对称密码系统成功通信至少需要______密钥。","2对","2个","3个","3对",},
{2,"IBM-PC/XT微型计算机采用的CPU芯片是（）","Z80","8088","8085","80286",},
{2,"虚拟专用网可以可分为三类：LAN-to-LAN、多LAN互连和_____。","虚拟LAN","虚拟专用拨号网络","一线通","虚拟专用私人网络",},
{2,"PPP是____开发的串行点对点链路上传输不同网络层协议的数据链路层协议标准。","IEEE","IETF","ISO","OSI",},
{2,"IBM-PC机中的协处理器芯片是（）","Z80","8087","8086","8088",},
{2,"ITU确定V．90标准后,____K调制解调器由此进入了现在主流应用阶段。","33.6","56","128","48",},
{2,"1Gbps以太网在IEEE802.3z标准中定义,又被称为_____","快速以太网","千兆以太网","超速以太网","光纤以太网",},
{2,"CD－R是指什么技术？","多媒体演示技术","光盘写入技术","虚拟光驱技术","硬件加速技术",},
{2,"CPU自理的数据基本单位为字,一个字的字长","为8个二进制位","与CPU芯片的型号有关","为16个二进制位","为32个二进制位",},
{2,"CD-RW是指什么技术？","光盘修复技术","光盘重复写入技术","硬盘修复技术","光盘克隆重技术",},
{2,"系统软件中最重要的是：","工具软件","操作系统","语言处理程序","数据库管理系统",},
{2,"我国那年研制出第一台电子计算机？","1954","1958","1946","1937",},
{2,"1MB等于","1000*1000字节","1024*1024字节","1024字节","1000字节",},
{2,"世界上发明的第一台电子数字计算机是＿＿＿＿","EDVAC","ENIAC","EDSAC","UNIVAC",},
{2,"在WIN 2000中,拨号过程中 错误代码为 602 是什么意思？","你的计算机无法在远程网络上注册","指定端口已打开","发生与NETBIOS有关的错误","连接被终止",},
{2,"信息高速公路传送的是＿＿＿＿","系统软件","二进制数据","应用软件","多媒体信息",},
{2,"按照FoxBASE的规定,每个数组最多可有_______个元素。","4800","3600","2000","6500",},
{2,"什么是存储在计算机内的有结构的数据集合。","数据库系统","数据库","网络系统","操作系统",},
{2,"ＤＯＳ系统启动成功后,下列四个文件中,常驻内存的文件是","ＦＯＲＭＡＴ．ＣＯＭ","ＣＯＭＭＡＮＤ．ＣＯＭ","ＡＵＴＯＥＸＥＣ．ＢＡＴ","ＣＯＮＦＩＧ．ＳＹＳ",},
{2,"防止软盘感染病毒的有效方法是","不要把软盘与有病毒的软盘放在一起","对软盘进行写保护","保持软盘的清洁","定期对软盘进行格式化",},
{2,"具有多媒体功能的微型计算机系统中,常用的CD-ROM是","只读型大容量软盘","只读型光盘","只读型硬盘","半导体只读存储器",},
{2,"100Mbps以太网又被称为_____,标准规范是IEEE802.3u,使用CSMA/CD协议,由于它与802.3以太网相似,所以得以普遍使用。","高速以太网","快速以太网","光纤以太网","快速网",},
{2,"10Mbps以太网标准有诸多版本,____标准是实际的标准,使用CSMA/CD协议。","ISO9000","IEEE802.3","ISO9001","IEEE802.1",},
{2,"共享式以太网是____的,即工作站可传送或接受数据,但不能同时进行。","全双工","半双工","单双工","三双工",},
{2,"IPX/SPX用于_______网络之间的通信","Mac","Novell　NetWare","Internet","Intranet",},
{2,"AppleTalk用于____网络之间的通信。","Novell","Mac","Netware","Intranet",},
{2,"美国国防部高级研究计划署自1968年开始DARPA网的研究和实施,为分布式计算机网络通信设计的标准被称为___协议集","IPX/SPX","TCP／IP","C/S","I/O",},
{2,"1992年一位___Helsinki University的学生 -- Linus Torvalds 开始在一台386PC上发展一个自由软件的UNIX kernel,使用FSF的程式开发工具。","美国","芬兰","德国","荷兰",},
{2,"第一个横跨美国的高速网络是：","INTERNET","ARPANET","USENET","ITC",},
{2,"在WIN 2000中,拨号过程中 错误代码为 668 是什么意思？","远程计算机没有响应","连接被终止","不能启用INTERNET连接共享","系统内存不足",},
{2,"粘贴命令的快捷键是：","ctrl+c","ctrl+v","ctrl+x","ctrl+a",},
{2,"计算机的软件系统包括＿＿＿＿","程序和数据","系统软件与应用软件","操作系统与语言处理程序","程序、数据与文档",},
{2,"计算机指令的集合一般成称为（）","机器语言","程序","模拟语言","汇编语言",},
{2,"动态主机配置协议的缩写是什么？","DCMP","DHCP","DMCP","DAMN",},
{2,"在Windows中,如果窗口表示的是一个应用程序,则打开窗口意味着","显示该应用程序的内容","运行该应用程序","结束该应用程序的运行","将该窗口放大到最大",},
{2,"计算机网络最突出的优点是","运算速度快","共享资源","存储容量大","精度高",},
{2,"在计算机领域中,媒体是指","各种信息的编码","表示和传播信息的载体","计算机的输入输出信息","计算机屏幕显示的信息",},
{2,"下列四种软件中属于应用软件的是","BASIC解释程序","财务管理系统","UCDOS系统","Pascal编译程序",},
{2,"存储量1GB(Giga Byte)大约等于","1000KB","1000000KB","100000KB","100KB",},
{2,"人们把什么合成为中央处理器(cpu)","缓存和运算器","运算器和控制器","存储器和控制器","硬盘和内存",},
{2,"1946年世界上第一台电子数字计算机(ENIAC)在哪个国家诞生","法国","美国","英国","中国",},
{2,"“计算机辅助制造”的常用英文缩写是","CAI","CAM","CAD","CAT",},
{2,"打印机属于","输入输出设备","输出设备","输入设备","存储器",},
{2,"可以决定电脑主板性能的是","cpu","芯片组","显卡","内存",},
{2,"微型计算机中,运算器、控制器和内存储器的总称是","MPU","主机","CPU","ALU",},
{2,"启动DOS系统,系统自检后先执行____文件","SYS.COM","AUTOEXEC.BAT","CONFIG.COM","COM",},
{2,"微型计算机,ROM是","顺序存储器","只读存储器","随机存储器","高速缓冲存储器",},
{2,"微型计算机中,I／O设备的含义是","输入设备","输入输出设备","输出设备","控制设备",},
{2,"内存速度一般用存取一次数据的时间作为性能指标其单位是","bit","ns","GB","MB",},
{2,"CPU主要的性能指标有","内存总线速度","主频,倍频,外频","超标量","都不对",},
{2,"由高级语言编写的源程序要转换成计算机能直接执行的目标程序,必须经过","编辑","编译","汇编","解释",},
{2,"xeon是指","intel铜矿处理器","intel至强处理器","AMD毒龙系列处理器","intel赛扬处理器",},
{2,"FlashGet,是一种什么软件？","收视","下载","聊天","系统",},
{2,"微型计算机中的内存储器,通常采用","光存储器","半导体存储器","磁表面存储器","磁芯存储器",},
{2,"以GB为单位的储存设备一般指：","软盘","硬盘","光盘","ZIP式可移动硬盘",},
{2,"Celeron CPU的外频是多少？","55","66","88","100",},
{2,"硬盘的主要性能指标是","容量","转速","缓存","价格",},
{2,"Windows 95操作系统是","单用户单任务系统","单用户多任务系统","多用户单任务系统","多用户多任务系统",},
{2,"计算机病毒是可以造成机器故障的","一种计算机部件","一种计算机程序","一块计算机芯片","一种计算机设备",},
{2,"在无向图中,所有顶点的度数之和是所有边数的几倍","3","2","4","1",},
{3,"清除方向标志的指令格式","KLD","SLD","CLD","WLD",},
{3,"在低级语言 中,汇编语言与机器语言十分接近,他使用了( )来提高程序的可读性。","定义存储语句","伪指令","助记符号","简单算术表达式",},
{3,"路由器在OSI中属于哪一层？","对话层","物理层","网络层","数据链路层",},
{3,"上海热线(Shanghai Online)于哪一年开通","1994","1995","1996","1993",},
{3,"CDPD蜂窝数字分组数据最早由哪间公司发展？","3COM","INTER","IBM","YAHOO",},
{3,"局域网称为LAN,那校园网络被称为？","SAN","MAN","CAN","WAN",},
{3,"USB通用串行总线于哪年推出？","1994","1995","1996","1993",},
{3,"INTEL公司的Pentium-100集成度高达多少只晶体管？","540万","480万","510万","500万",},
{3,"（    ）组中的两个软件都属于系统软件。","UNIX,MIS","DOS,MIS","DOS,UNIX","WPS,XENIX",},
{3,"一台计算机的内存容量为8M,指的是（    ）。","8M字","8M位","8M字节","8000K字",},
{3,"在计算机内一切信息的存取,传输都是以（   ）形式进行的。","BCD码","ASCII码","二进制","十六进制",},
{3,"以下设备中,只能作为输出设备的是（     ）。","NUL","CON","PRN","软盘驱动器",},
{3,"计算机内存存储器是按（    ）编址。","二进制位","字长","字节","以上都错",},
{3,"以太网采用的通信协议是","tcp/ip","x2.5","csma/cd","cng",},
{3,"计算机中键盘中的Ctrl键称为（    ）键。","回车","换档","控制","强行退出",},
{3,"在计算机中使用的字符编码是（    ）。","补码","原码","ASCII码","汉字",},
{3,"计算机中基本输入输出模块BIOS存放在（    ）中。","硬盘","RAM","ROM","寄存器",},
{3,"下面4种软件中,是应用软件的是（    ）。","QBASIC解释程序","UCDOS系统","财务管理系统","Pascal编译程序",},
{3,"传送数据时,占用CPU时间最长的传送方式是","DMA","中断","查询","IOP",},
{3,"下面哪个中断的优先级最高","INTR中断","NMI中断","断点中断","单步中断",},
{3,"用DMA方式传送数据时,是由什么控制的","软件","CPU","硬件控制器","CPU+软件",},
{3,"下列四种软件中,属于应用软件的是","ucdos系统","pascal编译程序","财务管理系统","qbasic解释程序",},
{3,"微软宣布,在2001年推出新一代Windows操作系统,它的名字叫“Windows XP”,此前代码为?","Windows 2002","Windows 2001","Whistler","Whister XP",},
{3,"在Word7.0的编辑状态,设置了标尺,可以同时显示水平标尺和垂直标尺的视图方式是","大纲方式","普通方式","页面方式","全屏显示方式",},
{3,"TCO最早出现的是：","TCO88","TCO90","TCO92","以上皆非",},
{3,"AMD宣布的它将推出的DOR支持型760芯片组的总线速度将达到多少?","390MHz","200MHz","266MHz","330MHz",},
{3,"下列关于新闻组中名字为alt叙述正确的是","表示其他各方面讨论组","表示科学讨论组","表示不受控制的“可选”新闻组。","表示社会方面讨论组",},
{3,"Windows XP,XP取自英文:","Expensive","Expense","Experience","Explore",},
{3,"数据库按其结构可分为____种","4","2","3","5",},
{3,"如果想使用P4蕊片,须采用_____内存条?","DDr","Sdram","Rambus","Spram",},
{3,"在WINDOWS中,修改注册表的命令？","PUBLIC","SYSTEM","REGEDIT","DIRECTION",},
{3,"在Word的编辑状态下,若要调整左右边界,利用下列哪种方法更直接,快捷","格式栏","工具栏","标尺","菜单栏",},
{3,"段落的标记是在输入什么之后产生的","分页符","句号","Enter键","shift+Enter",},
{3,"VB 6、0中可用的数据访问接口有____种","4","5","3","2",},
{3,"计算机使用的语言中效率最高的是","汇编语言","高级语言","机器语言","BASIC语言",},
{3,"Word的选择框内经常显示一些单位,下列哪个符号代表的单位最大","mm","cm","in","pt",},
{3,"中文Word编辑软件的运行环境是","WPS","DOS","Windows","高级语言",},
{3,"网线内共有多少根子线？","4","6","8","2",},
{3,"下列哪种电脑接口不需要驱动程序？","COM1","PCI","UBS","COM2",},
{3,"按终端设备组成的情况分,不正确是____","复合终端","简易终端","人工终端","智能终端",},
{3,"鲍勃凯思和____合作设计了TCP/IP","埃德斯特隆","基拉宁","温登逸夫","巴耶－拉图尔",},
{3,"Microsoft公司于1999年3月18日正式发布了多少种语文版本的IE5.0","6","8","10","12",},
{3,"MUD起源于80年代初期的联机城堡游戏,全称是","Multiy Users Dungeon","Multi Users Dungeon","Multi User Dungeon","Multiy Uxer Dungeons",},
{3,"SGML是一种国际标准,即标准通用标记语言,于多少年正式发布","1988","1987","1986","1985",},
{3,"打印文件的快捷键是","ctrl+w","crtl+o","ctrl+p","alt+p",},
{3,"AMD公司的DURON CPU起始频率是","650","500","600","700",},
{3,"CPU:Cyrix III 是那家公司的产品？","AMD","Cyrix","VIA","Intel",},
{3,"二进制数11111111的十进制值是多少？","128","254","255","192",},
{3,"WINDOWS运行于什么操作系统之上?","Windows　NT","UNIX","MS　DOS","网络",},
{3,"对数据库文件中数值字段求和的命令是","TOTAL","COUNT","SUM","ADD",},
{3,"所谓热启动是指","计算机的自动启动","计算机发热时启动","不断电状态下的重新启动","重新由硬盘启动",},
{3,"自动批处理文件必须放在？","启动盘的任意一个目录中","A盘根目录中","启动盘的根目录中","C盘根目录中",},
{3,"96.2.3.16是一个B类IP地址,它的网络地址是什么？","96.2.3.0","96.0.0.0","96.2.0.0","不可确定",},
{3,"下面属于操作系统的软件有","word97","wps","winows98","foxpro5.0",},
{3,"什么是RS-232 ？","ISDN接口","高速度串行的接口","标准串行接口","ATM 换交口",},
{3,"在打印机中,以下那DPI值最好","2400","1440","3200","1600",},
{3,"有一个函数原型如： abc(float x,float y);则该函数的返回类型为","double","void","int","float",},
{3,"在C语言的if语句中,用作判断的表达式为","算术表达式","关系表达式","任意表达式","逻辑表达式",},
{3,"C程序的结构分类下列哪个不是？","循环结构","顺序结构","程序结构","选择结构",},
{3,"DOS文件系统中,什么命令可以设定程序执行时的搜索路径？","PRINT","COPY","PATH","SORT",},
{3,"ASCII码是属于____类型数据","逻辑","数值","字符","地址",},
{3,"以下DOS命令中,哪个不是内部命令？","TYPE","DIR","ATTRIB","PATH",},
{3,"下面哪一种寻址方式操作数是在CPU中","寄存器间址","堆栈寻址","寄存器寻址","直接寻址",},
{3,"在计算机网络的拓扑结构中,可靠性好,价格较低的是","环型","树型","总线型","星型",},
{3,"8235-5某计数器的最大记数值是","FF00H","FFFFH","0000H","65536",},
{3,"一片存储容量是1.44MB的软磁盘,可以存储大约140万个","磁盘中件","中文字符","ASCLL字符","子目录",},
{3,"DOS系统启动后,下列文件中常驻内存的是","*.COM","AUTOEXEC.BAT","COMMAND.COM","FORMAT.COM",},
{3,"PC机中地址锁存器的信号状态是","双向双态","单向双态","单向三态","双向三态",},
{3,"NetMyth是一个？软件？","磁盘管理","下载","浏览器","杀毒",},
{3,"e-book的作者是谁？","林艺池","方向荣","李晓东","吴晓军",},
{3,"NetMyth2001中的快速保存的快捷键是？","F3","F4","F5","F6",},
{3,"设顺序表的长度为n.则其每个元素的平均查找长度是","(n-1)/2","n","(n+1)/2","n/2",},
{3,"什么模式反映了对数据库的存储观","操作模式","外模式","内模式","程序模式",},
{3,"数据操作语言指的是","DCL","DDL","DML","SQL",},
{3,"数据库是什么 的集合","文件","库文件","文件及其联系","数据",},
{3,"一个属于2NF的关系一定是多少","3NF","4NF","1NF","0NF",},
{3,"存储模式DDL定义什么数据库","外存","内存","存储","缓存器",},
{3,"CREATER在FOXBASE中是什么指令","指令文件","删除文件","建立文件","修改文件",},
{3,"为解决某一特定的问题而设计的指令序列称为","文档","语言","程序","系统",},
{3,"我国研究成功的百亿次巨型计算机是？","银河-IIII","银河-II","银河-III","银河-I",},
{3,"请求的帧头包括哪两部分？","c.目的地址和rarp报文","b.源地址和arp报文","a.mac报头和ip报头","d.请求和数据包",},
{3,"哪一个协议用来将ip地址映射为mac地址?","b.rarp","a.tcp/ip","c.arp","d.aarp",},
{3,"硬盘的用途是什么？","运算数据的","运算数据时储存用的","存储数据的","以上答案都下确",},
{3,"包含IP地址数量最大的是_______地址","C类","B类","A类","D类",},
{3,"微计算机外存储器是指","ROM","RAM","磁盘","虚盘",},
{3,"在WPS中不能被直接编辑的文件是以什么为扩展名的文件？","BAS","WPS","BAK","BAT",},
{3,"Windows NT 是Microsoft 公司哪年推出？","1989年","1991年","1993年","1995年",},
{3,"走遍美国是什么国家的麦克米伦公司设计的？","英国","中国","美国","澳大利亚",},
{3,"NetAnts截止到2001年9月9日,它的最新版本是多少？","1.26","1.25","1.24","1.23",},
{3,"超级解霸2001和金山影霸3所制作的mpeg4文件的后缀名是什么？","MPG4","MPG","AVI","DAT",},
{3,"NetMyth2001是谁编写的？","Fang Xiangrong","Lewis Hong","Heero Zhang","CaiXuan",},
{3,"现实世界中可被识别的事物称为","形式","物体","实体","形态",},
{3,"A4TECH是什么牌子？","联想","洪基","双飞燕","微软",},
{3,"FDDI网物理层采用什么编码？","差分曼切斯特编码","曼切斯特编码","4B/5B编码","3B/4B编码",},
{3,"G400MAX是哪个公司在1999年4月发布的一款芯片？","lomega","intel","Matrox","stb",},
{3,"请问JavaScript是那个公司的产品？","Microsoft 公司","SUN公司","Netscape公司","IBM",},
{3,"在安装网卡时,不要设置__?","中断号","端口地址","内存地址","mac地址",},
{3,"指出下面哪些是保留字","printf","abc","char","Int",},
{3,"指出下面合法的标识符","int","3ab","ABC","sum.a",},
{3,"C语言的基本是:","指针型","数组型","整型","构造型",},
{3,"PowerBuilder是哪间公司推出的？","微软","金山","Sybase","Delphi",},
{3,"javascript属于什么语言?","标志语言","汇编语言","脚本语言","高级语言",},
{3,"在全屏模式下按什么键会跳出地址框？","Ctrl+I","Ctrl+W","Ctrl+O","Ctrl+N",},
{3,"根域代码INFO是指？","用于个人或人体","国际组织","提供信息服务的组织.","其它组织",},
{3,"根域代码MIL是指？","国际组织","用于个人或人体","军事部门","政府组织",},
{3,"根域代码ATRS是指？","提供信息服务的组织","强调消遣和娱乐的实体","强调文件和娱乐的实体。","要网络支持中心",},
{3,"在计算机中哪一个是中国的简写？","KR","JP","CN","USA",},
{3,"电脑coms密码忘记了怎么办?","查windows查用户文件","用密码工具解码","将二个密码针短路","用黑客软件破解",},
{3,"显示器不包括哪一种？？","LCD","CRT","VCD","PDP",},
{3,"一开机,机箱内扬声器喇叭一直在“哗咕哗咕……”地响,可能的故障有：","键盘没有插好","某个键被一直按着","主板短路","内存坏",},
{3,"“宽带”最早出自什么地方？","计算机网络","电视系统","电话系统","都不对",},
{3,"5类双交线开始使用的时间是多少？","1990年","1980年","1988年","1992年",},
{3,"以下电脑档案格式是图象格式？","dws","cgi","svg","css",},
{3,"网络蚂蚁是用来干什么的","浏览","上传","下载","注册",},
{3,"Flash最初是叫作什么？","Dreamwaver","Director","FutureSplash","Java",},
{3,"ISO将整个通信功能划分为几个层次？","5","4","7","6",},
{3,"用以连接两个以上同类局域网的用____?","中继器","网桥","路由器","网关",},
{3,"网桥的功能有：______?","转发","过滤","都对","学习",},
{3,"LAN－WAN连接的首选设备是：","网桥","中继器","网关","路由器",},
{3,"____又称“信关”,用以连接____?","网关      “同构网”","网桥     “同构网”","网关    “异构网”","网桥     “异构网”",},
{3,"我国于_____开通了第一个公用分组交换网Chinapac网?","33178","32478","32813","32509",},
{3,"称为“协议转换器”的是：____","中继器","网桥","网关","路由器",},
{3,"现在的苹果机是本厂自己做零部件、自己组装的吗？","外厂组装","零部件外厂做","是","都不是",},
{3,"在同一张图片以哪种文件方式保存所占空间最大","JPEG","GIF","BMP","TIF",},
{3,"URL是？？","Unix Resource Location","United Republic Law","Uniform Resource Locator","Use Real Layer",},
{3,"最基本的Internet和Intranet服务是","可靠的传输服务","应用服务","无连接的分组传递服务","控制服务",},
{3,"数据库的顺序文件是____放置的。","索引方式","逻辑顺序","物理顺序","交叉顺序",},
{3,"一个普通的16口100BASE T“中央共享式”HUB只能提供____的数据流通量","1000Mbps","10Mbps","100Mbps","50Mbps",},
{3,"目前实际存在与使用的广域网基本都是采用______","环型拓朴","总线拓朴","网状拓朴","星型拓朴",},
{3,"在RQBE窗口中可以指定条件,FoxPro提供六种比较算符,若要判断某一字段的值是否比某个值小,应使用的比较算符是：","＞","＜","Less Than","More Than",},
{3,"PCMICA卡用在什么机器上？","家用电脑","商用电脑","笔记本电脑","台式电脑",},
{3,"所谓的网络三剑客的设计公司是什么？","ibm","microsoft","micromedia","intel",},
{3,"在非对称密码系统中加密和解密的密钥是一样的吗？","不一定","是","不是","相似",},
{3,"自然码全码共几码组成？","4","3","5","2",},
{3,"不是INTER公司生产的CPU型号是","CELERON","PII","DURON","PENTIUM MMX",},
{3,"OFFICE2000中不包括以下那个软件","EXCEL","WORD","FLASH","POWERPOINT",},
{3,"编辑状态下进入帮助系统的是？","Ｆ３","Ｆ２","Ｆ１","Ｆ４",},
{3,"允许使用＂*＂和＂？＂作通配符的命令是？","ＲＤ","ＴＹＰＥ","ＤＩＲ","ＦＯＲＭＡＴ",},
{3,"在对称密码系统中加密和解密的密钥是一样的吗？","不一定","不是","是","相似",},
{3,"Office XP在中国是哪一天上市的？","6.18","10.25","6.19","7.14",},
{3,"第一个UNIX操作系统是用哪种语言编写的","c","B++","B","c++",},
{3,"源程序要正确地运行,必须要有什么函数?","printf函数","自定义的函数","main函数","不需要函数",},
{3,"下面几种网络拓扑结构中不属于点到点的通信方式是","环形","星形","总线形","树形",},
{3,"PCI总线是一种__标准","微通道","系统总线","局部总线","开放式32位总线",},
{3,"关系数据库管理系统实现的专门关系运算包括","关联、更新、排序","选择、投影、联接","排序、索引、统计","显示、打印、制表",},
{3,"在MS-DOS中,磁盘存储器进行读写操作的基本单位是","光区","软区","扇区","硬盘",},
{3,"在24*24点阵的字库中,存储一个汉字的字模信息需要多少字节？","2*16","24*24","3*24","3*3",},
{3,"计算机的基本内存为","64KB","512KB","640KB","1MB",},
{3,"一个文件夹中存有子目录用下面的哪条命令可以将他册除？","remove","del","deltree","rd",},
{3,"NETBIOS的139端口是做什么的：","数据服务","命名服务","会话服务","特殊服务",},
{3,"NETBIOS的138端口是做什么的：","会话服务","命名服务","数据服务","特殊服务",},
{3,"文件型病毒传染的对象主要是什么类文件？",".dbf",".wps",".com和.exe",".prg",},
{3,"Which ICMP message is the reply to a successful ping command?","Time　Exceeded","Ping　Reply","Echo　Reply","Information　Reply",},
{3,"3d设计中具有光线追踪补偿的渲染器是:","Surface","Render","MentalRay","AfterBurn",},
{3,"下列关于IPv6叙述错误的是：","下一代（IPng）","经常被称为网际协议","IPv6的网络地址是64位","不允许有数据报分段",},
{3,"MPEG1里的NTSC制式的纵横值是:","352x288","320x240","352x240","320x288",},
{3,"事物与事物之间的关系模型中都用___表示","三维表","层次","关系","排序",},
{3,"黑白图像一个象素点的灰度用____数字化信号来表示","16bit","2bit","8bit","32bit",},
{3,"音频信号码方式可分成三类,不是这一类的是","混合形编码","分析合成法","波形编码","脉冲编码",},
{3,"哪种只读内存可以用紫外线抹去其中的数据？","ROM","PROM","EPROM","EEPROM",},
{3,"UNIX的研制者是？","John　simth","Martin　Richards","KEN　Thompson","LEE　eris",},
{3,"CRT显示器即？","真空荧光显示器","发光二极管显示器","阴极射线管显示器","等离子体显示器",},
{3,"Foxpro 在dos系统的基本启动方法","c＞foxpro","c＞run　fox","c＞fox","c＞edit　fox",},
{3,"Macintosh是一种名符其实的多媒体计算机。Apple公司在哪年向世人首次公布这种新机型？","1986","1985","1984","1982",},
{3,"剪贴板的缺省扩展名为",".XLS",".DOC",".CLP",".IMG",},
{3,"下面软件系统平台非DOS平台的软件是","ARJ","HD-COPY","WINZIP","PCTOOLS",},
{3,"3d设计中NUBRS是:","网格模型","面片曲线","非统一有理B样条","以上都不对",},
{3,"Windows 2000专业版可以直接升级为Windows XP个人版吗？","Windows 2000个人版可以","可以","不可以","Windows 2000服务器版可以",},
{3,"MPEG里的NTSC的幀率是多少?","30fps","25fps","29.97fps","24fps",},
{3,"Windows XP服务器版支持几个CPU？","2","6","4","8",},
{3,"ATM是一种面向连接的技术,它采用小的、固定长度的数据传输单元（信元）,其长度为____","2byte","8byte","53byte","16byte",},
{3,"X.25网是一种_____网。","局域网","帧中继","公用分组交换","企业内部网",},
{3,"ASP的完整形式是？","Activate Service Page","Activate Server Page","Active Server Page","Activate Service Pager",},
{3,"FDDI网物理层采用什么编码？","差分曼切斯特编码","曼切斯特编码","4B/5B编码","3B/4B编码",},
{3,"JavaScript提供脚本语言的编程与？非常相似","Java","Visual Basic","C++","B语言",},
{3,"Java的前身是什么语言？","B语言","C语言","Oak语言","Basic语言",},
{3,"全球第一块ddr主版的公司是？？","扬智","升技公司","艾葳科技","ACER",},
{3,"以下哪个不是JavaScript中基本的数据类型？","字符串型","布尔型","逻辑型","空值",},
{3,"JavaScript是什么公司的产品？","SUN","Microsoft","Netscape","IBM",},
{3,"Java是哪个公司推出的新一代面向对象的程序设计语言？","IBM","Microsoft","SUN","Netscape",},
{3,"____为互联网的双方的高层的每一方提供了协议的转换服务?","网桥","中继器","网关","BRounter",},
{3,"令牌环网中的令牌是一个____位的二进制数","4","16","8","12",},
{3,"具有网桥的全部功能,还具有路径选择的是____?","中继器","“半个网桥”","路由器","BRounter",},
{3,"“半个网桥”通常指的是___网桥?","近程","中程","远程","2个",},
{3,"通过改变载波信号的相位值来表示数字信号1、0的方法叫做_______。","FSK","ASK","PSK","ATM",},
{3,"Pearl可以：","用Perl(调用TK)编写GUI程序。","用perl生成代码","都对","用perl过滤邮件",},
{3,"Perl被称为什么语言？？","乌龟","大象","骆驼。","黄金",},
{3,"Python是一个真正的面向什么的语言？","商业","用户","对象","社会",},
{3,"Python可以以什么方式运行？","程序","命令","命令行","函数",},
{3,"Python是一种什么语言？？","高级语言","编程语言","脚本语言","c语言",},
{3,"Python的创始人为？","Anderson","van dersa","Guido van Rossum","Phython",},
{3,"不是防火墙从协议层上应覆盖__________","传输层","网络层","物理层","应用层",},
{3,"网络病毒感染的途径可以有很多种,但是最容易被人们忽视,而发生得最多的是_______","软件商演示软件","网络电子公告牌BBS","用户个人软盘","系统维护盘",},
{3,"Active Server Pages提供几个内置的“对象”(object)？","6","4","5","8",},
{3,"Active Server Pages提供内置的“对象”(object),不包括以下那一个？","Response","Request","以上都错","Server",},
{3,"CIH v1.3,？月？日发作？","7.26","5.26","6.26","每月的26日",},
{3,"CIH v1.2,？月？日发作？","6.26","5.26","4.26","都对",},
{3,"ASP制作成.ASP扩展名的文件,它不包括以下哪一个?","VBscript 或Jscript语言的程序码","HTML标记(tags)","c语言的程序码","ASP语法",},
{3,"一个.asp文件是一个什么文件？","备份文件","执行文件","文本文件","特殊文件",},
{3,"Windows 2000中在使用“网络和拨号连接”时,错误信息600指？","指定的端口已打开","检测到无效的端口句柄","操作挂起","呼叫人的缓冲区太小",},
{3,"win2000中不能支持4颗CPU的是？","Windows2000-DatacenterServer","Windows2000-AdvancedServer","Windows2000-Professional","Windows2000-server",},
{3,"Java的前身是？","B语言","JavaScript","Oak语言","C语言",},
{3,"JavaScript的前身是?","B语言","Oak语言","Live Script","C语言",},
{3,"Delphi诞生的基础是？","SSL","MMX","OOP","ISO",},
{3,"CIH v1.4,？月？日发作？","6.26","4.26","每月26日","5.26",},
{3,"根据网络的传输技术可将网络分为_____?","互联网和局域网","局域网和城域网","广播式网络和点到点网络.","都错",},
{3,"每一层中的活动元素通常称为？","服务提供者","对等实体","实体。","服务用户",},
{3,"层和协议的集合被称为？","实体","物理介质","网络体系结构。","服务用户",},
{3,"不同机器中包含对应层的实体叫？","相等进程","物理介质","对等进程。","都不对",},
{3,"数据能够同时在任意方向进行传输的机制称为？","单工通信","单双工通信","全双工通信。","半双工通信",},
{3,"数据能在任意的方向上进行传输但不能同时进行传输的传输机制称为？","全双工通信","单工通信","半双工通信。","单双工通信",},
{3,"数据仅在一个方向上进行传输,这种传输机制称为？","全双工通信","半双工通信","单工通信。","单双工通信",},
{3,"IEEE802.5,即是通常所说的","城域网","以太网","IBM令牌环。","广域网",},
{3,"IEEE802.3,即是通常所说的","分布式队列双总线DQDB","IBM令牌环","以太网(Ethernet)。","都不对",},
{3,"奔腾级别的CPU共有几种接口？","3","2","1","4",},
{3,"升技公司推出的声卡AU10内建了多少声道的硬件环绕音效？（","2","2.1","5.1","4.1",},
{3,"倍速光驱的传输率是？","200KB/S","250KB/S","150KB/S","300KB/S",},
{3,"FAT16的分区限制是2GB,那么FAT32的分区限制是?","10TB","100GB","2TB","20GB",},
{3,"Windows 2000 Advanced Server最多支持几颗CPU?","32","16","8","4",},
{3,"相对来说,哪种接口刻录机的资源占用和数据传输的稳定性好？","并口","IDE接口","SCSI接口","串口",},
{3,"以下哪个不是CD-RW的接口方式？","IDE接口","SCSI接口","串口。","并口",},
{3,"Windows XP采用的是_____的技术核心？","Windows 95/98","Windows 98/2000","Windows NT/2000","Windows ME",},
{3,"光盘是用什么材料制成的圆片？","玻璃胶","塑料","聚碳酸酯","铁",},
{3,"衡量内存的性能指标不包括哪种？","tAC","tCK","tCL.","CL",},
{3,"IDE设备不包括____？","硬盘","光驱","软驱","DVD",},
{3,"电源插座不包括哪一种？？","ATX","AT","AIX","都对",},
{3,"硬盘的基本物理结构组成不包括____？","磁头","旋转的盘片","托盘","都错",},
{3,"CPU的内部结构不包括____？","逻辑单元","控制单元","运算单元","存储单元",},
{3,"什么是衡量刻录机性能的重要参数？","牌子","缓存容量","读写速度","产地",},
{3,"相对来说,哪种接口刻录机系统对刻录过程的影响较低？","并口","IDE接口","SCSI接口","串口",},
{3,"根域代码REC是指？","用于个人或人体","强调文件和娱乐的实体","强调消遣和娱乐的实体.","从事商业销售的企业",},
{3,"根域代码NOM是指？","政府组织","强调文件和娱乐的实体","用于个人或人体.","强调消遣和娱乐的实体",},
{3,"根域代码ORG是指？","用于个人或人体.","提供信息服务的组织.","其它组织","强调文件和娱乐的实体.",},
{3,"根域代码INT是指？","用于个人或人体","提供信息服务的组织","国际组织.","主要网络支持中心",},
{3,"根域代码WEB是指？","其它组织","提供信息服务的组织","与WWW特别相关的实体.","军事部门",},
{3,"NetTerm是什么软件？","黑客","远程控制软件","远程登录软件","网页制作",},
{3,"根域代码FIRM是指？","教育机构","商业组织","商业公司。","从事商业销售的企业",},
{3,"根域代码NET是指？","提供信息服务的组织","商业组织","主要网络支持中心。","用于个人或人体",},
{3,"跟域代码com是指？","商业公司","主要网络支持中心","商业组织。","国际组织",},
{3,"WinImage是一个基于Windows95的什么软件？","浏览图片","制作动画","磁盘拷贝软件","制作图片",},
{3,"指出下面错误的表达式","a+b=5","i=i++","56=a11","12",},
{3,"指出下面哪些是合法的用户定义的标识符?","double","P-S","putchar","*par",},
{3,"下面哪个表达式的值为4","(float)11/3","11.0/3","(int)(11.0/3+0.5)","37563",},
{3,"Powerbuilder 7中没有提供下面哪种配套工具包？","informaker 6.0","powersite 7.0","Appmod6.0","Objectcycle 2.0",},
{3,"PHOTOSHOP界面分为几部分？","3","5","4","2",},
{3,"____年,ADOBE公司推出功能更加强大的ADOBE Photoshop5.0版本？","1999","1997","1998","1996",},
{3,"____年,ADOBE公司推出ADOBEPhotoshop4.0？","1998","1994","1996","1995",},
{3,"ADOBE公司____年开始推出ADOBE Photoshop？","1994","1992","1990","1988",},
{3,"网上资源共享访问类型不包括____？","完全","只读","都不对","根据口令访到局域网上",},
{3,"一般网卡出厂时,I/O地址设为____？","100H","200H","300H","0H",},
{3,"一般网卡出厂时,中断被设为____？","4","2","3","1",},
{3,"HUB从功能上分不包括____？","被动式","主动式","交换式","智能式",},
{3,"集线器从接口数上分不包括____口？","16","8","10","24",},
{3,"从总线分,网卡的分类不包括____？","PCI","ISA","IDE","都包括",},
{3,"10BaseT中的“T”表示____？","网络是T型","传输的最大距离是10米","传输介质为双绞线","都不对",},
{3,"midas WWW是基于___系统的浏览chengxu","X-Window","Windows3.X","Dos","Windows 9X",},
{3,"10BaseT中的Base”表示_____？","基本传输","基本网络","基带传输","都不对",},
{3,"10BaseT中的“10”表示____？","网络的最大长度为10英尺","网络的最大长度为10米","网络的传输速率为10Mbps。","网络的延迟为10秒",},
{3,"九十年代初SUN公司就提出了著名的“____”的口号？","网络就是互联网","网络就是力量","网络就是计算机。","都不对",},
{3,"九十年代初____公司就提出了著名的“网络就是计算机”的口号？","IBM","Microsoft","SUN","都不对",},
{3,"外模式是模式的","共集","全集","子集","集合",},
{3,"E-R图中包括哪三种基本元素构成","实体、集合、关系","属性、集合、关系","实体、属性、联系","联系、属性、物体",},
{3,"Flash是制作（）的工具软件：","矢量图形","交互媒体","动画","多媒体光盘",},
{3,"金山快译和东方快车能否同时运行？","有时能","能","不能","在win2000能",},
{3,"数据库管理系统有哪两种处理方式？","自含系统和子含系统","自带系统和宿主系统","自含系统和宿主系统","自带系统和子含系统",},
{3,"PostScript是____的专利产品?","Macomedia","IBM","Adobe系统.","Microsoft",},
{3,"1995年____是当时最新最强大的浏览器?","IE4.0","IE3.0","Navigator 2.","Netscape3.0",},
{3,"Flash最初叫做____？","FasterSplash","FurtherSplash","FutureSplash","FromSplash",},
{3,"P1cpu集成？万个晶体管？","310","320","330","300",},
{3,"FLASH是Macromedia公司的一款____软件?","图片制作","网页制作","多媒体矢量动画.","3D制作",},
{3,"80386的存储器的直接寻址能力是？","4mb","4tb","4gb","400mb",},
{3,"快速排序在最坏的时间复杂度是","O(nlnN)","O(N*N*N)","O(N*n)","O(n)",},
{3,"可用作CPU与8位A/D转换器之间接口的Intel公司芯片是","8250","8251","8255","8279",},
{3,"串行接口中,并行数据和串行数据的转换是用什么如下的什么实现的","锁存器","数据寄存器","移位寄存器","A/D转换器",},
{3,"如果8255的PA口工作于方式2,PB口可工作于","方式1","方式0","方式0或方式1","方式2",},
{3,"数据字典中引入数据结构是为了描述","数据存贮","数据流","数据流/数据存贮","数据项",},
{3,"模型机CPU中存放当前执行指令的寄存器是","MAR","PC","IR","PS",},
{3,"DOS系统的文件名由文件主名和扩展名组成,以下可表示备份文件的扩展名是___",".txt",".exe",".bak",".asm",},
{3,"以下不属于数据库系统特点的是","数据共享","数据的结构化","数据通讯","可控冗余度",},
{3,"ALU中文称——？","分支处理单元","地址产成单元","算术逻辑单元","球状矩阵排列",},
{3,"接入Internet,具体有三种方式,其中有一种不是的是","SLIP/PPP方式","联机服务方式","拨号方式","专线接入方式",},
{3,"二进制数01100100转换成16进制数是","100","63","64","144",},
{3,"需要不断刷新的存储器是","EPROM","SRAM","DRAM","EEPROM",},
{3,"集线器（hub)是工作在OSI参考模型的中的哪一层？","传输层","网络层","物理层","数据链路层",},
{3,"高级研究计划局( A R PA )创建了什么网络)？","FDDI","Ethernet","ARPANET","Token Ring",},
{3,"以下哪个没有做过Pentium3内核","Katmai","Coppermine","NorthWood","Tualatin",},
{3,"以下那个不是杀毒软件","瑞星杀毒软件","安全之星","东方不败","kv300",},
{3,"在office软件中,拼写功能的快捷键是","F6","F5","F7","F4",},
{3,"下列3DMAX常用快捷键Ctrl+T的含义是什么？","区域缩放操作","打开文件","纹理校正","平移视图",},
{3,"CIM是一种实现制造业各种过程集成化的","思想","计划","哲理","方案",},
{3,"国际标准化组织采纳的EDI格式标准是","ANSI ASC","ANSI X12","UN/EDIFACT","UN/ECE",},
{3,"SCSI属于什么标准？","MMX","ISO","ACSI","DDR",},
{3,"TCO 代表：","英国专业职业联盟","美国专业职业联盟","瑞典专业职业联盟","德国专业职业联盟",},
{3,"TCO比早期的____标准更为严格,涉及和范围也更广,它包括环境保护,生物工程和能源消耗等多个方面。","ISO9002","MRP/MPR II","MPR/MPR II","ISO9000",},
{3,"8051片内有多少字节的RAM","125","16","256","512",},
{3,"地址总线是（          ）的。","某条单向,总体双向","双向","单向","高阻",},
{3,"Go Live 5是哪个公司的产品？","IBM","Microsoft","Adobe","没有正确答案",},
{3,"Windows XP高级服务器版支持几个CPU？","6","10","8","12",},
{4,"Windows XP专业版支持几个CPU？","8","4","1","2",},
{4,"Windows XP个人版支持几个CPU？","8","2","4","1",},
{4,"Office XP是新一代Office办公套件,此前代码为？","Office 2002","Office 2001","Office NT","Office 10",},
{4,"GoLive 5是什么软件？？","音频制作","游戏修改","动画制作","网页制作",},
{4,"Windows XP不包括以下哪个版本？","高级服务器版","个人版","专业版","企业版",},
{4,"集成度最高的存储线路是","4管动态线路","6管表态线路","6管动态线路","单管动态线路",},
{4,"我国第一台计算机于（   ）年研制成功。","1968","1938","1948","1958",},
{4,"世界上第一台电子计算机于（    ）年诞生在美国。","1940","1950","1956","1946",},
{4,"HUB（集线器）种类众多,大致分三种,哪种不是？","智能型集线器","主动集线器","被动集线器","灵活型集线器",},
{4,"微软在PC98中的规定,SNR（信噪比）值必须多少方才合格？","大于等于70db","大于等于100db","大于等于90db","大于等于80db",},
{4,"Brazil是什么工具","编写脚本","游戏修改","图象处理","渲染引擎",},
{4,"在DOS系统中,用于记录和管理磁盘数据区使用情况的数据结构是","空闲块表","文件控制块","位图表","文件分配表",},
{4,"在虚拟页式存储管理方案中,下面哪一部分完成将页成调入内存的工作？","紧缩技术利用","页面淘汰过程","工作集模型应用","缺页中断处理",},
{4,"MS-DOS是哪一年问世的？","1980年","1982年","1984年","1981年",},
{4,"一张普通光盘最大容量约为：","600M","750M","250M","680M",},
{4,"声卡之父指的是","IBM","intel","Microsoft","ADLIB",},
{4,"计算机中最小的数据单位是","word length","byte","word","bit",},
{4,"一个完整的计算机系统包括＿＿＿＿","计算机及其外部设备","计算机及其外部设备","系统软件与应用软件","硬件系统与软件系统",},
{4,"放大后不会失真的是？","gif静止图","位图","gif动画图","矢量图",},
{4,"fireworks默认保存的文件名是？","jpg","静止gif","动画gif","png",},
{4,"IPv6则为目前较新的IP规格第６版次,有十六个位元组共___个位元","32","256","64","128",},
{4,"微型计算机中的内存储器,通常采用","光存储器","磁表面存储器","磁芯存储器","半导体存储器",},
{4,"所谓“裸机”是指：","只装备操作系统的计算机","单片机","单板机","不装备任何软件的计算机",},
{4,"flash中打开图库的快捷键是？","ctrl＋m","ctrl＋k","f6","ctrl＋l",},
{4,"WATERFALL是什么软件？","摸似器","CPU升温软件","杀毒软件","CPU降温软件",},
{4,"OSI（开放系统互联）参考模型的最低层是","应用层","传输层","网络层","物理层",},
{4,"ISDN有两类接口____和____。","BBI,PMI","BKI,PKI","BRI,PKI","BRI,PRI",},
{4,"xDSL主要成员没有哪一个?","VDSL","HDSL","RADSL","NDSL",},
{4,"在信元交换中,信元头的主要功能是？","起止信息","参数记录","奇偶校验","网络路由",},
{4,"A类IP地址共有多少个网络？","127","128","16384","126",},
{4,"在WWW服务中的TCP标准端口号是？","50","70","60","80",},
{4,"Windows NT 使用__协议来共享文件。","NFS","TCP/IP","Nwlink IPX","SMB",},
{4,"从OSI模型看来,NT1是___设备？","通信层","网络层","链路层","物理层",},
{4,"在Windows里后缀为cpl的文件是有什么用的？","打开VB里面的控件","是个图形文件","在游戏中所用到的库存文件","打开系统的各个控制",},
{4,"表征数据传输有效性的指标是","信道容量","误码率","频带利用率","传输速率",},
{4,"______是在有线与无线通信技术产生后逐步兴起的","古代密码体制","经典密码体制","现代密码体制","古典密码体制",},
{4,"数据压缩法中哪个是对编码没有损坏的?","DPCM","矢量编码","变换编码","预测编码",},
{4,"不能处理位图的软件是？","photoimpact","photoshop","fireworks","flashget",},
{4,"下面以哪种为后缀的文件是不可执行文件？","EXE","COM","BAT","TXT",},
{4,"常见图象文件格式不正确的是?","BMP","GIF","TIF","GPG",},
{4,"ISO是什么意思?","国际计算机协会","国际电子委员会","国际电信协会","国际标准化协会",},
{4,"photoshop是哪间公司的产品？","IBM","microsoft","macromedia","adobe",},
{4,"剪切命令的快捷键是？","ctrl+a","ctrl+c","ctrl+v","ctrl+x",},
{4,"RGB中G表示什么颜色？","灰","红","蓝","绿",},
{4,"8086/8088通用寄存器中用来表示计数器的是?","DX","BX","DI","CX",},
{4,"在备用计算机系统上保持数据库的最新拷贝作为备份。如果基本系统不可用,备用系统将接替基本系统。 这种方法被称作：","重复备份","备份恢复","二次备份","失效恢复",},
{4,"8086/8088通用寄存器中CS表示什么?","目的变址器","基址寄存器","变址寄存器","代码段寄存器",},
{4,"MP表示什么?","存储器","运算器","控制器","微处理器",},
{4,"当送入DOS命令后,如果出现Abort,Retry,Ignore时, 按下回车键则会?","忽略错误,继续执行","重复执行该命令","终止命令,返回操作系统","无反应,继续等待",},
{4,"8086/8088通用寄存器中用来表示指令指示器的是?","SI","SP","DI","IP",},
{4,"8086/8088通用寄存器中用来表示累加器的是?","DX","CX","SI","AX",},
{4,"1971年出现的微机其典型的代表机型是6502和什么型?","80286","IBM-PC","PD-Ⅱ","Z80",},
{4,"从资源管理的角度出发,可把I/O设备分为独占设备,虚拟设备和?","直接存取设备","用户设备","系统设备","共享设备",},
{4,"为了便于对文件进行存取和管理,在文件系统中采用什么管理文件?","文件的系统调度","存储空间","文件安全性","目录",},
{4,"网络新闻传输协议(NNTP)使用的端口是：","80","108","21","119",},
{4,"TCP和UDP周知端口的完整列表可参考RFC____","1821","1670","1980","1700",},
{4,"磁带上的文件一般只能采用什么方法存取?","以块为单位","以字节为单位","随即","顺序",},
{4,"数据库MYSQL是由______的一家叫T.c.X.DataKonsultAB公司开发的。是一个真正多用户、多线程的SQL Server。","澳大利亚悉尼","美国纽约","俄罗斯基辅","瑞典斯德哥尔摩",},
{4,"世界上第一只鼠标是于哪一年诞生的？","1954年","1946年","1945年","1964年",},
{4,"在五笔中,不属于划分层次的是","单字","笔画","字跟","边旁",},
{4,"世界上第一只鼠标是谁发明的？","Nithen　Babale","Green　Skjoino","Midjf　White","Doug　Englebart",},
{4,"重组分段的数据和乱序帧经过重新排序到达的数据是非常不同的。重新排序是下面哪个协议的功能？","UDP","IP","IPX","TCP",},
{4,"IP报文头中含有使一些重要网络功能成为可能的所有必要信息,不包括下面哪一个？","传输过程中数据损坏监测和更正","寻址和路由","分段和重组","CRC监测码",},
{4,"下列不是MIDI的特点的是?","只能对音乐数字化","文件容量小","编辑灵活","不能同时播放两个MID文件",},
{4,"在当今流行的局域网中,采用多令牌协议的是","以泰总线网","令牌环网","令牌总线网","光纤分布数字接口",},
{4,"计算机能直接执行的指令包括两个部分,它们是","数字和文字","ASCII码和汉字代码","源操作数和目标操作数","操作码和操作数",},
{4,"一般硬盘的保修期为：","1年","2年","4年","3年",},
{4,"哪个不是形容显卡技术的？","四通道渲染引擎","T&L","GPU","3D NOW",},
{4,"所谓变号操作是指将一个整数变成绝对值相同但符号相反的另一个整数。假设使用补码表示的8位整数X=10010101,则经过变号操作后结果为：","1101010","11101010","10101","1101011",},
{4,"SQL是什么意思？","选择队列库","结构化查询库","选择队列语言","结构化查询语言",},
{4,"哪一个是Sybase公司的产品？","VC++","C++Builder","VB","PowerBuilder",},
{4,"在windows服务器里用ftp登陆一个站点的匿名帐号是：","administrator","guest","temp","anonymous",},
{4,"什么主板首创双bios技术？","华硕","微星","钻石","技嘉",},
{4,"NXT技术是形容哪个硬件设备的？","内存","显示器","CPU","音响",},
{4,"在下列各网络结构中,共享资源能力最差的是____。","星型结构","总线结构","网状结构","树型结构",},
{4,"典型的局域网操作系统的系统容错(SFT)分为三级,最高一级系统容错采用____。","网卡冗余","磁盘双工","服务器镜像","磁盘镜像",},
{4,"IRQ表示什么意思？","没什么意思","网络寻呼机","网络协议","中断请求",},
{4,"如果两个局域网运行的操作系统不同,为了要将他们互联,则需要配置____。","中继器","网点","网卡","网桥",},
{4,"色相、饱和度、亮度用什么表示？","CMYK","RGB","CMY","HSB",},
{4,"电子邮件中@的正确读法应是","圈a","花a","反圈a","at",},
{4,"C语言是在哪种语言的基础上发展起来的？","A语言","PASCAL","BAISC","B语言",},
{4,"被称作“裸机”的计算机是指？","没有硬盘的微机","没有安装外部设备的微机","大型机器的终端机","没有安装任何软件的微机",},
{4,"下列各种数制的数中,最小的数是？","(44)10进制","(101100)2进制","(54)8进制","（2a)16进制",},
{4,"PIII比PII多了一条什么指令？","DDN","MMX","ISSC","SSE",},
{4,"哪一个协议层保证了多个设备共享传输介质？","网络","物理","LLC","MAC",},
{4,"OSI模型的第3层是什么层","表示层","物理层","应用层","网络层",},
{4,"Ulead Gif Animator是哪家公司的产品？","康柏","宏基","微软","友立",},
{4,"AGP显卡的插槽有多少个针脚？？","64","30","25","46",},
{4,"关于下面进程说法错误的是","就绪态到运行态","运行态到等待态","等待态到就绪态","等待态到运行态",},
{4,"综合业务数字网ISDN是在什么基础上建里起的","电话网IBN","电话网IEN","电话网IAN","电话网IDN",},
{4,"计算机中的字节是个常用的单位,它的英文名字是","TYBE","BETY","TEBY","BYTE",},
{4,"计算机能直接识别的语言是","各种原程序","高级语言","汇编语言","机器语言",},
{4,"连续获得中国网站综合评比五年第一的是哪个网站？","ms-www.sc.cninfo.net","www.china.com","www.263.net","www.sina.com.cn",},
{4,"bios能用ZIP文件刷吗？","有时行","可以","有的能","不能",},
{4,"厦华17寸彩显的显象管采用的点距是多少？","0.26mm","0.23mm","0.32mm","0.28mm",},
{4,"以下是内部命令的是","TREE","XCOPY","SYS","POMPT",},
{4,"Outlook Express 软件是用于","统计报表应用","字处理","图象处理","交换电子邮件",},
{4,"以下属于外部命令的是","DIR","RD","MD","LABLE",},
{4,"GB2312-80国家标准中,一级汉字置于16区至55区,二级汉字置于56区至87区。若某汉字的机内码为DBA1H,则该汉字是：","非法码","图形字符","一级汉字","二级汉字",},
{4,"使用超大规模集成电路制造的计算机应该归属于","第三代","第一代","第二代","第四代",},
{4,"在计算机硬件系统中,Cache是","可编程只读存储器","只读存储器","可擦除可再编程只读存储器","高速缓冲存储器",},
{4,"下列哪种多媒体文件的扩展名是.WAV","动画","乐器数字","数字视频","音频",},
{4,"与OSI参考模型相比,TCP/IP参考模型没有？","传输层、应用层","应用层、传输层","传输层、互联网层","表示层和会话层",},
{4,"内存储器与CPU____交换信息","部分","间接","不可以","直接",},
{4,"存储器访问速度最快的是","软盘","硬盘","CD-ROM","RAM",},
{4,"操作系统属于","软件包","软件系统","通用软件","系统软件",},
{4,"在计算机网络中,“VLAN”遵循的网络标准是：","799.st","799.lq","802.st","802.lq",},
{4,"内存空间地址为3001H至7000H,表示？","16mb","4kb","4mb","16kb",},
{4,"计算机最主要工作特点","记忆力强","高速度","高精度","存储程序与自动控制",},
{4,"DOS系统中,当用户需要某些配置时,可以将配置命令写在下列哪一个文件中","DIGCON.EXE","CONFIG.EXE","FIGCON.SYS","CONFIG.SYS",},
{4,"构成计算机的电子的和机械的物理实体称为？","计算机系统","外存","主机","计算机硬件系统",},
{4,"微型计算机中,I／O设备的含义是？","控制设备","输出设备","输入设备","输入输出设备",},
{4,"由高级语言编写的源程序要转换成计算机能直接执行的目标程序,必须经过？","解释","编辑","汇编","编译",},
{4,"计算机的指令集合称","计算机语言","软件","程序","机器语言",},
{4,"CDRAM-Cached DRAM是：","增强型动态存储器","高速缓存视频存储器","动态存储器","高速缓存存储器",},
{4,"在DOS系统中,用于设置或取消Ctrl＋C组合键控制的命令是?","SET","ATTRIB","EXIT","BREAK",},
{4,"在内存中,每个基本单位都被赋予一个唯一的序号,这个序号称为?","容量","字节","编号","地址",},
{4,"硬盘连同驱动器是一种?","半导体存储器","内存储器","只读存储器","外存储器",},
{4,"计算机软件系统应包括?","程序和数据","编辑软件和连接程序","数据库软件和管理软件","系统软件和应用软件",},
{4,"DRAM存储器的中文含义是?","动态只读存储器","静态随机存储器","静态只读存储器","动态随机存储器",},
{4,"在微机中,应用最普遍的字符编码是?","补码","BCD码","汉字编码","ASCII码",},
{4,"MODEM又称什么?","光驱","打印机","扫描仪","调制解调器",},
{4,"下面哪种病毒是4月26日发作?","主页病毒","欢乐时光","破坏之王","CIH病毒",},
{4,"数据库管理系统是","应用软件","科学计算软件","辅助设计软件","系统软件",},
{4,"以下不属于显示器的显示模式","VGA","CGA","EGA","AGA",},
{4,"直接与控制器进行信息交换的存储器是","硬盘","CPU","外存","内存",},
{4,"下面哪一天不是欢乐时光的发作日?","37532","37443","37414","37379",},
{4,"一坐建筑物的几间办公室要连网,采用那种___网","WAN","MAN","GAN","LAN",},
{4,"CD-ROM属于","感觉媒体","表现媒体","表示媒体","存储媒体",},
{4,"DOS系统对其使用的文件名,从长度到所选字符是有一定要求的。根据DOS文件命名规则,下列不符合要求的文件名是","12345.BAT","PCTOOL.COM","555","经理备忘录.TXT",},
{4,"衡量显示器的指标是","显示速度","主频","波特率","分辨率",},
{4,"高级语言特点是","执行速度快","不须编译","一种自然语言","独立于具体计算机硬件",},
{4,"已知英文字母a的ASCII代码值是十六进制61H,那么字母d的ASCII代码值是","2H","24H","54H","64H",},
{4,"一个完整的计算机系统是由__组成","操作系统和应用软件","主机,外围设备","系统软件,应用软件","硬件系统和软件系统",},
{4,"下面哪个代表计算机辅助制图？","CAP","CAI","CAB","CAD",},
{4,"CAI代表什么？","一个计算机公司的简称","计算机辅助制图","计算机辅助设计","计算机辅助教学",},
{4,"在excel中,若要对某工作表重新命名,可以采用？","双击表格题行","单击工作表标签","单击表格题行","双击工作表标签",},
{4,"网络传输的关键因素不包括：","路径","传输输率","误码率","硬件设备",},
{4,"Authorware是哪间公司的产品？","Intel","Microsoft","Oracle","Macromedia",},
{4,"下列软件哪一个不是微软出品的？","VC","Office","VB","Winzip",},
{4,"RAID是一种什么技术？？","可移动存储器","内存","CPU","磁盘阵列",},
{4,"广域网的缩写是：","ＩＮＴＥＲＮＥＴ","ＬＡＮ","ＩＮＮ","ＷＡＮ",},
{4,"第一台具有多媒体特性的计算机是那一年出生的：","1975","1981","1988","1984",},
{4,"后缀为$$$的是什么类型文件?","数据文件.","覆盖文件.","备份文件.","暂存文件.",},
{4,"如果你参加网上新闻组有关计算机方面的专题讨论,你应该选择____组。",".MOVIE",".SOC",".NEWS",".COMP",},
{4,"WPS中的硬回车在屏幕上方一什么来表示?","实心方块","空心方块","空心三角","实心三角",},
{4,"汉字机内码又称为：","输入码","交换码","国标码","汉字ＡＳＣII码",},
{4,"软驱动器内盘片的转速一般为：","300转/秒","600转/分","400转/秒","300转/分",},
{4,"下面哪个是用来在Internet上保障用户之间数据传输的安全的?","RPL","SSL","DNS","RAS",},
{4,"中国互联网络信息中心（CNNIC）已授权清华大学CERNET中心运行二级域名_________并受理它以下的域名注册服务。",".GOV",".NET",".COM",".EDU",},
{4,"________,计算机世界网上日报开通。在线服务中心先后为DEC、IBM、HP、摩托罗拉、3COM 、西安杨森、联想公司开通中文网站、","1990年","1996年","1984年","1998年",},
{4,"下面哪一种是第二代(58-63年)的计算机所用的元器件？","VLSI","电子管","LSI","晶体管",},
{4,"音频信号的压缩编码算法不包括：","Real audio","pcm","mp3","mpg",},
{4,"一般CD的采样频率为：","88.2khz","20.05khz","11.025khz","44.1khz",},
{4,"用集成电路作为电子元件制成的计算机属于","第四代","第一代","第二代","第三代",},
{4,"请问冰河的默认端口是多少","13660","80","139","7262",},
{4,"下面哪种语言最早完整体现了面向对象的思想","Java","pascal","LISP","Smalltalk",},
{4,"powerpoint中按下什么快捷键可以放映幻灯片","ALT+Z","CTRL+C","CTRL+A","F5",},
{4,"扩展名为.avi的文件是什么文件","位图图像","MIDI音乐","声音","活动图像",},
{4,"Window95中文版是什么时候问世的","1996.7.24","1995.7.24","1996.8.24","1995.8.24",},
{4,"Access的表对象的使用窗口有哪两种：","SQL窗口和查询窗口","查询窗口和数据窗口","设计窗口和查询窗口","设计窗口和数据窗口",},
{4,"在Athlon-CPU上印有A1333Ams3C,其中第二个A代表","第一批","Athlon","A级","Socket　A",},
{4,"在发送多点广播传输时,要把消息广播给所有用户,要使用什么IP地地址？","192.168.100.1","127.0.0.1","0.0.0.0","255.255.255.255",},
{4,"以下属于Access的对象的是：","菜单对象","Macrod","测试对象","查询对象",},
{4,"Access2000是通过什么来完成","Paradox","dBASE","Sybase","DBMS",},
{4,"Access的七种对象中谁是整个数据库的核心","报表对象","查询对象","窗体对象","表对象",},
{4,"下面哪层不属于TCP/IP参考模型？","应用层","互联网层","传输层","会话层",},
{4,"在计算机网络OSI模型的7层协议中,第4层是什么？","应用层","网络层","会话层","传输层",},
{4,"控制芯片组不包括：","lbx","pcmc","sio","usb",},
{4,"在unix系统中根用户的uid值是","su","1","root","0",},
{4,"无连结服务（connectionless service）是以____系统为模式？","都不对","电话系统和邮政系统","电话系统","邮政系统。",},
{4,"服务在形式上是由一组____来描述的？","都不对","术语","代码","原语。",},
{4,"在unix系统中与进程无关的id是","egid、rgid","euid","ruid","huid",},
{4,"ASCII总共有几个元素？","130","128","129","127",},
{4,"面向连结的服务（connection-oriented service）是以____系统为模式？","都不对","邮政系统","电话系统和邮政系统","电话系统。",},
{4,"硬盘的接口不包括：","scsi","ide","eide","pci",},
{4,"FOXPRO最多可以打开多少个工作区？","128","256","64","255",},
{4,"INTERNET提供的服务有：E-MAIL,WWW,远程登录和","通信光览","文件服务器","网络工作站","文件传输协议FIP",},
{4,"CPU的内部结构不包括——单元？","存储","控制","逻辑","运算",},
{4,"VIA(威盛)在收购cyrix后的第一款处理器是：","cyrix3","Samuel","cyrix  6x68","Joshua",},
{4,"Cyrix公司的第一款在奔腾处理器市场的产品是：","cyrix　7x87","cyrix　7x78","cyrix　6x68","cyrix　6x86",},
{4,"东方不败III与金山游侠III都是什么软件","不是同一类软件","系统软件","文字处理软件","游戏修改软件",},
{4,"冰河怎么防最有趣的方法是?","4.天网2000版","2.防火墙","3.软件防治","1.不上网",},
{4,"扫描仪与计算机之间接口传输速度最快的是","USB接口","并行接口","串行接口","SCSI接口",},
{4,"现在PC机上使用的硬盘主要有","并行接口","USB接口","串行接口","IDE接口",},
{4,"DIY族买键盘时一般不考虑哪方面","保护","材质","接口","生产厂商",},
{4,"扫描仪的光学分辨率的单位是","mm","bit","byte","dpi",},
{4,"上网时,电脑设定的速率与“猫”的传输速率是否一样？","以上都不对","一样","视情况而定","不一样",},
{4,"在点对点通信中,应注意","网络类型","协议","冲突问题","兼容性问题",},
{4,"目前通用的电磁辐射标准中,哪一种是1990年制定的？","以上都不是","MPR标准","TCO标准","MPR II标准",},
{4,"节能（绿色）功能适用于主板 吗？","以上都不对","不适用","适用部分主板","适用",},
{4,"最为简单,经济的两机互连方法是连接两台机器的","以上都不对","并行通信口","USB接口","串行通信口",},
{4,"对于跳线的类型,下列叙述错误的是","4针跳线","2针跳线","3针跳线","5针跳线",},
{4,"下列哪一个不是主板上的L2高速缓存的封装形式","条状cache","主板自带cache","片状cache","块状cache",},
{4,"下列不是常见芯片组的有","Intel芯片组","VIA芯片组","SIS芯片组","ALT芯片组",},
{4,"电脑的最初在学术上的命名是？","计数器","计算机","算盘","图灵机",},
{4,"Cnche目录下的HTM文件和JPG文件会不会有毒？","一定会","会","可能会","不会",},
{4,"cpu的主要性能指标有：","主频,倍频,外频","内存总线速度","超标量","都对",},
{4,"Voodoo5 5000采用何种芯片？","三个VSA-100芯片","四个VSA-100芯片","单VSA-100芯片","双VSA-100芯片",},
{4,"cpu的实描式与保护式的切换是通过____地址线实现的。","50","30","40","20",},
{4,"“程序设计软件”属于：","都不对","操作软件","系统软件","应用软件",},
{4,"MINI－ATX主板可缩小到：","11*8","11.2*8","11*8.2","11.2*8.2",},
{4,"ATX主板的标准设计规格为：","10*8","10*8","12*10","12*9.6",},
{4,"CD－R规格书由哪两个公司于何年制定的？","IBM&Philips1980","Nec&Sony1990","IBM&NEC1980","Philips&Sony1990",},
{4,"“声卡之父”的是哪家公司？","NEC","Creative","Sound","Adlib",},
{4,"哪家公司制造了第一部2倍速的CD－R刻录机？","Philips","Sony","NEC","Yamaha",},
{4,"2000年2月7日--9日,就中全体中国人,欢度春节的时候,大洋彼岸的黑客们没有侵犯的网站是","美国有线电视网","雅虎","亚马逊网上书店","搜狐",},
{4,"用kv300保存硬盘主引导区信息命令格式","kv300/ndpt.vir","kv300/hdpt","kv300/k","kv300/b",},
{4,"通用寄存器中哪个表示累加段","DX","BX","CX","AX",},
{4,"下面哪一项不是分时操作系统的特征？","及时性","交互性","多用户同时性","兼容性",},
{4,"逻辑运算的优先级是","与非或","或与非","与或非","非与或",},
{4,"SNMP不包括下面哪个协议","SNMP","MIB","SMI","CMIP",},
{4,"以下哪一款是运行在Windows下的客户端电子邮件收发工具？","Macrmedia","mstask","CMOS","FoxMail",},
{4,"AMD公司抢先于INTEl的PENII处理器之前于1997年的几月推出了K6？","3月初","5月初","6月初","4月初",},
{4,"FLASH GET最多可以支持多少个线程？","3","5","8","10",},
{4,"为了将所有扩展名为.PAS的文件改成扩展名为.P,应使用命令:","REN　*.PAS　*.P??","REN　*.PAS　*.?　AS","REN　PAS　P","REN　*.PAS　*.P",},
{4,"打印当前屏幕内容应使用的控制键是?","PgDn","Scroll-Lock","Num-Lock","PrtSc(Print Screen)",},
{4,"3.5英寸软盘片的一个角上有一个滑动块,如果移动该滑动块露出一个小孔,则该盘:","能读写","不能读也不能写","不能读但能写","只能读不能写",},
{4,"十六进制数FF.1转换成十进制数是?","127.125","255.125","127.0625","255.0625",},
{4,"特洛依木马第三代最初出现的年份,是：","1993","1988","1996","1998",},
{4,"应用层是第几层？","4","6","5","7",},
{4,"全世界最大的互连网监听机构（2001年8月为止）名是：","微软","天王","天网","阶梯",},
{4,"我国北京2001年7月研制成功并对外公布的“曙光”服务器的运算速度是多少？","每秒1000亿次","每秒10亿次","每秒200亿次","每秒4000亿次",},
{4,"AMD Athlon是世界第一颗用第几代微处理器架构的CPU","8","6","5","7",},
{4,"G400是那个公司的产品？","ATi","3Dfx","nVidia","Matrox",},
{4,"硬体监控程式允许监控系统的各项情况,这些包括cpu的电压和？","风向和风扇转速","风向和电流","寿命和温度","风扇转速和温度",},
{4,"AOPEN品牌是属于台湾宏基集团的哪一家公司","立基","宏基","明基","建基",},
{4,"太阳花幻影S8800显卡的最低工作频率是多少","200MHZ","166MHZ","175MHZ","333MHZ",},
{4,"光驱中的CLV技术是指","角加速度","恒定角速度","线加速度","恒定线速度",},
{4,"由三菱公司对光驱度家采用的ABS技术是指","纠错系统","防抱死系统","精确系统","自动平衡系统",},
{4,"AOPEN显卡的特有专利是什么？","DR.LED","DDS","DIE-HARD","OPEN　BIOS",},
{4,"在CAD技术中,与绘图设备有关的坐标系是？","规格化","世界","用户","绝对",},
{4,"一般世面上的不可超频的AMD SOCKET A接口的CPU是多少跟针脚","456","462","358","458",},
{4,"AUTOCAD中利用图层功能可将整个图形和各层图进行","图形的布尔差操作","图形的布尔交操作","图形的布尔并操作","透明叠加操作",},
{4,"AUTOCAD软件中,图标菜单表示命令是通过下列哪种方式实现的","弹出式菜单","光标菜单","按钮菜单","像素小图标",},
{4,"保证CAD设计质量和效率的最重要的因素是：","CAD数据库","CAD数据采集","CAD中断处理","CAD图形显示",},
{4,"CAD技术中,用光标输入图形的网格点间距是","图形输入分辨率","显示分辨率","绘图分辨率","捕捉分辨率",},
{4,"WPS中F8是什么键？","模式转换","打印","退出","模拟显示",},
{4,"DDR内存的速度是SDROM的几倍","4","3","5","2",},
{4,"内存中的DDR技术代表","data　double　radiation","data　double　rate","double　data　radiation","double　data　rate",},
{4,"奔腾机最高到多少GHZ？","1000","1.4","1.3","1.7",},
{4,"AUTOCAD软件中提供的捕捉（snap）分辨率是图形输入网络点的间距大小,它是图形库中的哪种分辨率？","密集点精度","像素","抽象距离","坐标",},
{4,"3d设计中做云雾的插件是:","Splash!","Simcloth","Surface","AfterBurn",},
{4,"3d设计中做人物表情设计的插件是:","Splash!","Simcloth","AfterBurn","Smirk",},
{4,"语句“dim at(20)定义的数组下界为：","-32767","1","20","0",},
{4,"unix是一种____位多用户的网络操作系统","8","16","64","32",},
{4,"novell公司的netware能支持____种网卡？","75","55","65","85",},
{4,"winnt能建立_____server","gopher server","web server","ftp server","都对",},
{4,"fddi协议中使用的网络拓扑结构是","都不对","三环拓扑","单环拓扑","双环拓扑",},
{4,"在DIR后加哪个参数,只显示文件名","/A","/P","/S","/W",},
{4,"若在标记环网中,有10个站点,环长为1Km,传播延迟为5us/km,速率为1Mbit/s,环上存在多少位？","5","10","50","15",},
{4,"要运行Windows 98的机器最少要有___的RAM","24MB","32MB","8MB","16MB",},
{4,"以下哪一个系统不能和Windows 98设置双重启动(Dual Booting)?","Windows3.x","WindowsNT","Windows2000Professional","Windows95",},
{4,"以下那一个不属于Memory Manager程序？","386MAX","EMM386","QEMM","MSD",},
{4,"win-me比win98新增了什么系统工具?","磁盘清理程序","维护向导","系统文件检查器","系统还原",},
{4,"AGP 4X的理论最高传输速率是MB/S","755","266","533","1066",},
{4,"ATM的典型工作速度是","622Mbps","155Mbps","1.544Mbps","45Mbps",},
{4,"？信号具有离散状态的物征","以上都不是","模拟的","频率调制","数字的",},
{4,"要连接Token Ring he  Ethernet 网段,需要","路由器","转发器","远程网桥","网桥",},
{4,"使用SYTP接线电缆的令牌网能支持？台计算机","1024","60","500","260",},
{4,"10Base5网不能超过的最大长度是？","1000米","185米","300米","500米",},
{4,"CSMA/CD通常应用与","10BASE5网","Microsoft网","LocalTalk网","Fast　thernet　网",},
{4,"CSMA/CD网的最大尺度为？","1500米","100米","300米","2500米",},
{4,"IEEE802.3与以下哪些网络体系结构相关？","以上都不对","Token Ring","Internet","Ethernet",},
{4,"SLIP支持以下哪些传输协议？","以上全部","IPX/SPX","NETBEUI","TCP/IP",},
{4,"IEEE802.5与以下 哪些网络体系相关？","以上都不是","Ethernet","Internet","Token Ring",},
{4,"分组交换网络的另外一个名称是：","虚拟电路","无连接","数据报","存储-转发",},
{4,"路由器工作在OSI？层","物理层","传输层","数据链路层","网络层",},
{4,"哪一种交换方式使用了虚拟电路？","上面三种","报文","线路","分组",},
{4,"MUD又俗称什么？","聊天室","泥土","过家家","泥巴",},
{4,"Shag:Fur是3DS MAX的插件之一,它的作用是:","材质贴图","衣料制作","粒子控制","制作毛发",},
	};

	CContainer * ob;
	int i,how;
	CMapping * skl = me->query_skills();
	CVector sname;
	if(! strlen(ask))
	{
		if (me->query("combat_exp") < 3000 || me->query("mud_age") < 18000)
		{
			say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
			SendMenu(me);
			return 1;
		}
		if (me->query("combat_exp") >=3000 ) 
		{
			how = 0;
			skl->keys(sname);
			for(i=0; i< sname.count(); i++)
			if (skl->query(sname[i]) >= 10) how ++;
			if(how < 5)
			{
				say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
				SendMenu(me);
				return 1;
			}
		} 
		if(me->query("exam/exam2_count")>10)
		{
			say("你已经参加过了考试了,就不要再来了吧！",me);
			SendMenu(me);
			return 1;
		}
		say("准备好,考试要开始了。每个人只有一次机会，总共可以选择回答十道题目。要注意中途退出可是要算你弃权的哟！", me);
		AddMenuItem("开始考试","y", me);
		AddMenuItem("还是算了吧", "n", me);
	}
	else if(strcmp(ask, "y") == 0)
	{
		if (me->query("combat_exp") < 3000 || me->query("mud_age") < 18000)
		{
			say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
			SendMenu(me);
			return 1;
		}
		if (me->query("combat_exp") >=3000 ) 
		{
			how = 0;
			skl->keys(sname);
			for(i=0; i< sname.count(); i++)
			if (skl->query(sname[i]) >= 10) how ++;
			if(how < 5)
			{
				say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
				SendMenu(me);
				return 1;
			}
		} 
		int idx= random(1367);
		me->set("exam/exam2_key",exam[idx].key);
		me->add("exam/exam2_count", 1);
		me->add("exam/exam2_n", 1);
		if(me->query("exam/exam2_count")>10)
		{
			say("你已经参加过了考试了,就不要再来了吧！",me);
			SendMenu(me);
			return 1;
		}
		say(snprintf(msg,255,"第%d题(正确：%d/10题,)：",me->query("exam/exam2_count"),me->query("exam/exam2_y")),me);
		say(exam[idx].title,me);
		AddMenuItem(exam[idx].key1, "1", me);
		AddMenuItem(exam[idx].key2, "2", me);
		AddMenuItem(exam[idx].key3, "3", me);
		AddMenuItem(exam[idx].key4, "4", me);
	}
	else if(strcmp(ask, "n") == 0)
	{
		return 1;
	}
	else if(strcmp(ask, "1") == 0)
	{
		if(me->query("exam/exam2_key")==1)
		{
			say("恭喜你,答对了这一题。", me);
			me->add("exam/exam2_y", 1);
			me->add("exam/exam2_n", -1);
			me->del("exam/exam2_key");
		}
		else
		{
			say("对不起,你回答错了。", me); 
			me->del("exam/exam2_key");
		}
		if(me->query("exam/exam2_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam2_y")>6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam2_y"));
				me->add("combat_exp", 888*me->query("exam/exam2_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam2_y"),16888*me->query("exam/exam2_y")),me);
				if(me->query("exam/exam2_y")>8)
				{
					me->add("con",1);
					tell_object(me, snprintf(msg, 255, "$HIY由于考试成绩优异,你另外获得了永久增加一点的体质奖励。"));
					message_vision( "$HIR只见金光一闪，$N立刻全身一阵抖擞，血脉暴涨。" , me);
				}
				if(me->query("exam/exam2_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam2_y"));
				me->add("combat_exp", 666*me->query("exam/exam2_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam2_y"),10888*me->query("exam/exam2_y")),me);
			}
			
			if(me->query("exam/exam2_y")==10)
			{
				me->set("exam/exam2",1);
			}
			me->del("exam/exam2_y");
			me->del("exam/exam2_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1 )
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异,因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "2") == 0)
	{
		if(me->query("exam/exam2_key")==2)
		{
			say("恭喜你,答对了这一题。", me);
			me->add("exam/exam2_y", 1);
			me->add("exam/exam2_n", -1);
			me->del("exam/exam2_key");
		}
		else
		{
			say("对不起,你回答错了。", me); 
			me->del("exam/exam2_key");
		}
		if(me->query("exam/exam2_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam2_y")>6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam2_y"));
				me->add("combat_exp", 888*me->query("exam/exam2_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam2_y"),16888*me->query("exam/exam2_y")),me);
				if(me->query("exam/exam2_y")>8)
				{
					me->add("con",1);
					tell_object(me, snprintf(msg, 255, "$HIY由于考试成绩优异,你另外获得了永久增加一点体质的奖励。"));
					message_vision( "$HIR只见金光一闪，$N立刻全身一阵抖擞，血脉暴涨。" , me);
				}
				if(me->query("exam/exam2_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam2_y"));
				me->add("combat_exp", 666*me->query("exam/exam2_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam2_y"),10888*me->query("exam/exam2_y")),me);
			}
			
			if(me->query("exam/exam2_y")==10)
			{
				me->set("exam/exam2",1);
			}
			me->del("exam/exam2_y");
			me->del("exam/exam2_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1 )
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异,因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "3") == 0)
	{
		if(me->query("exam/exam2_key")==3)
		{
			say("恭喜你,答对了这一题。", me);
			me->add("exam/exam2_y", 1);
			me->add("exam/exam2_n", -1);
			me->del("exam/exam2_key");
		}
		else
		{
			say("对不起,你回答错了。", me); 
			me->del("exam/exam2_key");
		}
		if(me->query("exam/exam2_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam2_y")>6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam2_y"));
				me->add("combat_exp", 888*me->query("exam/exam2_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam2_y"),16888*me->query("exam/exam2_y")),me);
				if(me->query("exam/exam2_y")>8)
				{
					me->add("con",1);
					tell_object(me, snprintf(msg, 255, "$HIY由于考试成绩优异,你另外获得了永久增加一点体质的奖励。"));
					message_vision( "$HIR只见金光一闪，$N立刻全身一阵抖擞，血脉暴涨。" , me);
				}
				if(me->query("exam/exam2_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam2_y"));
				me->add("combat_exp", 666*me->query("exam/exam2_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam2_y"),10888*me->query("exam/exam2_y")),me);
			}
			
			if(me->query("exam/exam2_y")==10)
			{
				me->set("exam/exam2",1);
			}
			me->del("exam/exam2_y");
			me->del("exam/exam2_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1)
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异,因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "4") == 0)
	{
		if(me->query("exam/exam2_key")==4)
		{
			say("恭喜你,答对了这一题。", me);
			me->add("exam/exam2_y", 1);
			me->add("exam/exam2_n", -1);
			me->del("exam/exam2_key");
		}
		else
		{
			say("对不起,你回答错了。", me); 
			me->del("exam/exam2_key");
		}
		if(me->query("exam/exam2_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam2_y")>6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam2_y"));
				me->add("combat_exp", 888*me->query("exam/exam2_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam2_y"),16888*me->query("exam/exam2_y")),me);
				if(me->query("exam/exam2_y")>=8)
				{
					me->add("con",1);
					tell_object(me, snprintf(msg, 255, "$HIY由于考试成绩优异,你另外获得了永久增加一点体质的奖励。"));
					message_vision( "$HIR只见金光一闪，$N立刻全身一阵抖擞，血脉暴涨。" , me);
				}
				if(me->query("exam/exam2_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam2_y"));
				me->add("combat_exp", 666*me->query("exam/exam2_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam2_y"),10888*me->query("exam/exam2_y")/2),me);
			}
			
			if(me->query("exam/exam2_y")==10)
			{
				me->set("exam/exam2",1);
			}
			me->del("exam/exam2_y");
			me->del("exam/exam2_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1 )
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异,因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	SendMenu(me);
	return 1;
}

NPC_END;




