// wiz_teacher3.h 文学考官

NPC_BEGIN(CNwiz_teacher3);

virtual void create()
{
	set_name("江水寒", "jiang suei han");
	set("title", "流云居士");
	set("long","节日快乐,我喜欢用功读书的人,假如你答对我的问题我会奖励你好东东。 ");
	set("gender", "女性");
	set("age", 75);
	set("class", "scholar");
	set("attitude", "friendly");
	set("shen_type", 1);
	set("str", 40);
	set("int", 40);
	set("con", 40);
	set("dex", 40);
	set("per", 40);
 	set("icon",young_woman3);
	
	set("max_hp", 15500);
	set("mp", 3000);
	set("max_mp", 5000);
	set("mp_factor", 100);
	set("combat_exp", 10000000);
	set("score", 200000);

}


int do_talk(CChar * me, char * ask = NULL)
{
	char msg[255];
	static struct{
		int key;											//正确答案
		char title[255];									//题目
		char key1[255],key2[255],key3[255],key4[255];		//答案
	}exam[1479] = {
{2,"希腊神话中阿波罗经常弹奏的乐器是：","银钢琴","金竖琴","小号","笛",},
{2,"吴敬梓是哪本名著的作者？","《官场现形计》","《儒林外史》","《聊斋》","《初刻拍案惊奇》",},
{2,"下列哪个是《巴黎圣母院》中的人物？","巴尔扎特","卡西莫多","莫泊桑","唐吉柯德",},
{2,"以下是莫泊桑短篇小说中的精品的是：","《变色龙》","《项链》","《飘》","《简爱》",},
{2,"《西厢记》的作者是：","柳宗元","王实甫","马致远","白居易",},
{2,"越窑瓷器有“秘色瓷”之称,这个“秘”指的是什么颜色？","红色","青色","黑色","白色",},
{2,"西汉的《方言》一书,是我国研究方言的重要资料,其作者是：","李长青","杨雄","蒋报国","肖志援",},
{2,"以下哪一部不是屈原的作品:","离骚","大雅","楚辞","天问",},
{2,"高尔基的三步曲不包括","童年","我的童年","在人间","我的大学",},
{2,"《孙子兵法》共有多少篇注？","12","13","14","15",},
{2,"“历尽劫波兄弟在,相逢一笑泯恩仇”是谁的诗句？","周恩来","鲁迅","毛泽东","郭沫若",},
{2,"以下哪本书不是《四书》之一","《论语》","《春秋》","《中庸》","《大学》",},
{2,"冰心的原名是什么？","王新","谢婉莹","曹梦宁","田影",},
{2,"“不要人夸颜色好,只留清气满乾坤”出自谁的诗？","元代 高明","元代 王冕","南宋 陆游","南宋 叶梦得",},
{2,"《促织》的作者是：","杜牧","蒲松龄","黄宗义","洪吉亮",},
{2,"下列不属于“凡尔纳科幻小说三部曲”的是","《格兰特船长的儿女》","《地心游记》","《海底两万里》","《神秘岛》",},
{2,"不属于冰心作品的是","繁星","背影","春水","往事",},
{2,"《包法利夫人》的作者是","莫泊桑","福楼拜","普希金","斯特拉霍夫",},
{2,"“两句三年得,一吟双泪流”出自谁之口","韩愈","贾岛","柳宗元","贾平凹",},
{2,"《堂吉诃德》的作者：","葡萄牙  塞万提斯","西班牙  塞万提斯","法国    雨果","英国    莎士比亚",},
{2,"《鲁滨逊漂流记》的作者是","莫里哀","丹尼尔.笛福","莫泊桑","歌德",},
{2,"《进化论》的作者是","达芬奇","达尔文","莫泊桑","欧几里德",},
{2,"“冬天已经到来,春天还会远吗？”出自谁的诗句","歌德","雪莱","拜伦","海涅",},
{2,"问君能有几多愁”诗句的下句是：","剪不断,理还乱","恰似一江春水向东流","却道天凉好个秋","才下眉头,却上心头",},
{2,"吴敬梓是哪本名著的作者？","《西游记》","《儒林外史》","《西厢记》","《官场现形记》",},
{2,"李清照（1084—约1151）,号","山东居士","易安居士","历城居士","六一居士",},
{2,"古典主义文学的中心在","英国","法国","意大利","德国",},
{2,"柳三变属于哪一派词人？","豪放派","婉约派","清新派","粗放派",},
{2,"“杜康”在我国最早是：","酒名","人名","地名","器具名",},
{2,"《忆江南》的著者是谁？","李白","白居易","苏轼","孟浩然",},
{2,"《战争与和平》的作者是谁？","阿.托尔斯泰","列夫.托尔斯泰","普希金","莫泊桑",},
{2,"《上尉的女儿》的作者是？","契柯夫","普希金","阿.托尔斯泰","马克.吐温",},
{2,"吴伯箫原名？","西渭","熙成","恒芬","风君",},
{2,"唐宋八大家“之一欧阳修是北宋著名文学家和什么家？","数学家","史学家","天文学家","地理学家",},
{2,"欲穷千里日,更上一层楼。 出自哪个诗人？","王建","王之涣","柳宗元","李商隐",},
{2,"春眠不觉晓的下一句是什么?","处处闻鸟啼","处处闻啼鸟","到处闻鸟啼","到处闻啼鸟",},
{2,"离离原上草,一岁一枯荣。出自哪个诗人？","李白","白居易","王维","李商隐",},
{2,"海上生明月,天涯共此时。 出自哪个诗人？","王维","张九龄","李白","孟浩然",},
{2,"念天地之悠悠,独怆然而涕下。 出自哪个诗人？","李白","陈子昂","白居易","岑参",},
{2,"举杯邀明月,对影成三人。出自哪个诗人？","杜甫","李白","李安石","白居易",},
{2,"“寒蝉凄切”是谁的名句","辛弃疾","柳永","苏轼","李清照",},
{2,"“朝辞白帝彩云间“中的白帝城是在哪个地方？","丰都","奉节","涪陵","万县",},
{2,"我国古代的“书圣”指：","严真卿","王羲之","刘公权","张旭",},
{2,"初唐四杰不包括哪个？","杨炯","杜甫","骆宾王","卢照临",},
{2,"“建安七子”中文学成就最大的是","孔融","王粲","陈琳","刘桢",},
{2,"张生是哪部文学里中的人物？","西游记","西厢记","红楼梦","东游记",},
{2,"“人有悲欢离合,月有阴晴圆缺。”出自：","《长恨歌》","《水调歌头》","《沁园春》","《水龙吟》",},
{2,"《童年》作者是谁？","大卫·赫尔","高尔基","雨果","马克·吐温",},
{2,"《窦娥冤》作者是：","蒲松龄","关汉卿","李汝珍","冯梦龙",},
{2,"“蜀道之难难于上青天！”是谁的诗？","杜甫","李白","白居易","韩愈",},
{2,"<<齐民要术","冶金","农业","天文","地理",},
{2,"《春晓》是谁的作品？","李白","孟浩然","杜甫","白居易",},
{2,"“茅盾”这个笔名最先用于：","《红灯》发表时","《幻灭》发表时","《我们》发表时","《家园》发表时",},
{2,"《浮士德》中浮士德是一个：","骑士","老博士","农民","教师",},
{2,"《东方快车谋杀案》里的侦探是谁？","卡西莫多","波罗","博克","黑豹",},
{2,"下面哪一部作品是普契尼的歌剧作品？","《家园》","《蝴蝶夫人》","《明日》","《蝴蝶兰》",},
{2,"我国诗歌创作最多的朝代是：","唐代","明代","清代","宋代",},
{2,"吴敬梓是哪本名著的作者？","《权史》","《儒林外史》","《杨歌传》","《诗篇》",},
{2,"被授予“人民艺术家”荣誉奖状的是：","茅盾","老舍","鲁迅","杨雄",},
{2,"《史记》中的“列传”有多少篇？","75","70","80","50",},
{2,"《满江红》的作者是谁？","陆游","岳飞","王安石","文天祥",},
{2,"《三国演义》中孙权登为时多少岁","19","18","17","15",},
{2,"<挪威的森林>作者是谁","大江健三郎","村上春树","吉本香蕉","米兰 昆德拉",},
{2,"“曲艺”一词的意思是：","文学体裁","说唱杂技艺术","一种食物","古时花园",},
{2,"名句“爱,是理解的别名”是哪个文豪说的？","普希金","泰戈尔","徐志摩","林觉明",},
{2,"《雪国》是谁的作品？","松下有里","川端康成","藤原先生","山本十六",},
{2,"“煮豆燃豆萁,豆在釜中泣”出自于谁的笔下？","曹超","曹子建","曹丕","曹冲",},
{2,"“春风又绿江南岸,明月何时照我还”是谁的名句？","李白","王安石","杜牧","杜甫",},
{2,"《夜泊秦淮》的作者是：","李白","叶兆言","王维","孟浩然",},
{2,"被誉为“短篇小说之王”的是：","拜伦","莫泊桑","福雷得","堂吉`坷德",},
{2,"孔子说“智者乐水”,后一句是：","善者乐施","仁者乐山","勇者乐搏","明者乐茶",},
{2,"《史记》中的“列传”有多少篇？","69","70","81","108",},
{2,"李清照的父亲是谁?","李非","李格非","李格","李菲",},
{2,"“今人不见古时月,今月曾经照古人”是谁的诗句？","李商隐","李白","王维","张九龄",},
{2,"“红豆生南国”是谁的诗句？","李白","王维","白居易","杜甫",},
{2,"《西厢记》的作者是？","关汉卿","王实甫","马致远","洪升",},
{2,"戏曲是我国传统的戏剧形式,剧中人物分别由生和什么四种角色行当扮演？","季、棱、美","旦、净、丑","荡、屏、子","营、楼、盗",},
{2,"文房四宝是对笔、墨、纸和以下那一项四种文具的统称？","桌子","砚","清水","茶壶",},
{2,"“而今识尽愁滋味,欲说还休。欲说还休,”下一句是什么？","多情却被无情恼","却道：“天凉好个秋！”","天涯何处无芳草","佳期如梦",},
{2,"《本草纲目》是谁写的？","柳宗元","李时珍","华佗","扁鹊",},
{2,"“天网恢恢,疏而不漏”出自：","《孙子兵法》","《老子》","《论语》","《易经》",},
{2,"《边城》是谁的作品？","王蒙","沈从文","郁达夫","老舍",},
{2,"国家兴亡,匹夫有责,谁说的？","顾恺之","顾炎武","黄遵宪","孙中山",},
{2,"无颜见江东父老,谁说的","李清照","项羽","刘邦","刘秀",},
{2,"《茶花女》的作者是","大仲马","小仲马","雨果","马克.吐温",},
{2,"茅盾原名是什么","刘燕冰","沈雁冰","沈盾","茅燕冰",},
{2,"郁秀的新书是哪一本？","《我的留学》","《太阳鸟》","《我的爱情》","《阳光爱情》",},
{2,"《寒夜》是谁写的？","矛盾","巴金","鲁迅","峻青",},
{2,"“大器晚成,大音希声”出自哪里？","〈〈礼记〉〉","〈〈老子〉〉","〈〈孔子〉〉","〈〈庄子〉〉",},
{2,"“庄生晓梦迷蝴蝶,望帝春心托杜鹃”出自何人之手？","王维","李商隐","李白","杜牧",},
{2,"罢黜百家,独尊儒术是哪个皇帝提出来的.","秦始皇","汉武帝","汉高祖","隋文帝",},
{2,"我国文学史上最早的诗歌总集是","史记","诗经","国语","离骚",},
{2,"下列哪个学派不是“百家争鸣”时的学派？","儒家","孟家","法家","墨家",},
{2,"“得道者多助,失道者寡助”出自：","《荀子》","《孟子》","《论语》","《老子》",},
{2,"“不积小流,无以成江海”出自：","《老子》","《荀子》","《论语》","《孟子》",},
{2,"“东边日出西边雨,道是无晴却有晴”出自谁之手？","苏轼","刘禹锡","温庭筠","李商隐",},
{2,"“粉骨碎身浑不怕,要留清白在人间”指的是：","卵石","石灰","盐","玉石",},
{2,"“少壮不努力,老大徒伤悲”出自：","诗经","乐府","尚书","礼",},
{2,"“万紫千红总是春”是谁的句子？","白居易","朱熹","杜甫","杜牧",},
{2,"“一掷赌乾坤”是韩愈对谁的描写？","刘备","刘邦","孙权","朱元璋",},
{2,"雨果是哪国人？","英国","法国","美国","德国",},
{2,"《大堰河》的作者艾青,原名姓？","赵","蒋","姚","周",},
{2,"对作品进行评价、鉴定的跋一般列在书籍的：","前面","后面","中间","题目后",},
{2,"〈百年孤独〉的作者是？","略萨","马尔克斯","泰戈尔","海明威",},
{2,"下面哪个不是白居易的作品？","《秦中吟》","《卖油翁》","《琵琶行》","《长恨歌》",},
{2,"陶渊明是哪个朝代的人？","西晋","东晋","西汉","东汉",},
{2,"“春蚕到死丝方尽,蜡烛成灰泪始干”是谁的诗句？","刘禹锡","李商隐","高适","杜甫",},
{2,"庄子属？","儒家","道家","杂家","法家",},
{2,"《饮冰室全集》作者是？","康有为","梁启超","刘适","谭嗣同",},
{2,"《红楼梦》又名？","《大观园》","《金玉缘》","《女儿国》","《石头城》",},
{2,"号玉溪生的唐代诗人为？","韩愈","李商隐","王昌龄","刘禹锡",},
{2,"少陵野老指？","杜牧","杜甫","孟郊","孟浩然",},
{2,"少陵野老指？","杜牧","杜甫","孟郊","孟浩然",},
{2,"庄子名？","楚","周","原","翟",},
{2,"灵均是谁的号？","韩非","屈原","列子","老子",},
{2,"孟子,名轲,字？","子楚","子舆","子翟","子羽",},
{2,"《沁园春。雪》是谁的作品？","李白","毛泽东","白居易","王安石",},
{2,"猪八戒当年在天宫作什么官？","大将军","天蓬元帅","天王","金刚",},
{2,"《第一次亲密接触》是谁写的？","三毛","蔡志恒","陶晶莹","席娟",},
{2,"太阳照在桑干河上的作者是","茅盾","丁玲","冰心","巴金",},
{2,"三国志的作者是","罗贯中","陈寿","司马光","冯梦龙",},
{2,"下面哪位诗人不是唐朝的？","杜审言","辛弃疾","张志和","贺知章",},
{2,"著名的文学家‘王安石’的字是什么？","君实","介甫","林川先生","临川先生",},
{2,"“多情自古伤离别”是谁写的？","李白","柳永","王维","陆游",},
{2,"《祭妹文》是谁写的？","李白","袁枚","王维","陆游",},
{2,"《红楼梦》共有多少回？","113","120","100","117",},
{2,"不属于茅盾作品的是？","《过年》","《李家埠在战斗》","《子夜》","《一个真正的中国人》",},
{2,"以下不是鲁迅作品的是？","《花边文学》","《一个真正的中国人》","《彷徨》","《故事新编》",},
{2,"汤显祖是哪个朝代的人？","汉","明","宋","元",},
{2,"《紫钗记？的作者是谁？","关汉卿","汤显祖","王实甫","范寅",},
{2,"《风云会》的作者是谁？","关汉卿","罗贯中","孔尚任","范寅",},
{2,"《西都赋》的作者是谁？","张衡","班固","刘向","王勃",},
{2,"班固是哪个朝代的人","清","汉","唐","宋",},
{2,"朱熹是哪个朝代的人？","明","宋","汉","元",},
{2,"《腾王阁序》是谁写的？","王维","王勃","杜甫","韩愈",},
{2,"王勃是哪个朝代的诗人？","明","唐","汉","宋",},
{2,"《东京赋》是谁写的？","刘向","张衡","王维","柳宗元",},
{2,"张衡是哪个朝代的诗人？","清","汉","元","宋",},
{2,"〈〈简爱〉〉作者是：","拜伦","夏洛莘.勃朗特","雪莱","肖伯纳",},
{2,"<背影>一文的作者","鲁迅","朱自清","茅盾","臧克家",},
{2,"同是天涯沦落人,相逢何必曾相识 是出自谁之手？","李白","白居易","杜甫","王安石",},
{2,"下面哪一部是三毛的作品？","孔乙己","哭泣的骆驼","背影","呐喊",},
{2,"哪一部不是鲁迅的作品？","孔乙己","背影","阿Q正传","狂人日记",},
{2,"水浒中说谁是文曲星下凡？","寇准","包拯","杨六郎","司马光",},
{2,"成语无人问津的津字是什么意思？","渡口","道路","小径","兴趣",},
{2,"在新版的《新华字典》正文中第一个字是阿字,最后一个是什么字？","坐","做","座","作",},
{2,"关汉卿的代表作是？","雷电","窦娥冤","史记","清明",},
{2,"“但愿人长久”后一句是什么？","此时无声胜有声","千里共嫦娟","才下眉头,却上心头","别有忧愁暗恨升",},
{2,"不属于莎士比亚四大悲剧的是","麦克白","罗密欧与朱莉叶","哈姆雷特","奥塞罗",},
{2,"天生我才必有用,是谁的诗句","杜甫","李白","王维","杜牧",},
{2,"卜算子,咏梅,是谁的词","辛弃疾","陆游","李清照","柳永",},
{2,"“疑是银河落九天”是谁的诗？","杜埔","李白","白居易","刘仪",},
{2,"唐宋八大家之首是谁?","欧阳修","韩愈","柳宗元","苏轼",},
{2,"世称的“贾生”是谁？","贾雨村","贾宜","贾宝玉","贾岛",},
{2,"《左传》是 什么体？","纪传体","编年体","断代","纪年",},
{2,"以下哪部是郭沫若的作品？","《进学解》","《不读书好求甚解》","《新中国未来记》","《一篇宣言》",},
{2,"以下哪部是叶圣陶的作品？","《不读书好求甚解》","《孤独》","《长生塔》","《两地书》",},
{2,"“秦使此来,不是好意,其币重而甜,殆诱我也。”出自？","《后汉书》","《东周列国志》","《左传》","《元史》",},
{2,"“寡人闻之,千里而一士,是比肩而立；百世而一圣,若随踵而至”出自？","《三国演义》","《战国策》","《资治通鉴》","《三国志》",},
{2,"《长恨歌》的作者是谁？","杜甫","白居易","杜牧","苏轼",},
{2,"“夫战,勇气也,一鼓作气,再而衰,三而竭。彼竭我赢,故克之”出自？","《三国志》","《左传》","《三过演义》","《晋书》",},
{2,"庞士元和庞统是什么关系","哥哥","同一个人","叔叔","没有关系",},
{2,"“朝闻道,夕是可矣”出自哪里？","〈〈礼记〉〉","〈〈伦语〉〉","〈〈老子〉〉","〈〈庄子〉",},
{2,"《阿Q正传》作者是谁？","毛泽东","鲁讯","李白","老舍",},
{2,"《后出师表》是哪个朝代的诗人写的？","三国魏","三国蜀","宋","梁",},
{2,"名句“爱,是理解的别名”是哪个文豪说的？","莎士比亚","泰戈尔","渤朗特","威尔第",},
{2,"普希金所作《鲍里斯·戈都诺夫》的体裁是：","悲剧","历史剧","喜剧","文化剧",},
{2,"京剧《群英会》中“周瑜”的行当是：","花旦","小生","小丑","书生",},
{2,"鹊仙桥的作者是谁？","苏轼","秦观","柳永","李煜",},
{2,"《巴黎圣母院》里敲钟人叫什么名字？","星期五","喀西莫多","维克多","咖喱",},
{2,"《琐忆》的体裁是：","小说","散文","报告文学","古文",},
{2,"杜甫字:","摩诘","子美","太白","子寿",},
{2,"我国第一部词典是?","《说文解字》","《尔雅》","《说字解文》","《永乐大典》",},
{2,"似曾相识燕归来的上句是什么？","东边日出西边雨","无可奈何花落去","双手推开床前月","相逢一笑泯恩仇",},
{2,"“桐花万里丹山路”的下一句是什么？","心有灵犀一点通","雏凤青于老凤声","一日山水一日情","赢的声前身后名",},
{2,"苏洵和苏轼是什么关系？","朋友","父子","兄弟","师生",},
{2,"巴金的最后一部长篇小说是哪部作品？","秋","寒夜","新生","最后的抉择",},
{2,"《窦娥怨》使谁的著作","施耐庵","关汉卿","吴敬梓","吴承恩",},
{2,"《钢铁是怎样炼成的》的作者是","高尔基","奥斯特洛夫斯基","阿 托尔斯泰","肖洛霍夫",},
{2,"《易经》是什么家的经典之一？","学家","儒家","书家","道家",},
{2,"〈孙子兵法〉是谁著的？","孙子","孙武","孙膑","孙权",},
{2,"《出师表》是谁写的？","孙子","诸葛亮","司马迁","李商隐",},
{2,"李白的长相思是什么题材的作品？","五言律诗","七言乐府","七言诗","五言诗",},
{2,"《读孟尝君传》是谁写的","王易","王安石","老舍","王白石",},
{2,"温飞卿指的是谁？","温涛","温庭筠","温周","温样",},
{2,"在《三国演义》中甘宁杀了谁的父亲凌操","凌菱","凌统","凌风","凌仝",},
{2,"《梦游天姥吟留别〉","白居易","李白","杜甫","王维",},
{2,"《巴黎圣母院》里敲钟人叫什么名字？","星期五","喀西莫多","维克多","咖喱",},
{2,"《挪威的森林》是谁的作品","蔡智恒","村上春树","王朔","余秋雨",},
{2,"〈水调歌头.游泳〉写于何年何月？","20241","20607","20576","20210",},
{2,"我国第一部笔记小说集是什么？","《尔雅》","《世说新语》","《修辞学发凡》","《六一诗话》",},
{2,"我国第一部长篇叙事诗是什么？","《别录》","《孔雀东南飞》","《三国演义》","《水浒传》",},
{2,"山穷水尽疑无--什么？","道","路","坡","瀑",},
{2,"《沁园春.长沙》写于何年？","1923","1925","1924","1926",},
{2,"《故乡》这篇小说选自哪个小说？","《彷徨》","《呐喊》","《狂人日记》","《朝花夕拾》",},
{2,"“天下何处无芳草”的上句是什么","二十四桥连月夜","枝上柳棉吹又少","折戟沉沙铁未消","红杏枝头春意闹",},
{2,"朱门酒肉臭,路有冻死骨。作者是----","李白","杜甫","王维","杜牧",},
{2,"长风破浪会有时,直挂云帆济沧海出自谁之手?","王昌龄","李白","杜荀鹤","李贺",},
{2,"野渡无人舟自（）","行","横","停","流",},
{2,"<包法利夫人>的作者是谁?","莫伯桑","福楼拜","莱欣","萨克雷",},
{2,"〈〈水浒传〉〉中水泊梁山在哪个地方？","山西","山东","河南","安徽",},
{2,"“科举”是哪个朝代开始的？","清朝","隋唐","明朝","商朝",},
{2,"“两情若是久长时,又岂在朝朝暮暮”是谁的词？","李白","秦观","杜甫","苏轼",},
{2,"〈毁灭〉的作者是？","福克纳","法捷耶夫","萧伯纳","大仲马",},
{2,"身无彩凤双飞翼,心有灵犀一点通。是谁写的","杜甫","李商隐","柳宗元","白居易",},
{2,"“我住长江头,君住长江尾”是谁的话？","李白","李之仪","白居易","杜甫",},
{2,"孤舟蓑笠翁,独钓寒江雪”是出自于哪位大诗人的手笔？","范仲淹","柳宗元","王安石","欧阳修",},
{2,"下列哪个文学作品是白居易的","送元二使安西","长恨歌","长别歌","七步诗",},
{2,"《诗经》中的精华是","大雅","风","颂","小雅",},
{2,"〈老马〉是谁写的","何其芳","臧克家","光未然","艾青",},
{2,"《雾都孤儿》的作者狄更斯是哪国人","法国","英国","意大利","美国",},
{2,"《断章》这首诗是谁写的","方冰","卞之琳","绿原","北岛",},
{2,"下列作家谁是浪漫派","罗曼.罗兰","雨果","吧尔扎克","狄更斯",},
{2,"《歌德谈话录》的辑录者是","歌德","爱克曼","罗曼`罗兰","雨果",},
{2,"下列哪个不是苏婷的作品","《祖国阿,我亲爱的祖国》","《地球,我的母亲》","《致橡树》","《伦敦的羽毛》",},
{2,"《别了,哥哥》是谁的作品","鲁迅","殷夫","刘半农","白莽",},
{2,"《我的叔叔于勒》节选自谁的什么作品？","左拉,《于勒叔叔》","莫泊桑,《羊脂球》","列宁,《于勒叔叔》","朱熙,《羊脂球》",},
{2,"夏候惇瞎了哪只眼睛？","右眼","左眼","没瞎","两只眼",},
{2,"《阿房宫赋》是谁写的？","杜普","杜牧","李白","白居易",},
{2,"江畔何人初见月,江月何年初照人。出自：","春望","春江花月夜","将进酒","中秋词",},
{2,"观沧海的作者是","刘备","曹操","诸葛亮","周俞",},
{2,"‘唐宋八大家’没有谁？","苏洵","李煜","苏轼","王安石",},
{2,"歌德的成名作是？","〈浮士德〉","〈少年维特之烦恼〉","〈茶花女〉","〈高老头〉",},
{2,"“老死不相往来”这句话出自哪里？","《庄子》","《老子》","《荀子》","《墨子》",},
{2,"“五经”指什么？","《诗》《书》《乐》《易》《春秋》","《诗》《书》《礼》《易》《春秋》","《诗》《书》《礼》《易》《风》","《诗》《书》《礼记》《易》《春秋》",},
{2,"“同是天涯沦落人,相逢何必曾相识！”出自哪里？","《长恨歌》","《琵琶行》","《上阳白发人》","《送杜少府之任蜀州》",},
{2,"剪不断,理还乱,是离愁.别是一番滋味在心头出自:","李颢","李煜","辛弃疾","李清照",},
{2,"《论语》是谁写的？","老子","孔子","庄子","孟子",},
{2,"《三国演义》的作者是谁？","施耐安","罗贯中","吴承恩","曹雪琴",},
{2,"“怒向刀丛觅小诗”是鲁迅写给谁的？","刘和珍","柔石","毕磊","闻一多",},
{2,"《斯巴达克思》的作者拉.乔万尼奥里是？","英国人","意大利人","法国人","其他",},
{2,"作品、人物、和作家及国别（朝代）对应正确的是","《家》—觉新—巴金—中国当代","《雷雨》－鲁大海－曹禹－中国现代","《红与黑》—于连—罗曼·罗兰—法国","《长恨歌》—杨贵妃—杜牧—唐代",},
{2,"作品、作家对应正确的是","《二京赋》—左思","《洛神赋》—曹植","《三都赋》—张衡","《江赋》—庚信",},
{2,"《围城》的作者是谁？","老舍","钱钟书","矛盾","林语堂",},
{2,"江东子弟多才俊,卷土重来未可知.出自谁的作品?","李白","杜牧","杜甫","陆游",},
{2,"但愿人长久的下句是什么?","把酒问青天","千里共蝉娟","床前明月光","一是地上霜",},
{2,"《巴黎圣母院》的作者是哪国人？","英国","法国","美国","鲁国",},
{2,"成语“洛阳纸贵”与下面哪位古人相关？","班固","左思","司马相如","张衡",},
{2,"“黄梅戏”是哪个省的地方戏？","湖南","安徽","湖北","重庆",},
{2,"下面哪一个人是鲁迅的兄弟？","周树人","周作人","周再人","周立人",},
{2,"《儒林外史》的作者是","罗贯中","吴敬梓","蒲松龄","高萼",},
{2,"《人间喜剧》的作者是：","雨果","巴尔扎克","高尔基","莫泊桑",},
{2,"孙犁是哪派作家的代表人物？","山药蛋派","白洋淀派","纯现实派","浪漫派",},
{2,"《沉沦》是哪位作家的作品？","朱自清","郁达夫","废名","闻一多",},
{2,"《故事新编》是谁的作品集？","王蒙","鲁迅","李敖","老舍",},
{2,"《孽海花》是哪个的作品？","李宝嘉","曾朴","吴沃尧","吴敬梓",},
{2,"“王师北定中原日,家祭无忘告乃翁。”出自","文章","示儿","小池","书愤",},
{2,"《雾都孤儿》中男主人公的名字是","奥立奥","奥立弗","奥巴桑","狄更斯",},
{2,"下列哪部是柔石的作品","红烛","为奴隶的母亲","死水","女神",},
{2,"“鸡鸣狗盗”是与谁有关？","春申君与他的食客","孟尝君与他的食客","信陵君与他的食客","鲁国公子重耳",},
{2,"《老残游记》的作者是：","石玉昆","刘鹗","李宝嘉","冯梦龙",},
{2,"何处招魂,香草还生三户地;当年呵壁,湘流应识九歌心这幅对联说的是","贾谊","屈原","诸葛亮","文天祥",},
{2,"《林海雪原》的作者是?","周立波","曲波","少剑波","柳青",},
{2,"《稻草人手记》作者是谁","刘心武","三毛","王蒙","老舍",},
{2,"散文集《写在人生边上》作者是谁？","艾青","钱钟书","三毛","丁玲",},
{2,"“父母在,不远游,游必有方。”这句话是谁说的？","孟子","孔子","老子","庄子",},
{2,"冰心原名什么？","张恨水","谢婉莹","区其珍","刘艳群",},
{2,"女作家丁玲写的一部作品获了斯大林文学奖金,请说出这部作品的名称？","《一个人的诞生》","《太阳照在桑干河上》","《莎菲女士的日记》","《一颗未出膛的枪弹》",},
{2,"“国家兴亡,匹夫有责”是哪位爱国作家的名言？","梁启超","顾炎武","康有为","胡适",},
{2,"高山流水是什么乐曲？","琵琶曲","古琴曲","古筝曲","吉他曲",},
{2,"青梅竹马,两小无猜的典故出自李白哪首诗?","长相思","长干行","兵车行","洛阳女儿行",},
{2,"《七子之歌》的原作者是谁？","聂耳","闻一多","田汉","李宗盛",},
{2,"我以我血荐轩辕","茅盾","鲁迅","周恩来","毛泽东",},
{2,"金锁记的女主人公叫什么名字","曹巧儿","曹七巧","曹六巧","金锁儿",},
{2,"“钩心斗角”出自哪一篇文章？","《大风赋》","《阿房宫赋》","《心经》","《反经》",},
{2,"万家宝的笔名是什么？","老舍","曹禺","矛盾","林语堂",},
{2,"饮冰室主人","冰心","梁启超","谭嗣同","杨万里",},
{2,"“君不见黄河之水天上来,奔流到海不复回”出自","《长相思》","《将进酒》","《蜀道难》","《塞下曲》",},
{2,"“故人西辞黄鹤楼,烟花三月下扬州”是李白送谁时写的诗句？","杜甫","孟浩然","张九龄","王昌龄",},
{2,"《枫桥夜泊》是谁写的？","李白","张继","杜牧","贺知章",},
{2,"“在天愿作比翼鸟,在地愿为连理枝”出自哪首诗？","《桃源行》","《长恨歌》","《塞上曲》","《丽人行》",},
{2,"何当共剪西窗烛,却话巴山夜雨时？是谁写的","李白","李商隐","杜甫","韩愈",},
{2,"商女不知亡国恨,隔江犹唱《后庭花》。是谁写的","白居易","杜牧","李白","杜甫",},
{2,"“江东子弟多才俊,卷土重来未可知。”是谁的诗？","李白","杜牧","王勃","杜甫",},
{2,"亚洲第一位获诺贝尔文学奖的是？","鲁迅","泰戈尔","高尔基","老舍",},
{2,"《围城》中方鸿渐的文凭是怎么得来的？","考试得的","买来的","求人给的","友人送的",},
{2,"李白号什么居士？","东坡","青莲","太白","居正",},
{2,"哈姆雷特是怎么死的?","被叔叔杀死","中了毒剑","老死的","喝了母亲给的毒酒",},
{2,"《梦的解析》是谁的作品","帕森斯","弗罗伊德","尼采","苏格拉底",},
{2,"杨柳青青江水平,闻郎江上唱歌声的作者是谁？","孟浩然","刘禹锡","汪伦","无名氏",},
{2,"二十四桥明月夜,玉人何处教吹箫的作者是谁","杜甫","杜牧","李白","李商隐",},
{2,"暴风雨所诞生的作者是谁?","高尔基","奥斯特洛夫斯基","车尔尼雪夫斯基","奥林契诃夫",},
{2,"“多多益善”成语出自谁之口","曹操","韩信","刘邦","孙武",},
{2,"《乡愁》的作者是谁","艾青","余光中","苏婷","戴望苏",},
{2,"“十年生死两茫茫,不思量,自难忘”是谁的诗句？","陆游","苏轼","李清照","白居易",},
{2,"顽主的作者是谁？","周翔","王朔","赵波","王建德",},
{2,"基督山伯爵真名叫？","安德烈","埃德蒙*唐代斯","维尔福","马克西米连",},
{2,"《梦溪笔谈》的作者?","韩愈","沈括","刘禹锡","方成培",},
{2,"问苍茫大地,谁主沉浮?是谁说的?","周恩来","毛泽东","朱德","刘少奇",},
{2,"中国第一部白话文剧本","《白毛女》","《终身大事》","《小二黑结婚》","《乔厂长上任记》",},
{2,"塞万提斯是何国人？","法国","西班牙","英国","美国",},
{2,"“松下问童子,言师采药去。只在此山中,云深不知处。”是谁写的","贺知章","贾岛","金昌绪","李频",},
{2,"“我劝天公重抖擞,不拘一格降人才”","毛泽东","龚自珍","李白","杜甫",},
{2,"校园歌曲《童年》的词曲作者是：","李泰祥","罗大佑","黄舒骏","李宗盛",},
{2,"《谁是最可爱的人》的作者是","巴金","魏巍","老舍","鲁迅",},
{2,"“汉皇重色思倾国,御宇多年求不得。”选自哪首诗","关山月","长恨歌","长干行","琵琶行",},
{2,"唐诗《游子吟》是谁的作品？","李白","孟郊","白居易","王安石",},
{2,"标志西汉文人五言诗最高成就的是:","<玉台新咏>","<古诗十九首>","<蒹葭>","<野庙碑>",},
{2,"无言独上西楼,月如钩.寂寞梧桐深院锁清秋作者是","李清照","李煜","温庭筠","陆龟蒙",},
{2,"<<柳毅传>>中龙女清柳毅送信进敲什么树？","柑树","橘树","柚子树","黄皮树",},
{2,"被认为“是中国近代文学中最有趣和最用心经营的小说,可能亦是最伟大的一部。”是？","《呐喊》","《围城》","《子夜》","《神雕侠侣》",},
{2,"“待到重阳节,再来就菊花”是谁写的？","李白","孟浩然","杜埔","王维",},
{2,"哪篇文章是爱尔兰作家写的？","堂吉诃德","尤利西斯","萌芽","复活",},
{2,"人称“诗家天子”、“七绝圣手”的诗人是谁？","李白","王昌龄","苏轼","杨万里",},
{2,"茶圣是谁？","何进","陆羽","吴玉良","苏洵",},
{2,"“逢雪宿芙蓉山主人”的作者是？？？","王允","刘长卿","李白","杜甫",},
{2,"《基督山伯爵》中,谁是检察官？","丹格拉尔","维尔福","卡瓦尔康","莫雷尔",},
{2,"四书集注作者是谁？","孔子","朱熹","陆九渊","王国维",},
{2,"羌管悠悠霜满地,人不寐,将军白发征夫泪。出自哪首词？","过秦楼","渔家傲","踏莎行","贺兰山雪",},
{2,"高加林是哪部作品中的人物？","《悲惨世界》","《人生》","《浮躁》","《废都》",},
{2,"<荷马史诗>中,不和女神厄里斯在阿喀琉斯父母举行大婚礼的婚宴上丢下的不和的金苹果是给谁的?","最丑的女人","最美的女人","最善良的女人","最漂亮的女人",},
{2,"“寒雨连江夜入吴,平明送客楚山孤”客是指谁？","白居易","辛渐","李白","杜甫",},
{2,"“将军百战死,壮士十年归。”用了什么修辞方法？","对偶","互文","夸张","对比",},
{2,"“剪不断,理还乱,是离愁,别是一般滋味在心头”的作者是：","李清照","李煜","柳永","秦观",},
{2,"蝉躁林愈静,后面一句呢","鸟鸣山更悠","鸟鸣山更幽","花飘静无声","花飘悠无声",},
{2,"如果说我比多数人看的远一些的话,那是因为我站在巨人的肩上.是谁的话?","莎士比亚","牛顿","鲁迅","爱因斯坦",},
{2,"福尔摩斯的助手华生是在哪一桩案子里结识了他未来的妻子？","血字的研究","四签名","红发会","皮肤变白的军人",},
{2,"名利场的作者是谁 ？","高尔基","萨克雷","卢梭","老舍",},
{2,"希腊神话中谁救了普罗米修斯?","智慧女神-雅典娜","大力神-赫拉克勒斯","太阳神-阿波罗","主神-宙斯",},
{2,"夫天地者,万物之逆旅;光阴者,百代之过客谁的词句","杜甫","李白","白居易","陆游",},
{2,"《范爱农》选至鲁迅先生的那本著作？","《呐喊》","《朝花夕拾》","《彷徨》","《坟》",},
{2,"谁为宋词开创了“无意不可入,无事不可言”的新境界？","辛弃疾","苏轼","欧阳修","王安石",},
{2,"谁的词被称为易安体？","苏轼","李清照","辛弃疾","王安石",},
{2,"“一骑红尘妃子笑,无人知是荔枝来。”出自以下那篇作品。","《咏荔枝膜》","《过华清宫绝句》","《新荔篇》","《圆圆曲》",},
{2,"古代称排行第二的为","伯","仲","叔","季",},
{2,"请选出归有光的号。","林川","震川","樊川","半山",},
{2,"同生死,共患难的朋友叫做________?","竹马之交","刎颈之交","金兰之交","患难之交",},
{2,"《花非花》的作者是","李白","白居易","杜甫","李商隐",},
{2,"不因贵贱的变化而改变,友情深厚和朋友叫做________?","君子交","“车笠交”","忘年交","忘形交",},
{2,"我国第一部有现代意义的综合词典是","辞海","辞源","中华大字典","康熙字典",},
{2,"《苏小小墓》的作者是谁","李白","李贺","白居易","孟浩然",},
{2,"不表示古代授官的是","除","黜","加","拜",},
{2,"下列哪项不是王维的作品？","观猎","送友人","鸟鸣涧","送元二使安西",},
{2,"“不为福先,不为祸始”选自","《礼记》","《庄子》","《史记》","《论语》",},
{2,"情谊契合,亲如兄弟和朋友叫做________?","莫逆之交","金兰之交","竹马之交","患难之交",},
{2,"徐志摩是哪个组织的成员？","创造社","新月派","文学研究会","左联",},
{2,"陈子昂的诗歌主张集中地体现在哪本书里?","<<诗品>>","<<修竹篇序>>","<<感遇诗>>","<<登幽州台歌>>",},
{2,"左思曾写过的<<咏史>>八首,情调高亢,笔力矫健,被谁称为左思风力?","刘勰","钟嵘","朱熹","陆机",},
{2,"谁先在诗歌领域提出诗界革命的?","黄遵宪","梁启超","龚自珍","魏源",},
{2,"‘执子之手,与子偕老’的出处？","《春秋》","《诗经》","《孟子》","《楚辞》",},
{2,"诗句“近水楼台先得月,向阳花木易为春”的作者是？","宋祁","苏麟","柳永","白居易",},
{2,"“得成比目何辞死,愿作鸳鸯不羡仙”一句出自哪里？","《长恨歌》","《长安古意》","《琵琶行》","《过华清宫》",},
{2,"历史剧《关汉卿》的作者是？","田汉","郭沫若","曹愚","洪深",},
{2,"<枫桥夜泊作者是谁?","张籍","张继","朱熹","李钰",},
{2,"为下列绝句选出第一句","一夜征人尽望乡","回乐峰前沙似雪","受降城外月如霜","不知何处吹芦管",},
{2,"下列作品的作者是冰心的是","《白天与黑夜》","《樱花赞》","《温州的踪迹》","《红玛瑙集》",},
{2,"古代罗马著名学者普林尼德巨著是","《历史》","《自然史》","《物理学》","《被缚的普罗米修斯》",},
{2,"下面是霍达的小说有？","《狂人日记》","《穆斯林的葬礼》","《漂亮朋友》","《羊脂球》",},
{2,"古代纪时中七点到九点是什么时候？","日出","食时","平旦","日中",},
{2,"“腓”是阴历每月的那一天？","初七","初三","十六","最后一天",},
{2,"“夕阳无限好,只是近黄昏。 ”是出自李商隐哪首诗？","无题","乐游原","锦瑟","蝉",},
{2,"《笑面人》是谁的作品？","巴尔扎克","雨果","莫里哀","都德",},
{2,"范成大的称号是什么？","白石道人","石湖居士","幽硒居士","柳泉居士",},
{2,"“小说史上的一大变迁”是指什么？","拟话本","话本","章回小说","传奇",},
{2,"“弱冠”指男子多少岁？","十五","二十","十六","十八",},
{2,"鉴湖女侠是指那位？","李清照","秋瑾","朱淑真","萧红",},
{2,"秋风秋雨愁煞人”是谁的诗句？","白居易","秋瑾","岑参","王建",},
{2,"谁架起了唐宋八大家与桐城派的桥梁","韩愈","归有光","辛弃疾","苏轼",},
{2,"郁达夫在哪里遇害","南京","印尼","北京","日本",},
{2,"巴尔扎克的哪部小说被称为“社会百科全书”","《高老头》","《人间喜剧》","《欧也妮.葛朗台》","《农民》",},
{2,"“国家兴亡,匹夫有责”是谁说的？？？","范中淹","顾炎武","庞统","霍去病",},
{2,"欧美三大小说家中没有谁？","莫伯桑","福楼拜","契何夫","欧·亨利",},
{2,"<夸夫追日>属于什么体裁?","传奇","寓言","志人小说","志怪小说",},
{2,"阴历的“晦”是每月的那一天？","初三","最后一天","初一","初七",},
{2,"农历每月的二十九称为什么？","中九","上九","下九","初九",},
{2,"黄昏对应什么时候？","申时","戌时","未时","亥时",},
{2,"“六合”指什么？","东南西北上下","天地东南西北","左右东南西北","东西南北中",},
{2,"古时中地支中酉时对应现在什么时候？","15-17","17-19","13-15","19-21",},
{2,"那两位诗人有“小李杜”之称","李白、杜甫","李商隐、杜牧","李白、杜牧","李商隐、杜甫",},
{2,"《钢铁是怎样炼成的》中保尔的第一个女朋友是谁？","瓦莉亚","冬妮娅","达雅","丽达",},
{2,"下列作品中哪部不是果戈理的？","《钦差大臣》","《强盗》","《死灵魂》","《外套》",},
{2,"西方名著“双城记”的双城指伦敦及哪个城市？","爱丁堡","巴黎","佛罗伦斯","马赛",},
{2,"国际歌的作曲人是谁","欧仁.鲍狄埃","比尔.狄盖特","列宁","马克思",},
{2,"闻一多主张格律诗的“三美”原则不包括哪一条？","音乐的美","韵律的美","绘画的美","建筑的美",},
{2,"鲁迅唯一的表现爱情题材的小说是？","《离婚》","《伤逝》","《祝福》","《风波》",},
{2,"南宋四大家有杨万里,尤袤,陆游和？","柳永","范成大","郑光祖","姜夔",},
{2,"浊酒一杯家万里,燕然未勒归无计。是谁作的？","王维","范仲淹","苏轼","王安石",},
{2,"屈原名什么","原","平","灵均","周",},
{2,"在《第一次的亲密接触》里,男、女主角第一次见面的地点在哪里？","咖啡厅","麦当劳","肯得基","必腾客",},
{2,"“清水出芙蓉,天然去雕饰”是谁的诗句？","杜甫","李白","白居易","杜牧",},
{2,"<<齐民要术>>的作者是谁?","司马迁","贾思勰","曹植","曹丕",},
{2,"捷克作家尤利乌斯·伏契克的代表作是：","《羊脂球》","《绞刑架下的报告》","《母亲》","《最后一课》",},
{2,"桃花扇是谁写的？","冯梦龙","孔尚任","洪升","关汉卿",},
{2,"下列哪位书法家不属于“宋四家”之列？","苏轼","柳公权","米芾","蔡襄",},
{2,"赵树理哪部作品被誉为“解放区文艺的代表之作”？","《小二黑结婚》","《李有才板话》","《李家庄的变迁》","《邪不压正》",},
{2,"《芙蓉楼送辛渐》是谁的作品？","李白","王昌龄","王安石","杜牧",},
{2,"《钦差大臣》作者是谁？","普希金","果戈理","巴金","朱自清",},
{2,"老舍小说的处女作是？","《二马》","《小铃儿》","《老张的哲学》","《赵子曰》",},
{2,"此情可待成追忆,只是当时已惘然。是谁写的","白居易","李商隐","柳宗元","李白",},
{2,"“信言不美,美言不信”出自？","《孟子》","《老子》","《庄子》","《诗经》",},
{2,"“明月松间照,清泉石上流”出自谁之手？","李白","王维","杜甫","孟浩然",},
{2,"“朝来谁染霜林醉,点滴是离人泪。”出自：","《牡丹亭》","《西厢记》","《拜月亭》","《墙头马上》",},
{2,"提倡「八不主義」,以改良舊文學之缺點。","陳獨秀","胡適","聞一多","曹禺",},
{2,"南北朝时期,北朝民歌在语言上的特点是?","清新自然","质朴无华","辞藻华丽","多用叠字",},
{2,"别号是南亭亭长的是谁?","杜牧","李宝嘉","干宝","曾朴",},
{2,"人之初,性本善。性相近,习相远。下一句是什么？","教之道,贵以专。","苟不教,性乃迁。","养不教,父之过。","子不学,非所宜。",},
{2,"下列哪各个人不是短篇小说之王：","欧亨利","莫里哀","契诃夫","莫泊桑",},
{2,"“北斗七星高“的下一句是什么？","将军夜带刀","哥舒夜带刀","单于夜遁逃","大雪满弓刀",},
{2,"“把酒问青天“的前一句是什么？","明月挂山边","明月几时有","明月挂山间","明月上高楼",},
{2,"《诗经》中“风”有15国风,共有多少篇？","200","160","100","99",},
{2,"以五言长城自称的诗人是:","刘禹锡","刘长卿","王维","卢照龄",},
{2,"“酒入愁肠,化作相思泪。”是出自范仲淹的哪首诗？","《渔家傲》","《苏幕遮》","《忆秦娥》","《踏莎行》",},
{2,"“知否？知否？应是绿肥红瘦。”是出自宋代哪位诗人？","范仲淹","李清照","李元膺","李之仪",},
{2,"“醉翁之意不在酒,在乎山水之间也！”是谁说的？","李白","欧阳修","苏轼","谢灵运",},
{2,"下列哪个是“桐城派”的？","顾炎武","姚鼐","章太炎","顾城",},
{2,"刘禹锡<石头城>中所指石头城是今天的","徐州","南京","成都","西安",},
{2,"建安时代文学成就最高的是:","王粲","曹植","陈琳","李贺",},
{2,"穷且益坚,不坠青云之志指的是","李白","嵇康","梁鸿","贾谊",},
{2,"老当益壮,宁移白首之心指的是","嵇康","马援","阮藉","姜尚",},
{2,"小说《猫与鼠》的作者是？","雅.哈谢克","君.格拉斯","赫尔曼.沃克","马特雅.耶夫",},
{2,"《东周列国志》全书共？","一百回","一百零八回","一百二十回","八十八回",},
{2,"下列哪部作品不属于儒勒.凡尔纳的三部曲","《格兰特船长的女儿》","《八十天环游地球》","《神秘岛》","《海底两万里》",},
{2,"<<三国演义>>中单福是谁的化名?","郭嘉","徐庶","孟达","田丰",},
{2,"冯梦龙编写的“三言”不包括下列的哪一部？","《警世通言》","《警世宣言》","《喻世明言》","《醒世恒言》",},
{2,"《群英会蒋干中计》选自：","水浒传","三国演义","红楼梦","西游记",},
{2,"“醉里挑灯看剑” 的词牌","沁园春","破阵子","丑奴儿","蝶恋花",},
{2,"李清照号什么？","六一居士","易安居士","字盘居士","半翁",},
{2,"《伐檀》选自：","水浒传","诗经","三国演义","宋学士文集",},
{2,"“天苍苍,野茫茫,风吹草低见牛羊。”语出：","汉朝乐府诗","北朝乐府诗","唐朝乐府诗","隋朝乐府诗",},
{2,"谢灵运曾称赞谁“才高八斗”：","苏东坡","曹子建","李白","唐寅",},
{2,"“哀兵必胜”语出：","《孙子兵法》","《老子》","《战国策》","《孟德新书》",},
{2,"李白的诗歌继承了哪一作品的风格的风格？","《诗经》","《离骚》","《左传》","〈春秋〉",},
{2,"我国诗歌的现实主义源头是","《离骚》","《诗经》","《史记》","《春秋》",},
{2,"纪伯伦是哪国人","法国","黎巴嫩","英国","挪威",},
{2,"《北京法源寺》是李熬在那里写成的","家中","监狱里","北京","海外",},
{2,"“海内存知已,天涯若比邻”的作者是?","王维","王勃","王安石","唐伯虎",},
{2,"红楼梦十二金钗中没有的是？","迎春","晴雯","惜春","王熙凤",},
{2,"周游列国”原来说的是哪一位古人？","老子","孔子","孟子","庄子",},
{2,"《庄子》是庄周和他的谁以及同一个流派的人所写的一部哲学著作？","老师","学生","朋友","敌人",},
{2,"“制国有常,利民为本。”出自那里？","孙子","史记","春秋","尚书",},
{2,"司马迁所著的什么是我国第一部纪传体通史？","三国演仪","史记","资之通鉴","通史",},
{2,"司马迁是我国古代伟大的什么家和什么家？","史学家和思想家","文学家和史学家","文学家和思想家","革命家和文学家",},
{2,"《物种起源》是谁写的？","摩尔根","达尔文","马克思","歌德",},
{2,"与民同乐者,人必忧其忧。”出自那里？","《左氏春秋》","《魏氏春秋》","《汉书》","《尚书》",},
{2,"唐伯虎多少岁中了下秀才？","7岁","6岁","8岁","9岁",},
{2,"《资治通鉴》是谁著的？","司马迁","司马光","司马焉","司马孚",},
{2,"李时珍写《本草纲木》花了多少年？","28年","27年","29年","30年",},
{2,"“制国有常,利民为本。”出自那里？","孙子","史记","春秋","尚书",},
{2,"窈窕淑女,君子好逑选自？","国风","诗经","离骚","史记",},
{2,"下列那位是婉约派的","苏轼","柳永","王安石","杜牧",},
{2,"《  荒诞残梦 》谁的作品？","李莫野","无极","应天鱼","马荣成",},
{2,"《笑笑江湖》是谁的作品？","东方玉","李凉","诸葛青云","张梦还",},
{2,"“知人者智,自知者明。”是谁写的？","孙子","老子","韩非子","孔子",},
{2,"号四明狂客的是谁？","苏轼","贺知章","白居易","王之涣",},
{2,"“寻寻觅觅,冷冷清清,凄凄惨惨戚戚。”是谁的词？","柳宗元","李清照","李昱","苏辙",},
{2,"大仲马与小仲马是什么关系？","兄弟","父子","叔侄","朋友",},
{2,"陶渊明的字是？","元明","元亮","元渊","元潜",},
{2,"《红楼梦》中葬花的是谁？","薛宝钗","林黛玉","贾宝玉","王熙凤",},
{2,"谁不是当代三大散文家？","刘白羽","老舍","秦牧","杨朔",},
{2,"与《孔雀东南飞》并称诗史双璧的是；","《离骚》","《木兰诗》","《诗经》","《论语》",},
{2,"树欲静而风不止作者是","司马迁","韩婴","刘彻","无名氏",},
{2,"屏山先生指谁？","李亟","李翠山","朱熹","李喆",},
{2,"雨果被称作什么？","喜剧之父","悲剧之父","人文主义之父","文艺复兴之父",},
{2,"《发条鸟年代记》作者是谁？","康端川诚","村上春树","大江健三郎","小山明",},
{2,"下面哪项不是“三言”之一？","《喻世明言》","《告世精言》","《警世通言》","《醒世恒言》",},
{2,"“酒入愁肠,化作相思泪”是谁的诗句？","李白","杜甫","辛弃疾","李清照",},
{2,"下列哪部不是泰戈尔的作品","吉檀迦利","太阳吟","新月集","渡",},
{2,"“卑鄙是卑鄙者的通行证,高尚是高尚者的墓志铭”是谁写的","顾城","北岛","苏婷","海子",},
{2,"泰戈尔凭借那本著作获得诺贝尔文学奖","黑牛集","吉檀迦利","游思集","园丁集",},
{2,"《沪杭车中》是谁写的诗","朱自清","徐志摩","闻一多","艾青",},
{2,"马丁`伊登是谁笔下的人物","海明威","杰克`伦敦","马克`吐温","高尔基",},
{2,"李白因哪首诗而被称道为仙？","《梦游天姥吟留别》","《蜀道难》","《将进酒》","《行路难》",},
{2,"<<红楼梦>>作者曹雪芹的父亲在江南曾任何职?","安察使","江南织造","知俯","清差",},
{2,"“以貌取人,失之子羽”,子羽是谁的弟子？","老子","孔子","孟子","墨子",},
{2,"《书愤》的作者是谁？","李白","陆游","李清照","杜牧",},
{2,"“辛弃疾”字什么？","稼轩","幼安","同甫","式之",},
{2,"“李商隐”字什么？","退之","义山","子安","文海",},
{2,"“既来之,则安之”出自？","〈老子〉","〈论语〉","〈史记〉","〈庄子〉",},
{2,"“我劝天公重抖擞,不拘一格降人才”是谁写的？","王安石","龚自珍","苏轼","朱熹",},
{2,"“不以规矩,不能成方圆”出自？","〈老子〉","〈孟子〉","〈尚书〉","〈论语〉",},
{2,"“人之相知,贵相知心”出自谁之手？","李白","李商隐","杜埔","王维",},
{2,"读书破万卷,下笔如有神是谁的诗?","李白","杜甫","杜牧","李商隐",},
{2,"“人无远虑,必有近忧”出自？","〈礼记〉","〈论语〉","〈尚书〉","〈老子〉",},
{2,"“志当存高远”这句话是谁说的？","王安石","诸葛亮","刘备","孔子",},
{2,"<<红楼梦>>中乐中悲写的是谁?","贾迎春","史湘云","贾惜春","王熙凤",},
{2,"黄沙百战穿金甲,不破楼兰终不还的作者是:","卢照龄","王昌龄","王翰","王之涣",},
{2,"蜀道之难,难于上青天的感叹在<蜀道难>中出现了几次?","2 次","3 次","4 次","1 次",},
{2,"玉容寂寞泪澜干,梨花一枝春带雨写的是谁?","卓文君","杨玉环","王昭君","李清照",},
{2,"《装在套子里的人》的作者是：","欧－享利","契诃夫","巴金","鲁迅",},
{2,"生命诚可贵,爱情价更高。若为自由故,两者皆可抛的作者是","普希金","裴多菲","歌德","海涅",},
{2,"不属于雨果作品的是","悲惨世界","唐璜","巴黎圣母院","欧那尼",},
{2,"“想当年,金戈铁马,气吞万里如虎”是谁的词句？","陆游","辛弃疾","岳飞","李白",},
{2,"《哈利。波特》的作者是谁？","K。J。罗琳","J。K。罗琳","G。K。罗琳","G。K。罗琳",},
{2,"“欲将心事负瑶琴,知音少,弦断有谁听？”是谁的词？","李清照","岳飞","柳永","李煜",},
{2,"“但见泪痕湿,不知心狠谁”的作者是谁","杜甫","李白","白居易","孟浩然",},
{2,"我国第一部学术史是什么？","《明案》","《明儒学案》","《师说》","《马氏文通》",},
{2,"〈就是那一只蟋蟀〉的作者是谁？","余勋坦","余光中","余秋雨","余吉童",},
{1,"《水浒传》是产生于我国什么朝代的？","元末明初","宋朝","清代","明末",},
{1,"《嘉佑集》是谁的父亲的作品","苏东坡","王安石","李白","王勃",},
{1,"〈致橡树〉最早发表于哪本杂志？","〈诗刊〉","〈天地〉","〈读者〉","〈文学〉",},
{1,"《诗经》是我国第一部诗歌总集他总共多少篇？","105篇","40篇","60篇","110篇",},
{1,"《陋室铭》是谁的作品？","刘禹锡","柳宗元","韩愈","陶渊明",},
{1,"《双桅船》是谁的作品？","舒婷","艾青","席慕蓉","汪国真",},
{1,"《有的人》一诗的作者是谁？","臧克家","鲁迅","周树人","老舍",},
{1,"骆宾王字？","子安","少安","子闰","子平",},
{1,"蝉鸣空桑林,八月萧关道。出自？","《塞上曲》","《塞下曲》","《关山月》","长干行》",},
{1,"燕草如碧丝,秦桑低绿枝。出自何人之手？","李白","杜甫","白居易","王维",},
{1,"《涉江》这首诗是谁写的？","屈原","李白","杜甫","苏轼",},
{1,"<西游记>中的火焰山是在哪个地区?","新疆","西藏","云南","蒙古",},
{1,"下面哪一项不是福克纳的斯诺普撕三部曲","《喧哗与骚动》","《村子》","《小镇》","《大宅》",},
{1,"《孙子兵法》的第二篇是什么？","作战篇","始计篇","谋攻篇","军行篇",},
{1,"《琐忆》是为了纪念鲁迅先生多少岁的诞辰而写的？","80","70","60","50",},
{1,"朱自清的《荷塘月色》写于哪一年？","1920","1880","1890","1898",},
{1,"罗曼.罗兰的代表作是","《约翰.克利斯朵夫》","《圣路易》","《哀尔帝》","《理性的胜利》",},
{1,"大宅门的的导演是谁","郭保倡","姜文","张艺某","陈凯歌",},
{1,"中国古代四大美女以下谁是其中的一位？","王昭君","刘贵妃","媚娘","王采何",},
{1,"《白鹤堂集》的作者是？","彭端淑","方苞","苏轼","鲁迅",},
{1,"下列哪个不是<<雷雨>>中的人物:","仇虎","周朴园","鲁侍萍","鲁大海",},
{1,"法国浪漫主义的文学杰作是","巴黎圣母院","死魂灵","悲惨世界","人间喜剧",},
{1,"草木有本心,何求美人折？是谁写的","张九龄","李白","杜甫","孟浩然",},
{1,"《尼罗河上的惨案》是谁的作品？","阿加莎","材可夫斯机","弗·萨冈","乔治·迈肯",},
{1,"院试前未中者叫什么？","童生","秀才","举人","解元",},
{1,"李白的“蓬莱文章建安骨,中间小谢又清发”中的“小谢”指的是谁？","谢眺","冬神","扑路士","林觉明",},
{1,"试从造字角度选出不同类的一项","天","休","祭","分",},
{1,"希腊神话中最先把马赐给人间的是：","波赛顿","威尔第","莫奈","泰戈尔",},
{1,"以下哪首诗是辛弃疾写的？","《美芹十论》","《西政丛书叙》","《洞仙歌》","《草书歌行》",},
{1,"以下哪首诗是张衡写的？","《南都赋》","《范增记》","《洞仙歌》","《上邵学书》",},
{1,"以下哪部不是关汉卿的作品？","《陈母教子》","《草书歌行》","《朝享太庙赋》","《进学解》",},
{1,"我国第一部字典是什么","说文解字","康熙字典","新华字典","乾隆字典",},
{1,"“精诚所至,金石为开”出自？","《后汉书》","《汉书》","《史记》","《三国志》",},
{1,"“黑夜给了我一双黑眼睛,我却用她来寻找光明！”是谁写的？","顾城","丁玲","巴金","鲁迅",},
{1,"〈登金陵凤凰台〉的作者是？","李白","王唯","杜牧","王之涣",},
{1,"王国维字什么？","静安","卓如","抖飞","任公",},
{1,"泰戈尔是在哪一年获得诺贝尔奖的","1913","1914","1915","1916",},
{1,"“人学始知道,不学非自然”出自哪里？","〈〈劝学〉〉","〈〈礼记〉〉","〈〈老子〉〉","〈〈论语〉〉",},
{1,"纪昀自号？","石云","文达","春帆","晓风",},
{1,"吴沃字什么？","小允","允","伯元","太炎",},
{1,"诗经分哪三部分？","风 雅 颂","人 地 土","天 木 家","歌 词 曲",},
{1,"花自飘零水自流,一种相思俩处闲愁。的作者是？","李清照","李白","白居易","王维",},
{1,"三国演义中姜维是怎么死的","自杀","被乱军所杀","被钟会所杀","病死",},
{1,"《傲慢与偏见》中达西最欣赏伊丽莎白的是","眼睛","鼻子","嘴","耳朵",},
{1,"《长恨歌》写于哪歌朝代？","唐","宋","明","汉",},
{1,"以下哪部作品不是鲁迅所写的？","《中国人民的心》","《华盖集》","《准风月谈》","《集外集》",},
{1,"以下哪部作品不是苏轼所写的？","《上皇帝书》","《胜相院藏经记》","《赠潘谷》","《洞仙歌》",},
{1,"“彼一时,此一时也。五百年必有王者兴,其间必有名世者。”出自？","《孟子》","《庄子》","《孙子》","《荀子》",},
{1,"“宾至如归,无宁灾患,不畏盗寇,而不患燥湿”出自？","《左传》","《东周列国志》","《后汉书》","《淮南子》",},
{1,"“弃不急之务,以修功业之基,其于名行,岂不善哉”出自？","《三国志》","《三国演义》","《水浒传》","《封神演义》",},
{1,"“今只因其粮道,使城内百姓不能接济,则此城不攻自破矣”出自？","《封神演义》","《水浒传》","《三国志》","《东周列国志》",},
{1,"以下哪部作品不是巴金之作？","《山野掇拾》","《生之忏悔》","《长生塔》","《旅途杂记》",},
{1,"《诗经》一共有多少篇？","305","300","301","304",},
{1,"乐府是什么时候的机构？","秦汉","唐宋","汉唐","西晋",},
{1,"“十年生死两茫茫”出自谁的词？","苏轼","李清照","苏辙","辛弃疾",},
{1,"《笑面人》的作者是谁？","雨果","契克夫","大仲马","小仲马",},
{1,"“任尔弱水三千,我只取一瓢饮”出自哪里？","《红楼梦》","《水浒传》","《西厢记》","《西游记》",},
{1,"“日晚倦梳头”出自谁的词？","李清照","李白","辛弃疾","柳永",},
{1,"鲁迅的散文诗集是","野草","朝花夕拾","彷徨","集外集",},
{1,"有“俄国文学始祖”之称的是？","普希金","高尔基","契诃夫","列夫.托尔斯泰",},
{1,"《巴黎圣母院》中的敲钟人是谁？","卡西莫多","罗切斯特","圣约翰","恰达耶夫",},
{1,"不属于“元曲四大家”的是？","王实浦","郑光祖","马志远","白朴",},
{1,"骆宾王多少岁写出了咏鹅诗","7","5","6","8",},
{1,"“国色朝酣酒,天香夜染衣”指的是","牡丹","玫瑰","桂花","杜鹃",},
{1,"马致远的代表作是什么？","汉宫秋","墙头马上","西厢记","单刀会",},
{1,"元四大戏曲家中,下面哪个不属于其中？","王实埔","马致远","白朴","郑光祖",},
{1,"高衙内是高俅的？","螟蛉子","亲儿子","大哥","弟弟",},
{1,"苏轼字？号？","子瞻 东坡居士","子由 东坡居士","字瞻 青莲居士","字瞻 东坡居士",},
{1,"唐代大诗人杜审言是杜甫的：","爷爷","爸爸","哥哥","儿子",},
{1,"下面哪个不是唐代诗人？","陆游","李白","杜甫","白居易",},
{1,"青青子襟,悠悠我心。是谁的诗句？","曹操","曹植","诸葛亮","刘备",},
{1,"《别了,司徒雷登〉是谁写的","毛泽东","鲁迅","老舍","邓小平",},
{1,"戏剧〈屈原〉的作者是：","郭沫若","老舍","矛盾","巴金",},
{1,"柳泉居士是指谁？","蒲松龄","曹雪芹","李清照","李格非",},
{1,"《可叹》是谁写的？","杜甫","王安石","刘向","范仲淹",},
{1,"“百举百全,而功名可立”出自哪里？","《三国志》","《吕氏春秋》","《战国策》","《后汉书》",},
{1,"“开岁发春兮,百卉含英”出自哪里？","《后汉书》","《三国志》","《红楼梦》","《西厢记》",},
{1,"《一个真正的中国人》的作者是谁？","矛盾","鲁迅","朱自清","郭沫若",},
{1,"把“饱食终日,无所用心,难矣哉”出自哪里？","《论语》","《孟子》","《老子》","《庄子》",},
{1,"“千世而一出,是比肩随踵而生也”出自哪里？","《韩非子》","《论语》","《孟子》","《九歌》",},
{1,"欧阳修名号","六一居士","香山居士","柳泉居士","青莲居士",},
{1,"我要为众人,营私以为羞。谁的诗句","陈毅","朱德","毛泽东","周恩来",},
{1,"“我寄愁心与明月,随风直到夜浪郎西”是谁写的？","李白","白居易","王维","陆游",},
{1,"《史记》总共有多少篇？","130篇","120篇","110篇","140篇",},
{1,"《芙蕖》的作者是：","李渔","吴均","苏轼","王安石",},
{1,"“风住尘香花已尽,日晚倦梳头”出自？","武陵春","醉花阴","怨王孙","鹧鸪天",},
{1,"诗人李白是哪里人？","四川","湖南","湖北","广西",},
{1,"《福尔莫斯探案全集〉的作者柯南道尔出生于哪年？","1859","1857","1853","1861",},
{1,"《复活》是俄国伟大作家———的作品","托尔斯泰","马克斯","吧尔扎克","斯大林",},
{1,"《好了歌》中的“君生日日说恩情,君死又随人去了”对应了","姣妻","儿孙","金银","功名",},
{1,"李清照是哪里人？","山东济南","浙江杭州","北京","天津",},
{1,"马上相逢无纸笔,凭君传语报平安。是谁写的？","岑参","曹邺","常建","贾岛",},
{1,"《致橡树》是谁的作品？","舒婷","戴望舒","徐志摩","艾青",},
{1,"韩寒的《三重门》谁为他作序？","曹文轩","钱钟书","王蒙","贾平凹",},
{1,"“黑夜给了我夜的眼睛,我却用它来寻找光明”是谁说的？","顾城","鲁迅","卫慧","艾青",},
{1,"被称为短篇小说大师的是?","莫泊桑","高尔基","契河夫","老舍",},
{1,"“却道天凉好个秋”谁写的？","辛弃疾","刘禹锡","白居易","李商隐",},
{1,"“无丝竹之乱耳,无案牍之劳形”是谁写的？","刘禹锡","白居易","辛弃疾","柳宗元",},
{1,"下列哪个不属于三纲？","父母纲","君臣纲","父子纲","夫妻纲",},
{1,"唐代被称为“七绝之圣”的是","王昌龄","白居易","王之涣","杜牧",},
{1,"曹雪芹以后续写〈红楼梦〉的是？","高锷","高求","蔡锷","吴敬梓",},
{1,"《红楼梦》原名？","〈石头记〉","〈红楼缘〉","〈金陵十二钗〉","贾林缘",},
{1,"《铸剑》这篇小说是谁写的？","鲁迅","巴金","矛盾","王蒙",},
{1,"古代的五经是指？","诗、书、礼、易、春秋","经、书、礼、易、春秋","书、礼、易、春秋、史","子、集、书、礼、易",},
{1,"作家丁玲原来姓什么","蒋","丁","王","赵",},
{1,"“古来清史谁不见,今日功名胜古人”此句诗的作者是：","岑参","杜甫","高适","虞世南",},
{1,"下面哪个不是屈原的作品?","《楚辞》","《九歌》","《天问》","《九章》",},
{1,"我国第一部纪传体断代史为?","《汉书》","《史记》","《资治通鉴》","《尚书》",},
{1,"“味摩洁诗,诗中有画,观摩洁之画,画中有诗”是谁赞王维之语？","苏轼","李白","李清照","杜甫",},
{1,"《庄子》共几篇？","33","30","31","32",},
{1,"《论语》是记录谁的言行的语录体专集？","孔子和他的弟子","孔子","孟子","孔子和孟子",},
{1,"鲁迅的《且介亭集》,是根据什么命名的？","地名","人名","心血来潮","事件",},
{1,"《儒林外史》共几回？","55","50","60","52",},
{1,"英国和欧洲小说之父是？","笛福","狄更斯","雪莱","莎士比亚",},
{1,"下面哪一项不属“六艺”？","雅","射","书","御",},
{1,"“江山如画里,人物更风流”是谁的诗句？","元好问","朱熹","陆游","刘禹锡",},
{1,"“黄金无足色,白璧有微瑕”是谁的诗句？","戴复古","龚自珍","于谦","王国维",},
{1,"“小楼一夜听春雨”是谁的诗句？","陆游","李白","杜牧","苏轼",},
{1,"“已所不欲,勿施于人”出自？","《论语》","《老子》","《尚书》","《孟子》",},
{1,"“逝者如斯夫”的下一句是：？","不舍昼夜","子在川上曰","不分昼夜","子上岸上曰",},
{1,"“东边日出西边雨,道是无晴却有晴”是谁的诗句？","刘禹锡","李商隐","王维","杜牧",},
{1,"“由俭入奢易,由奢入俭难”是谁说的？","司马光","司马迁","韩愈","贾岛",},
{1,"“亡羊补牢”这个成语出自？","《战国策》","《论语》","《史记》","《荀子》",},
{1,"墨子是春秋时期哪国人？","鲁国人","齐国人","楚国人","宋国人",},
{1,"《淮南子》的作者是？","刘安","王充","贾谊","刘向",},
{1,"“人非圣贤,孰能无过”出自？","《左传》","《孟子》","《论语》","《尚书》",},
{1,"“天网恢恢,疏而不漏”出自？","《老子》","《韩非子》","《墨子》","《荀子》",},
{1,"“前事不忘,后事之师”出自？","《战国策》","《孙子兵法》","《尚书》","《左传》",},
{1,"“白日放歌须纵酒”是谁的诗句？","杜甫","李白","白居易","李商隐",},
{1,"曹丕,字？","子恒","子建","子明","子长",},
{1,"曹植为曹操的第几个儿子？","3","2","4","5",},
{1,"易卜生是哪国的剧作家","挪威","美国","中国","日本",},
{1,"似曾相识燕归来”的上一句是：","无可奈何花落去","东边日出西边雨","双手推开床前月","相逢一笑泯恩仇",},
{1,"夜阑卧听风吹雨,铁马冰河入梦来是谁的诗?","陆游","李白","白居易","杜甫",},
{1,"宋代的学象生同现代的","口技","相声","舞狮子","杂技",},
{1,"以下哪个不是杜牧的作品？","樊南文集","过华清宫绝句","樊川文集","阿房宫赋",},
{1,"朱熹是南宋著名的什么家？","教育家和哲学家","军事家和哲学家","教育家和思想家","政治家和哲学家",},
{1,"田汉是哪里人？","湖南","浙江","福建","江苏",},
{1,"茅盾何时完成他的代表作《子夜》？","1932","1930","1931","1933",},
{1,"下面哪部不是选自鲁迅的《呐喊》？","《伤逝》","《孔乙已》","《阿Q正传》","《药》",},
{1,"《阿Q正传》何时发表？","1921","1920","1922","1923",},
{1,"独立小桥风满袖,平林新月人归后是谁写的","欧阳修","陆游","秦观","苏轼",},
{1,"“洛阳亲友如相问,一片冰心在玉壶。”出自于谁的笔下？","王昌龄","李商隐","房玄龄","张九龄",},
{1,"柔石为“左联五烈士”之一,原名为？","赵平夏","赵平春","赵平冬","赵平秋",},
{1,"《静静的顿河》作者是？","肖洛霍夫","列夫.托尔斯泰","马雅可夫斯基","法捷耶夫",},
{1,"对酒当歌,人生几何。（词名是？）","西江月","水调歌头","敦煌曲","从军行",},
{1,"下面哪部不是杜甫的“三别”？","《离家别》","《新婚别》","《无家别》","《垂老别》",},
{1,"下面哪部不是歌德的作品？","《德国-冬天的一个童话》","《浮士德》","《普罗米修斯》","《少年维特的烦恼》",},
{1,"“夕阳无限好,只是近黄昏”的诗名《乐游原》今为何处？","陕西","北京","内蒙古","青海",},
{1,"“忍把浮名,换了浅斟低唱”是谁的作品？","柳永","欧阳修","苏轼","辛弃疾",},
{1,"“色不迷人人自迷,情人眼里出西施”是谁的句子？","黄增","老子","韦应物","孔子",},
{1,"“天若有情天亦老”最早出自谁手？","李贺","李白","苏轼","毛泽东",},
{1,"“今朝有酒今朝醉,明日愁来明日愁”出自谁手？","罗隐","李白","杜甫","白居易",},
{1,"“知人知面不知心”出自何书？","红楼梦","水浒传","西游记","三国演义",},
{1,"“此处不留人,自有留人处”出自谁手？","陈后主","李后主","白居易","李白",},
{1,"“一失足成千古恨,再回首已百年身”出自谁手？","魏子安","温庭筠","王昌龄","韩愈",},
{1,"“长江后浪推前浪,一代新人换旧人”出自：","增广贤文","事林广记","警世通言","醒事恒言",},
{1,"“一日不见,如三秋兮”出自：","诗经.王风","诗经.国风","诗经.卫风","诗经.邺风",},
{1,"“未知生,焉知死”出自：","《论语》","《老子》","《孟子》","《庄子》",},
{1,"“知者不言,言者不知”出自：","《老子》","《庄子》","《论语》","《孟子》",},
{1,"“吾生也有涯,而知也无涯”出自：","《庄子》","《老子》","《论语》","《荀子》",},
{1,"“夜郎自大”中的“夜郎”是：","地名","人名","动物名","植物名",},
{1,"《乌衣巷》是谁写的？","刘禹锡","白居易","杜牧","李商隐",},
{1,"《理想国》是谁写的？","柏拉图","苏格拉底","亚里士多德","卢梭",},
{1,"下面哪个不是建安七子之中的人","曹植","孔融","徐干","刘桢",},
{1,"<<孔雀东南飞>>的作者是谁?","无名氏","班固","司马迁","屈原",},
{1,"〈〈镜花缘〉〉是谁所作？","李汝珍","洪亮吉","龚自珍","方苞",},
{1,"“人之相知,贵相知心”是谁写的？","李商隐","李白","杜埔","王维",},
{1,"“时时只见龙蛇走,左盘右蹙如惊电”出自李白的哪首诗？","《草书歌行》","《山中问答》","《南都赋》","《范增记》",},
{1,"阿Q姓什么","不知道","赵","未","吴",},
{1,"“解名尽处是孙山,余人更在孙山外”是谁说的","孙山","元稹","杜牧","李合章",},
{1,"“象山先生”指的是","陆九渊","程颢","骆宾王","杨炯",},
{1,"《南华经》的作者是","庄子","孟子","孔子","老子",},
{1,"哪部书被称为《春秋内传》","左传","公羊传","谷梁传","史记",},
{1,"韩寒的哪篇文章在新概念作文比赛中获得一等奖？","《杯中窥人》","《第三个人》","《杯中窥人》","《傻子》",},
{1,"以下哪部作品不是曹禺所作","《子夜》","《雷雨》","《日出》","《原野》",},
{1,"《钢铁是怎样炼成的》中给保尔毛瑟枪的是谁","朱赫来","谢廖沙","达雅","丽达",},
{1,"“沁园春”是什么文体？","词牌","小说","散文","剧本",},
{1,"《尼罗河上的惨案》的作者是谁？","阿加莎.克里斯蒂","霍普斯金","阿加莎.特丽","卡夫卡",},
{1,"《隆中对》选自什么？","三国志","诸葛亮集","三国演义","水经注",},
{1,"以下哪一个不是唐宋八大家","柳永","苏轼","王安石","欧阳修",},
{1,"《稻草人手记》是谁写的？","三毛","老舍","巴金","琼瑶",},
{1,"春词是谁写的？","刘禹锡","李白","孟浩然","李商隐",},
{1,"人事有代谢,往来成古今是谁的作品","孟浩然","贺之章","辛弃疾","欧阳修",},
{1,"杨柳青青江水平 的下一句的下一句是：","东边日头西边雨","数株残柳不见春","闻郎江上踏歌声","夜长争得薄情知",},
{1,"以下的唐诗中哪一首是李商隐的作品","夜雨寄北","泊秦淮","陇西行","南乡子",},
{1,"秋风吹不尽,总是玉关情的作者是谁？","李白","李商隐","杜甫","杜牧",},
{1,"绝代有佳人,幽居在谷中的作者是谁","杜甫","杜牧","柳宗元","柳永",},
{1,"“才高八斗”指谁？","曹植","曹操","曹冲","曹仁",},
{1,"《天问》是谁的作品？","屈原","李白","杜甫","杜牧",},
{1,"“女娲有体,孰制匠之？”出自：","《天问》","《问天》","《天地》","《天地问》",},
{1,"小说《围巾》的作者是：","蔡智恒","琼瑶","席娟","三毛",},
{1,"长娥应悔偷灵药,碧海青天夜夜心,是谁的诗句~？","李商隐","李白","李清照","李令",},
{1,"《平凡的世界》是谁写的？","路遥","鲁迅","巴金","老舍",},
{1,"《红楼梦》中的红楼梦十二曲中的“喜冤家”写的是谁？","贾迎春","王熙凤","林黛玉","史湘云",},
{1,"明朝科举多少年考一次？","3","4","5","2",},
{1,"燕歌行是整个唐代边塞诗中的杰作,是哪位诗人所作？","高适","李百","王维","杜甫",},
{1,"前不见古人,后不见来者是谁的作品","陈子昂","白居易","刘禹锡","刘长卿",},
{1,"哪部不属我国十大古典悲剧？","《中山狼》","《精忠旗》","《清忠谱》","《雷锋塔》",},
{1,"哪部不属我国十大古典喜剧？","《桃花扇》","《中山狼》","《风筝误》","《墙头马上》",},
{1,"我国十大古典悲剧之一的《雷锋塔》是哪个朝代的作品？","清朝","宋朝","元朝","明朝",},
{1,"谁不属于我国北宋文坛四大家？","秦观","欧阳修","苏轼","王安石",},
{1,"下列谁不是“中兴四大诗人”？","朱熹","陆游","范成大","杨万里",},
{1,"谁是“四大世界文化名人”之一？","屈原","李白","孔子","孟子",},
{1,"“月上柳梢头,人约黄昏后”是谁的诗句？","朱淑珍","辛弃疾","杨万里","范仲淹",},
{1,"第一部有声电影是：","唐璜","快乐时光","米老鼠和唐老鸭","乱世佳人",},
{1,"大文豪鲁迅在哪一年逝世？","1936","1937","1940","1929",},
{1,"横眉冷对千夫指,俯首甘为孺子牛。出自？","《自嘲》","《无题》","《自题小像》","《华盖集,忽然想起》",},
{1,"《诗经》中有六篇有目无辞的诗,称为：","笙诗","国风","骚词","民风",},
{1,"西汉的《方言》一书,是我国研究方言的重要资料,其作者是：","杨雄","柳安","李伯伦","张力",},
{1,"“逆境是达到真理的一条通道”是谁说的？","拜伦","贝多芬","培根","马克思",},
{1,"“不唤人知不己知,唤不知人也”是谁自谏的格言？","孔子","孟子","老子","庄子",},
{1,"“物以类聚,人以群分”出自：","易经","源氏物语","诗经","国风",},
{1,"被誉为日本的《红楼梦》的书是：","源氏物语","樱花舞","凤还巢","热风",},
{1,"“洛阳纸贵”指的作品是下面哪一部？","《三都赋》","《洛阳赋》","《洛阳小记》","《故都》",},
{1,"月是故乡明的上一句是什么？","路从今夜白","茶是故乡浓","淡淡夜花香","酒是故乡香",},
{1,"<老子>分哪两个部分","道经 德经","上下两卷","离经叛道","天经 地义",},
{1,"“记人之善,忘人之过”出自？","《三国志》","《论语》","《礼记》","《诗经》",},
{1,"唐代开国皇帝李渊。字是什么？","叔德","伯德","公谨","静乐",},
{1,"《永乐大典》出现在：","明朝","清朝","唐朝","宋朝",},
{1,"在〈三国演义〉第18回中谁向曹操分析了十战胜袁绍的理由？","郭嘉","程昱","刘晔","满宠",},
{1,"吾心中有一少年中国在”是谁说的","谭嗣同","毛泽东","周恩来","孙中山",},
{1,"下面哪一个不是孔子别称","孔方兄","孔老二","孔夫子","孔圣人",},
{1,"《哈克贝里·费恩历险记》是谁写的？","马克·吐温","小仲马","哈代","格林",},
{1,"“会当凌绝顶,一览众山小”写的是那座山？","东岳","南岳","西岳","北岳",},
{1,"“谦虚是对不完善和有缺点的默认”出自谁的论点？","博克","普鲁斯","阿基米德","牛顿",},
{1,"《腾王阁》是谁的作品？","王勃","李白","杜甫","白居易",},
{1,"《送杜少府之任蜀川》是谁的作品？","王勃","李白","杜甫","白居易",},
{1,"“许我一个未来吧！”是徐志摩对谁说的？","林薇茵","陆小曼","张幼凝","林诗茵",},
{1,"《凉州词》是谁的作品？","王之涣","李白","杜甫","白居易",},
{1,"《咏柳》是谁的作品？","贺知章","李白","杜甫","白居易",},
{1,"东晋时候著名诗人陶潜号什么?","渊明","明渊","天明","天渊",},
{1,"“几处早莺争暖树,谁家新燕啄春泥。”是谁的诗句？","白居易","杜甫","王维","贺知章",},
{1,"“一个汉字无横无竖,共十笔,皇帝见到他,也要下跪拜见”打一个汉字？","爹","妈","奶","我",},
{1,"川端康成是怎么死的","自杀","被杀","车祸","老死",},
{1,"龚自珍是哪里人？","浙江","江苏","湖北","上海",},
{1,"“需关西大汉手执铁板”高唱的是谁的作品？","苏轼","辛弃疾","陈亮","岳飞",},
{1,"《李义山诗集》是谁的诗集？","李商隐","李渔","李贺","李龟年",},
{1,"“天涯何处无芳草”的上一句","枝上柳绵吹又少","天凉好个秋","多情却被无情恼","笑溅不闻声渐悄",},
{1,"墨子的世界观是什么主义的？","唯心主义","唯物主义和唯心主义","唯物主义","唯权主义",},
{1,"法布尔是哪个国家的人？","法国","美国","英国","中国",},
{1,"我国谁写了第一部断代史书","班固","司马迁","司马光","王蒙",},
{1,"《阿房宫赋》的作者是谁？","杜牧","杜甫","王勃","白居易",},
{1,"“人生得意须尽欢,莫使金樽空对月”是出自？","《将进酒》","《燕歌行》","《长恨歌》","《饮酒并序》",},
{1,"《泊船瓜洲》的作者是谁？","王安石","苏轼","杜甫","黄庭坚",},
{1,"初唐四杰不包括谁？","王维","王勃","杨炯","卢照邻",},
{1,"“山无棱,天地合,乃敢与君绝”出自？","《汉乐府》","琼瑶之手","北朝乐府民歌","南朝乐府民歌",},
{1,"滚滚长江东逝水···”这首词的词牌是？","临江仙","山坡羊","鹤冲天","蝶恋花",},
{1,"＂争渡,争渡,惊起一滩鸥鹭＂是哪个人的作品？","李清照","辛弃疾","白居易","杜甫",},
{1,"哪一部作品不是沙汀著名的长篇小说“三记”之一？","《金锁记》","《淘金记》","《困兽记》","《还乡记》",},
{1,"“一门三父子,都是大文豪。诗赋传千古,蛾眉共比高。”三父子是指","苏洵,苏轼,苏辙","曹操,曹植,曹丕","班彪,班固,班超","杜甫,杜牧,杜旬鹤",},
{1,"“月晕而风,础润而雨”出自谁的手？","苏洵","孟子","老子","王勃",},
{1,"多情自古伤离别,更那堪冷落清秋节出自","雨霖玲","虞美人","相见欢","踏莎行",},
{1,"“柳色看犹浅,泉声渐觉多”是谁的诗句？","张籍","罗隐","王建","杜甫",},
{1,"“何处招魂,香草还生三户地：当年呵壁,湘流应识九歌心”是说","屈原","贾宜","诸葛亮","文天祥",},
{1,"〈挪威的森林〉是谁的作品","村上春树","痞子蔡","金庸","张抗抗",},
{1,"王安石（1021—1086）,字:","介甫","半山","临川","永叔",},
{1,"办得黄金须买笑。爱惜芳时。莫待无花空折枝。出自谁:","欧阳修","范仲淹","李清照","王安石",},
{1,"太史公牛马走再拜言”中的“牛马走”是什么意思？","自谦之辞","问侯之辞","驱车前往","单指动物",},
{1,"下面不是古代学府的是？","国监","太学","庠","序",},
{1,"欧阳修（1007—1072）,字永叔,号醉翁,晚号:","六一居士","庐陵","思量","文忠",},
{1,"小说《理水》是谁的作品？","鲁迅","赵树理","夏衍","张天翼",},
{1,"我善养吾浩然之气”是谁说的？","韩非子","孟子","庄子","孔子",},
{1,"古诗的体制称为“风雅颂”,其中“雅”指：","地方民歌","宗庙乐歌","王朝正声","诗人作的诗",},
{1,"我国古代人物形象最多的小说是：","《红楼梦》","《水浒传》","《三国演义》","《西厢记》",},
{1,"<春思>这首诗是谁写的?","李白","杜甫","白居易","杜牧",},
{1,"屈原是在什么情况下写《离骚》？","放逐","旅游","坐牢","回家",},
{1,"东晋大诗人陶渊明被称为五柳先生是因为他：","家门前有5株柳树","名柳又排行老五","家乡在五柳县","别人随意起的别名",},
{1,"以下哪部作品不属于契柯夫的作品","苦难的历程","变色龙","装在套子里的人","万尼亚舅舅",},
{1,"欧洲第一部批判现实主义的文学作品是","红与黑","飘","变色龙","战争也和平",},
{1,"下列不是莫里哀作品的是：","《唐璜》","《悭吝人》","《堂璜》","《伪君子》",},
{1,"法国第一部存在主义文学杰作是","萨特的《恶心》","加缪的《局外人》","西蒙娜·德·波伏瓦的《女宾》","萨特的《存在与虚无》",},
{1,"以下哪部作品不属于列夫.托尔斯泰","上尉的女儿","战争与和平","安娜.卡列尼娜","复活",},
{1,"赞誉《史记》为“史家之绝唱,无韵之离骚”的是","鲁迅","老舍","巴金","茅盾",},
{1,"曾被人赞誉为“亚洲第一社评家”是那一位","查良镛","古龙","尼采","高尔基",},
{1,"诗句“绝代有佳人,幽居在空谷”出自哪位诗人之手？","杜甫","李白","白居易","李商隐",},
{1,"“但使龙城飞将在,不教胡马度阴山”是描写哪位名将的？","李广","霍去病","卫青","狄青",},
{1,"《糖》的作者是谁？","棉棉","卫慧","虹影","殷慧芬",},
{1,"被称为“喜剧之父”的古希腊喜剧作家是","阿里斯托芬","索福克勒斯","欧里庇得斯","普罗米修斯",},
{1,"罗马神话中“维纳斯”是","爱与美神","智慧女神","天神","月亮神",},
{1,"被称为“英国诗歌之父”的是","乔叟","莫尔","斯宾塞","莎士比亚",},
{1,"下列不属于朱光潜“修养三书”的是","《谈文学》","《给青年的十二封信》","《谈美》","《谈修养》",},
{1,"英国第一部现实主义长篇小说是","《鲁滨逊漂流记》","《格列弗游记》","《辛格尔顿船长》","《摩尔·弗兰德斯》",},
{1,"陶渊明字？","元亮","清亮","明亮","吉亮",},
{1,"诗人艾青的《大堰河》中的大堰河指的是","他的保姆","一条河","他的母亲","他的邻居",},
{1,"词“少年不识愁滋味‘’是选自谁的作品？","辛弃疾","李白","李清照","杜甫",},
{1,"“所谓伊人,在水一方”出自哪里？","《诗经 秦风》","《诗经 郑风》","《诗经 卫风》","《诗经 王风》",},
{1,"《雨巷》作者是？","戴望舒","徐志摩","舒婷","席慕容",},
{1,"花落人忘两不知.出自那部小说?","<<红楼梦>>","<<三国志>>","<<西游记>>","<<围城>>",},
{1,"“春如旧,人空瘦”的下一句","泪痕红浥鲛绡透","满城春色宫墙柳","我失娇杨俊失柳","昨夜忽梦灌园叟",},
{1,"“鉴于往事,有贤于道”是谁为《资治通鉴》提的词？","宋神宗","唐太宗","清太祖","乾隆",},
{1,"“少年不识愁滋味,爱上层楼,爱上层楼,为赋新词强说愁”是谁的词？","辛弃疾","李清照","王安石","柳永",},
{1,"《三国志》中“明断少,性柔宽,无威略”是指谁呢？","刘璋","刘表","刘备","袁绍",},
{1,"<苏菲的世界>作者是哪个国家的","挪威","丹麦","俄罗斯","法国",},
{1,"《沉沦》一书的作者是：","郁达夫","陈志浩","林觉民","钱仲舒",},
{1,"《存在与虚无》的作者是?","萨特","喀斯特","亚里士多德","黑格尔",},
{1,"以下哪一项,不在“七情六欲”的七情中?","贪","食","性","情",},
{1,"“婴宁”是谁笔下的人物：","蒲松龄","屈原","曹雪芹","施耐奄",},
{1,"李白的“蓬莱文章建安骨,中间小谢又清发”中的“小谢”指的是谁？","谢眺","谢穆堂","谢刚","谢婉",},
{1,"中国最大的戏楼在：","颐和园","北海公园","豫园","圆明园",},
{1,"《尼罗河上的惨案》是谁的作品？","阿加莎","朗布尼","科里特","马加斯",},
{1,"莎士比亚的三部传奇剧是《辛白林》,《冬天的故事》和：","《仲夏夜之梦》","《王子复仇记》","《奥赛罗》","《威尼斯商人》",},
{1,"“八大山人”有几个人？","1人","8人","3人","16人",},
{1,"我国诗歌创作最多的朝代是：","明代","唐朝","宋朝","汉朝",},
{1,"孔子认为可以使人“温柔敦厚”的儒家经书是哪一部？","《诗经》","《尚书》","《中庸》","《大学》",},
{1,"“相逢莫问人间事,故国伤心只泪流”是谁的诗？","苏曼殊","宴殊","李白","张立和",},
{1,"老舍创作于40年代的作品是：","《四世同堂》","《家园》","《永别》","《战争》",},
{1,"《假装纯情》的作者是谁","宁财神","王朔","赵波","痞子蔡",},
{1,"《祝福》是谁的文章？","鲁迅","三毛","茅盾","老舍",},
{1,"因诗集《玉门诗抄》等被称为“石油诗人”的是：","李季","王希坚","梁上泉","严辰",},
{1,"“食色,性也”是谁说的？","孟子","老子","孔子","逍遥子",},
{1,"我国最早的女诗人是？","许穆夫人","张丽","李清照","麦丝",},
{1,"徐悲鸿最擅长画：","马","人","海","天空",},
{1,"“黑夜给了我黑色的眼睛,我却用他来寻找光明”是谁的诗句？","顾城","张白","鲁迅","茅盾",},
{1,"“劝君更进一杯酒,西出阳关无故人”是谁的诗句？","王维","骆宾王","李商隐","李贺",},
{3,"“天地有大美而不言”是谁提出来的美学观点？","逍遥子","老子","庄子","李白",},
{3,"儒家经典一共有多少部？","13","12","6","4",},
{3,"曾在家门帖上“画不买给官家”的画家是：","张大千","徐悲鸿","齐白石","唐伯虎",},
{3,"下面属于美国作家的作品是","《项链》","《双城记》","《麦琪的礼物》","《红与黑》",},
{3,"“三十而立,四十不惑,五十知天命,六十而耳顺”出自何人之口","孔子","孟子","老子","墨子",},
{3,"曼陀林是什么东西？","商标","药品","乐器","食物",},
{3,"《啼笑因缘》的作者是：","张爱玲","杨浩松","张恨水","朱林",},
{3,"“滥竽充数”典故的由来与谁有关？","孔子","老子","韩非","庄子",},
{3,"“司空见惯”中的“司空”是指：","一种行为","一个人","一种官职","一种屁话",},
{3,"诗句“落花时节又逢君”中的“君”指的是：","李商隐","杜甫","李龟年","张亭午",},
{3,"台湾女作家李昂的代表作是：","《永别》","《家园》","《杀夫》","《夫妻之道》",},
{3,"“同气”是指什么关系？","夫妻","姐妹","兄弟","父子",},
{3,"“此情可待成追忆,只是当时已惘然”是谁的诗句？","杜甫","李白","李商隐","白居易",},
{3,"不是法国作家作品的是","<<费加罗的婚礼>>","<<巴黎圣母院>>","<<艰难时世>>","<<悭吝人>>",},
{3,"《将进酒》是谁写的？","白居易","杜甫","李白","孟浩然",},
{3,"自认为写中文字最多的作家是","琼瑶","矛盾","卫斯理","李泰",},
{3,"《红楼梦》中提到这么一个谜语“猴子身轻站树梢”,打一水果,是什么呢？","苹果","雪花梨","荔枝","桃",},
{3,"《乡愁》是谁的诗作？","薛涛","汤显祖","余光中","朱诺",},
{3,"传奇剧本《牡丹亭》的作者是：","薛涛","鲁迅","汤显祖","曹操",},
{3,"下面哪位的别号是柳泉居士？","鲁迅","胡适","蒲松龄","李白",},
{3,"我国古典四大名著中,第一部被中央台搬上屏幕的是：","红楼梦","三国演义","西游记","水浒传",},
{3,"被称为“第七艺术”的是：","音乐","舞蹈","电影","斗牛",},
{3,"我国“第一白话诗人”是：","茅盾","鲁迅","胡适","高平",},
{3,"《欧也妮·葛朗台》的作者是谁？","比基斯","莫泊桑","巴尔扎克","麦克李非",},
{3,"“乌台诗案”与哪一位诗人有关？","杜牧","李白","苏东坡","李商隐",},
{3,"“露从今夜白,月是故乡明”的作者是：","李白","白居易","杜甫","李商隐",},
{3,"“红酥手,黄滕酒,满城春色宫墙柳”这一首词描写的是谁的爱情故事？","李清照","柳永","陆游","李商隐",},
{3,"漫画《三毛流浪记》的作者是：","古立","张志新","张乐平","马一德",},
{3,"海明威的封笔之作是：","《我的大学》","《永别了,武器》","《老人与海》","《奇遇》",},
{3,"“蜀犬吠日”的意思是：","不知天高地厚","马马乎乎","少见多怪","龙游浅水",},
{3,"在巴西定居的中国著名画家是：","刘波","徐悲鸿","张大千","谭一辉",},
{3,"“年年岁岁花相似,岁岁年年人不同”是谁的名句？","鲁迅","柳安","刘希夷","韩愈",},
{3,"号“六一居士”的是：","苏轼","杜牧","欧阳修","王安石",},
{3,"徐志摩的《再别康桥》中的“康桥”指的是什么地方？","七孔桥","爱情桥","剑桥大学","朗木桥",},
{3,"《黄鹤楼》的著者是?","杜牧","范仲淹","崔颢","苏轼",},
{3,"三杯两盏淡酒, 怎敌他、晚来风急？出自那首词?","满庭芳","蝶恋花","声声慢","念奴娇",},
{3,"“秋风萧瑟星汉灿烂”出自于谁人之口？","刘备","孔明","曹操","关羽",},
{3,"“日暮客愁新,江清月近人”出自谁人","杜甫","李白","孟浩然","李贺",},
{3,"《诗经》是我国最早的一部诗歌总集,它共有多少篇？","320","300","305","315",},
{3,"《疱丁解牛》的作者是谁？","孟子","墨子","庄子","叫花子",},
{3,"欧阳修是什么朝代的人？","明朝","唐朝","宋朝","元朝",},
{3,"《战国策》共多少篇？","26","109","33","79",},
{3,"《二心集》是谁的作品？","老舍","巴金","鲁迅","茅盾",},
{3,"浮士德是谁的作品？","雨果","塞万提斯","歌德","巴尔扎克",},
{3,"《堂吉诃德》是谁的作品？","拉伯雷","巴尔扎克","塞万提斯","雨果",},
{3,"《人间喜剧》是谁的作品？","歌德","雨果","巴尔扎克","莫泊桑",},
{3,"《茶馆》是谁的作品？","巴金","茅盾","老舍","夏衍",},
{3,"老舍原名是？","张庆春","舒庆秋","舒庆春","张庆秋",},
{3,"周树人在哪一篇文章中第一次采用鲁迅这个笔名？","阿Q正传","骆驼祥子","狂人日记","呐喊",},
{3,"写鬼写狐高人一等,刺贪刺虐入木三分是形容谁?","韦应物","鲁迅","蒲松龄","朱翁",},
{3,"“留取丹心照汗青”是谁的诗句？","杜甫","李白","文天祥","王维",},
{3,"卫斯理小说《末路英雄》中男主角是谁？","卫斯理","原振侠","司马洛","杨根",},
{3,"《巴黎圣母院》是谁的作品？","歌德","塞万提斯","雨果","巴尔扎克",},
{3,"《骆驼祥子》是谁的作品？","巴金","茅盾","老舍","夏衍",},
{3,"《梦溪笔谈》的作者沈括是：","明朝人","元朝人","宋朝人","唐朝人",},
{3,"小荷才露尖尖角,早有蜻蜓立上头出于何人之手？","白居易","李白","杨万里","贺之章",},
{3,"“今人不见古时月,今月曾经照古人”是谁写的？","白居易","张若虚","李白","王维",},
{3,"“满遭损,谦受益”出于何处？","后汉书","卜居","尚书","论语",},
{3,"“尽信书不如无书”是谁说的？","庄子","孔子","孟子","老子",},
{3,"《围城》中故事刚开始时是那一年？","1936","1935","1937","1938",},
{3,"《围城》共有几章？","8","7","9","10",},
{3,"“遥知不是雪,为有暗香来。”出自和人之手？","李商隐","苏轼","王安石","陆游",},
{3,"“吾生也有涯,而知也无涯”是谁说？","孔子","孟子","庄子","老子",},
{3,"古今小说是？","警世明言","警世通言","喻世明言","醒世恒言",},
{3,"哪处不是六大古都之一？","开封","南京","成都","杭州",},
{3,"古时一石=？","10斛","12斗","10斗","12斛",},
{3,"《情人》 一书作者是","杜拉斯。玛格丽特","玛格丽特.杜丽莎","玛格丽特.杜拉斯","马尔斯单。杜拉斯",},
{3,"《雨衣》是谁的文章？","刘庸","三毛","蔡智恒","痞子凯",},
{3,"<<心有千千结>>的作者是","方芳","三毛","琼瑶","痞子蔡",},
{3,"“众里寻他千百度,蓦然回首,那人却在,灯火阑珊处。”是谁的词？","李清照","欧阳修","辛弃疾","苏轼",},
{3,"“剪不断,理还乱,是离愁。别是一般滋味、在心头。”是谁的词？","李清照","苏轼","李煜","柳永",},
{3,"“夕阳无限好,只是近黄昏”是出自谁口？","李白","白居易","李商隐","杜甫",},
{3,"号称”诗鬼“的是？","韩愈","杜牧","李贺","李商隐",},
{3,"杜牧的字什么？","木子","子敬","牧之","子牧",},
{3,"毛泽东所说的“风骚”指什么？","有风度","风流颓唐","风-国风   骚-离骚","有英雄气概",},
{3,"《十日谈》 一书作者是","三厅末","捕厅末","卜伽丘","琦琳末",},
{3,"《挪威的森林》 一书作者是","松铠智人","树春上人","村上春树","喧本霜城",},
{3,"《麦田里的守望者》作者是？","格尔得","格塞林","塞林格","格言内",},
{3,"“水是眼波横,山是眉峰聚。”的作者是谁。","李之仪","黄庭坚","王观","欧阳修",},
{3,"《西厢记》的作者是","祝枝山","关汉卿","王实甫","巩莫名",},
{3,"著名的《清明上河图》由何人所做？","张大千","唐伯虎","张择端","郑板桥",},
{3,"凡尔纳的“三部曲”中不包括：","格兰特船长的儿女","海底两万里","从地球到月球","神秘岛",},
{3,"《千年一叹》作者是谁","鲁迅","钱钟书","余秋雨","梁启超",},
{3,"以下哪个不是墨子的主张？","节用","非攻","性善论","尚贤",},
{3,"中国最早的文言志怪小说是什么？","《南柯记》","《世说新语》","《搜神记》","《牡丹亭》",},
{3,"“丹心共见燕山夜,健笔终存天地间”咏的是谁？","文天祥","陆游","邓拓","王安石",},
{3,"有诗佛之称的是？","孟浩然","杜甫","王维","杜牧",},
{3,"《社稷坛抒情》的作者是？","杨朔","何为","秦牧","宗璞",},
{3,"《桃园》的作者是？","沈从文","许地山","废名","郁达夫",},
{3,"《存在与虚无》是存在主义代表人物——的作品","尼采","加缪","萨特","黑格儿",},
{3,"刘禹锡字什么?","乐天","退之","梦得","子厚",},
{3,"“封侯非我愿,但愿海波平”的作者是","文天祥","于谦","戚继光","岳飞",},
{3,"“泪湿干花著露,愁到眉峰碧聚”出自","《燕山亭》","《千岁秋》","《惜分飞》","《浣溪沙》",},
{3,"陆游的〈红酥手〉最先是写给谁的？","他妻子","他的情人","他前妻唐婉","他母亲",},
{3,"我国国歌的填词人是","冼海星","聶耳","田汉","傅聪",},
{3,".《教我如何不想她》的作者是谁","王小妮","车前子","刘半农","公刘",},
{3,"《鲁宾逊漂流记》中的主人公在孤岛上呆了多少年？","22","24","28","26",},
{3,"“坐看云起”出自？","王勃","李商隐","王维","王昌龄",},
{3,"李广田的《山之子》描写了那座山的一个普通山民的故事？","太行山","华山","泰山","沂蒙山",},
{3,"“清水出芙蓉,天然去雕饰”着句名言是由谁写的？","李商隐","杜牧","李白","朱熹",},
{3,"在“诗界革命”口号下,诗歌创作成就最大的是","梁启超","康有为","黄遵宪","曾朴",},
{3,"最早把<Gone With The Wind>翻译成〈飘〉的翻译家是谁？","方平","徐少华","傅东华","方敬",},
{3,"下列哪项不是泰戈尔的作品","《飞鸟集》","《星月集》","《虫鱼集》","《园丁集》",},
{3,"“天涯海角有穷时,只有相思无尽处”出自谁的诗句","李清照","晏几道","晏殊","柳永",},
{3,"《淮海集》是谁的作品","时彦","李元膺","秦观","周邦彦",},
{3,"下面哪个不是沈从文的笔名","懋琳","小兵","沈岳焕","休芸芸",},
{3,"《晚春》是谁的作品？","苏轼","柳永","黄庭坚","蒋捷",},
{3,"“文王怒而天下安”语出？","墨子","庄子","孟子","孙子",},
{3,"《梅花》的作者是","李白","王安石","苏轼","陈维嵩",},
{3,"“黄四娘家花满溪,千朵万朵压枝低”出自？","李商隐","李白","杜甫","王维",},
{3,"陶渊明字什么？","有光","有亮","无亮","无光",},
{3,"薛涛是哪朝人？","五代","宋","唐","明",},
{3,"不是古希腊三大悲剧作家的是","欧里庇得斯","埃斯库罗斯","阿里斯托芬","索福克勒斯",},
{3,"<鹿柴>是以下谁的作品?","李商隐","陶渊明","王维","刘禹锡",},
{3,"“问世间,情是何物,真教生死相许”出自谁的诗句","顾贞观","琼瑶","元遗山","李益",},
{3,"“尽日问花花不语,为谁零落为谁开？”的作者是？","欧阳修","李商隐","严晖","元稹",},
{3,"《倩女离魂》是谁的作品？","汤显祖","王实甫","郑祖光","白朴",},
{3,"请问《卖油郎独占花魁》选自那本书？","《五库全书》","《聊斋志异》","《今古奇观》","《小说选集》",},
{3,"下列辞赋家中被鲁迅称作最善于“模拟”的“大师”是谁？","张衡","班固","扬雄","贾谊",},
{3,"“缺月挂疏桐”的作者是谁","辛弃疾","李白","苏轼","李清照",},
{3,"明眸善睐与古代传说有关,指的是","瑶姬","湘妃","洛神","陈圆圆",},
{3,"守株待兔“的作者是谁？>","孟子","孔子","韩非子","庄子",},
{3,"新乐府运动是由谁倡导的?","白居易和顾况","元结和顾况","白居易和元稹","元稹和元结",},
{3,"诗歌的“三美”是谁提出的？","艾青","郭沫若","闻一多","田间",},
{3,"青山缭绕疑无路,忽见千帆隐映来是谁的诗?","杜甫","李白","王安石","杜牧",},
{3,"不才明主弃,多病故人疏是谁的诗?","杜甫","李白","孟浩然","杜牧",},
{3,"“欲将心事付瑶琴,知音少,弦断有谁听。”作者是谁？","范仲淹","李广","岳飞","韩愈",},
{3,"毛笔的发明则者是谁？","袁和平","王羲之","蒙恬","墨子",},
{3,"靖节先生是指何人?","欧阳修","陈寿","陶潜","韩愈",},
{3,"李白的诗句“吾爱孟夫子,风流天下闻”中的“孟夫子”是谁？","孟郊","孟子","孟浩然","李孟",},
{3,"神灭论的作者是：","荀子","王充","范缜","陶弘景",},
{3,"“我失娇杨君失柳,杨柳轻飏直上重霄九”是谁的名句？","郭沫若","柳亚子","毛泽东","陈毅",},
{3,"《生命的留言》的作者是谁？","余秋雨","白岩松","陆幼青","崔永元",},
{3,"《窦娥冤》的故事发生在什么时候什么地方？","元朝柳州","明朝楚州","元朝楚州","明朝柳州",},
{3,"“酒入愁肠,化作相思泪”是谁的词？","辛弃疾","李清照","范仲淹","柳永",},
{3,"荀子名","或","孟","况","艾",},
{3,"“红楼梦”原名什么：","女儿国","妻妾成群","石头记","观园记",},
{3,"《雾》,《雨》,《电》是谁写得？","路遥","老舍","巴金","鲁迅",},
{3,"《诗》曰：“天命玄鸟,降而生商,宅殷土茫茫。”中的玄鸟是指什么？","鹰","喜鹊","太阳鸟","天宫鸟",},
{3,"“泪眼问花花不语,乱红飞过秋千去。”是出自谁的词。","李清照","晏殊","欧阳修","谢绛",},
{3,"“天涯何处无芳草”是谁说的？","欧阳修","晏殊","苏轼","李清照",},
{3,"“无可奈何花落去,似曾相识燕归来”是谁的词？","柳永","李清照","晏殊","李煜",},
{3,"“落红不是无情物,化为春泥更护花”是谁的诗？","杜甫","陆游","龚自珍","欧阳修",},
{3,"《金瓶梅》的作者是谁","古龙","金庸","兰陵笑笑生","曹雪芹",},
{3,"“红豆生南国,春来发几枝”出自哪位作家之手？","王之涣","王勃","王维","王安石",},
{3,"“大漠孤烟直,长河落日圆”出自哪位作家之手？","王之涣","王勃","王维","王安石",},
{3,"“海内存知己,天涯若比邻”出自哪位作家之手？","王之涣","王维","王勃","王安石",},
{3,"“出师未捷身先死,长使英雄泪满襟。”出自哪篇文章：","《出师表》","《前出师表》","《蜀相》","《诸葛武侯传》",},
{3,"欧美三大短篇小说家不包括","莫伯桑","欧.亨利","马克.吐温","契诃夫",},
{3,"冰心原名叫什么?","矛以升","周树人","谢婉莹","钱学森",},
{3,"星星之火,可以燎原这句名言出至哪位名人?","鲁迅","李大钊","毛泽东","舒庆春",},
{3,"“亲贤臣,远小人,此先汉之所以兴隆也......”出自哪篇文章","《石豪吏》","《出塞》","《出师表》","《潼关吏》",},
{3,"《文心雕龙》的文体分为多少大类","25","15","20","40",},
{3,"怡红公子指哪个","曹雪芹","张生","贾宝玉","薛宝钗",},
{3,"保尔的妻子是","丽达","戈利亚","达雅","冬妮亚",},
{3,"散文《春》的作者是谁？","刘禹锡","冰心","朱自清","流沙河",},
{3,"王献之是王羲之的","弟弟","父亲","儿子","哥哥",},
{3,"“强中更有强中手,恶人须服恶人磨”的作者是","陈基","王之涣","冯梦龙","范成大",},
{3,"“松风吹解带,山月照弹琴”是谁的诗句？","常建","杜甫","王维","陈子昂",},
{3,"新鸳鸯蝴蝶梦是根据谁的诗改编的？","白居易","王维","李白","王勃",},
{3,"《卖炭翁》与《卖油翁》的作者分别是：","王维,杜甫","杜甫,李白","白居易,欧阳修","杜甫,白居易",},
{3,"下面是婉约词人的是：","岳飞","辛弃疾","柳永","苏轼",},
{3,"“落花时节又逢君”中的“君”指的是谁？","杜甫","李白","李龟年","汪伦",},
{3,"下面哪个是“初唐四杰”之一？","陈子昂","王维","卢照邻","孟浩然",},
{3,"一种相思,两处闲愁。 是谁人所写?","琼瑶","柳永","李清照","三毛",},
{3,"琼瑶的第一部作品是","冰儿","我的故事","窗外","六个梦",},
{3,"“大风吹倒梧桐树,自有旁人论短长”这句话最早出现于","汉朝","明朝","宋朝","清朝",},
{3,"老舍原名是","舒以同","舒同心","舒庆春","舒舍予",},
{3,"“文章本天成,妙手偶得之”的作者是","杨万里","苏东坡","陆游","杜甫",},
{3,"“桃花潭水深千尺,不及汪伦送我情”是谁的作品","王之涣","杜甫","李白","高适",},
{3,"“一骑红尘妃子笑,无人知是荔枝来”是谁写的","李白","杜甫","杜牧","白居易",},
{3,"“人逢喜事精神爽,月到中秋分外明”出自","警世通言","喻世明言","醒事恒言","红楼梦",},
{3,"寒日萧萧上锁窗,梧桐应恨夜来霜。","柳永","苏轼","李清照","辛弃疾",},
{3,"曹操的“对酒当歌,人生几何”中的酒指的是？","米酒","茅台","杜康","黄酒",},
{3,"雁字回时, 月满西楼。是谁的作品?","柳永","姜夔","李清照","苏轼",},
{3,"哪部作品不是杜甫的“三吏”之中的","石壕吏","新安吏","绌官吏","潼关吏",},
{3,"竹林七贤中不包括哪一位？","山涛","王戎","陈琳","向秀",},
{3,"“谁知盘中餐,粒粒皆辛苦”的作者是","陆游","曹植","李绅","白居易",},
{3,"《家》中高府二少爷是","觉慧","觉新","觉民","觉安",},
{3,"我国最早的诗歌总集出现在什么时候","唐","汉","春秋战国","清",},
{3,"四大名著中哪一部不是和其它三部成于同一朝代","水浒传","三国演义","红楼梦","西游记",},
{3,"夕阳无限好,只是近黄昏是谁的诗句","杜甫","杨万里","李商隐","白居易",},
{3,"下面哪一部是农学著作","论衡","水经注","齐民要术","水经注",},
{3,"大风歌的作者是谁","岳飞","项羽","刘邦","曹操",},
{3,"《归去来辞》的作者是谁","曹操","柳宗元","陶渊明","孔融",},
{3,"有志者事竟成,破釜沉舟百二秦关终属楚是谁说的","刘邦","项羽","蒲松龄","曹操",},
{3,"“得成比目何辞死,愿作鸳鸯不羡仙”的作者是","晏殊","陶潜","卢照邻","杜甫",},
{3,"“黄鹤一去不复反,白云千载空悠悠”的作者是","白居易","黄庭坚","崔颢","王安石",},
{3,"巴金原名","李尧荣","李尧甘","李尧堂","李尧芾",},
{3,"“少壮不努力,老大徒伤悲”出自哪个朝代","明朝","汉朝","唐朝","元朝",},
{3,"莫泊桑是哪国作家？","美国","英国","法国","德国",},
{3,"林黛玉是哪人","杭州","苏州","扬州","常州",},
{3,"江西诗派的首领是谁","杜甫","李白","黄庭坚","刘禹锡",},
{3,"“老夫聊发少年狂”中的“老夫”是谁？","范仲淹","陆游","苏轼","辛弃疾",},
{3,"《家》,《春》,《秋》的作者是？","矛盾","鲁迅","巴金","浩然",},
{3,"“海上升明月,天涯共此时”的作者是","王维","李白","张九龄","李商隐",},
{3,"《木兰辞》是","唐诗","南朝民歌","北朝民歌","宋词",},
{4,"“慈母手中线,游子身上衣”是谁的诗句？","陆游","林升","白居易","孟郊",},
{4,"一失足成千古恨,再回头是百年身是谁说的","白居易","李白","杜甫","唐寅",},
{4,"哪部作品是王羲之的","洛神赋图","女史箴图","宣示表","兰亭序",},
{4,"“相见争如不见,有情还似无情”是谁的作品","孟浩然","李商隐","高适","司马光",},
{4,"《敕勒歌》是哪个少数民族的民歌","氐族","匈奴","满族","鲜卑族",},
{4,"“秦时明月汉时关,万里长征人未还”是哪部作品中的诗句？","《琵琶行》","《赠汪伦》","《别董大》","《出塞》",},
{4,"观沧海的作者是谁？","李世民","毛泽东","刘邦","曹操",},
{4,"《琵琶行》是谁的作品？","李白","苏轼","杜甫","白居易",},
{4,"“幽默的根源是痛苦,天堂里是没有幽默的”这句话是谁说的？","莎士比亚","莫泊桑","雨果","马克·吐温",},
{4,"《胡笳十八拍》此诗作者是谁","跟本没有这一诗","屈原","李清照","蔡文姬",},
{4,"“差之毫厘,失之千里”。是出自","《警世恒言》","《尚书》","《论语》","《史记》",},
{4,"唐代诗人王昌龄最擅长的诗体是？","七言律诗","五言绝句","五言律诗","七言绝句",},
{4,"曹禺剧作中唯一的以农村生活为题材的作品是？","《蜕变》","《家》","《北京人》","《原野》",},
{4,"下面哪项是晚清四大谴责小说之一？","《天湖居》","《红楼梦》","《海上花》","《老残游记》",},
{4,"第一部以农民起义为题材的优秀长篇小说是？","《左传》","《儒林外史》","《三国演义》","《水浒》",},
{4,"下面哪一部作品不是朱自清的？","《荷塘月色》","《背影》","《绿》","《灯》",},
{4,"“踏破铁鞋无觅处,得来全不费工夫”出自谁的作品？","辛弃疾","李煜","李清照","冯梦龙",},
{4,"“莫愁前路无知已,天下谁人不识君”是谁的诗句？","杨万里","孟浩然","白居易","高适",},
{4,"茅盾何时开始用“茅盾”这一笔名？","1927","1926","1924","1928",},
{4,"哪部作品曾被誉为“左翼文艺运动1931年的最优秀的成果”？","《母亲》","《田家冲》","《某夜》","《水》",},
{4,"王粲在哪本书里被称为七子之冠冕?","<<典论.论文>>","<<诗品>>","<<文赋>>","<<文心雕龙>>",},
{4,"《琵琶行》是谁的作品","辛弃疾","孟浩然","陆游","白居易",},
{4,"人悄悄,月依依,翠帘垂。是谁写得?","辛弃疾","古龙","金庸","李清照",},
{4,"下列哪部不属我国民间四大爱情传奇故事","白蛇传","梁山泊与祝英台","牛郎织女","西厢记",},
{4,"“天长地久有时尽,此恨绵绵无绝期”选自","大风歌","正气歌","晚晴","长恨歌",},
{4,"《三国演义》多少回","160","80","100","120",},
{4,"似愁凝、汉阜解佩,似泪洒、纨扇题诗。是谁人所写?","柳永","李白","苏轼","李清照",},
{4,"《典论.论文》出自？","司马迁","曹操","曹植","曹丕",},
{4,"唐朝流传下来的诗歌大约有","七万首","一万首","十万首","五万首",},
{4,"司马迁字什么?","子虹","子云","子长","子兴",},
{4,"秋已尽, 日犹长, 仲宣怀远更凄凉。是谁的词?","柳永","苏轼","辛弃疾","李清照",},
{4,"一代红妆照汗青是赞美哪个美女的","杨玉环","西施","王昭君","陈圆圆",},
{4,"“商人重利轻别离”出自哪个诗人的作品","柳宗元","李白","韩瑜","白居易",},
{4,"“山不厌高,海不厌深。周公吐哺,天下归心”的作者是","王维","李世民","李白","曹操",},
{4,"落日熔金,暮云合璧, 人在何处？是谁的词?","高适","苏轼","辛弃疾","李清照",},
{4,"丈夫非无泪,不洒离别间的作者是","佚名","刘基","李白","陆龟蒙",},
{4,"琼瑶出生于","南京","洛阳","广州","成都",},
{4,"雁过也,正伤心,却是旧时相识。是谁人所写?","姜夔","琼瑶","三毛","李清照",},
{4,"“苛政猛于虎”出自谁的文章？","李白","白居易","李冰","柳宗元",},
{4,"哪部不是狄更斯的作品？","《匹克威克外传》","《双城记》","《大卫 科波菲尔》","《失乐园》",},
{4,"史湘云管贾母叫什么？","姨姥","姨奶","舅奶","姑奶",},
{4,"东周列国是谁写的?","罗贯中","李白","司马光","冯梦龙",},
{4,"孙子兵法是谁创的?","孙中山","孙膑","孙子","孙武",},
{4,"”才下眉头,却上心头“出自？","《西江月》","《蝶恋花》","《钗头凤》","《一剪梅》",},
{4,"鲁迅死的那一年,文坛还有哪个人去世了？","朱自清","普希金","雨果","高尔基",},
{4,"“知识就是力量。”这句话是谁说的？","爱迪生","牛顿","爱恩斯坦","培根",},
{4,"诸葛亮六出祁山中第三次出祁山是何年何月？","229年,9月","228年,6月","228年,9月","229年,4月",},
{4,"见义勇为 典出何处","庄子","孟子","唐诗","论语",},
{4,"伤心桥下春波绿,曾是惊鸿照影来是谁的诗?","杜甫","李白","杜牧","陆游",},
{4,"下列不属于竟陵八友的是(    )","沈约","范云","谢眺","鲍照",},
{4,"〈苹果车〉是谁的著作？","贝克特","罗曼罗兰","海明威","肖伯纳",},
{4,"楚俗饶词客出自谁的诗句?","杜甫","韦庄","李白","韦应物",},
{4,"成语“别开生面”是出自哪位诗人笔下？","苏轼","李白","白居易","杜甫",},
{4,"“红了樱桃,绿了芭蕉”出自谁？","王安石","黄庭坚","徐有贞","蒋捷",},
{4,"“飘得卖花声到了,一种清芬胜麝檀”是谁的诗句","苏轼","王安石","关汉卿","陈维嵩",},
{4,"不在最先,不耻最后 语自?","庄子","老子","墨子","韩非子",},
{4,"山光物态弄春晖,莫为轻阴便拟归.是谁写的?","李白","王之涣","张巡","张旭",},
{4,"下面那一篇不是选《世说新语》","荀巨伯","新亭对泣","床头捉刀人","与吴质书",},
{4,"下列哪项是海明威的第一部长篇小说？","「永别了,武器」","「老人与海」","「有的和没有的」","「太阳照样升起」",},
{4,"上联“吃西瓜子往东吐”下联“看左传皮往右翻”是哪两个所对？","康熙 纪晓岚","康熙 伟小宝","乾隆 刘罗锅","乾隆 纪晓岚",},
{4,"“寒灯思旧事,断雁警愁眠。”出自：","李白","杜甫","白居易","杜牧",},
{4,"以下哪个不是德国诗人","海涅","歌德","席勒","惠特曼",},
{4,"每一次的失敗,是走上成功的一階,出自誰?","拿破崙","南恩","皮特門","陶頓",},
{4,"三四岁至八九岁的儿童称为________","束发","总角","豆蔻","垂髫",},
{4,"《林家铺子》描写的是哪个历史事件前后小工商业者的悲惨遭遇？","马日事变","七·七事变","九·一八事变","一二·八事变",},
{4,"曾荣获1951年度斯大林文学奖金二等奖的中国文学作品是？","《生死场》","《暴风骤雨》","《创业史》","《太阳照在桑乾河上》",},
{4,"中国现代文学史上出版的第一部短篇小说集是？","《恢复》","《呐喊》","《彷徨》","《沉沦》",},
{4,"反对“新丽竟繁”的齐梁诗风,提倡“风雅兴寄”和“汉魏风骨”,这是谁的诗歌革新主张？","柳宗元","初唐四杰","白居易","陈子昂",},
{4,"“泉涸,鱼相与处于陆,相以湿,相濡以沫,不如相忘于江湖”来自：","《荀子》","《孟子》","《墨子》","《庄子》",},
{4,"《古文尚书》多少篇","十八","十二","十四","十六",},
{4,"“燕子不归春事晚,一汀烟雨杏花寒”选自哪首诗？","琵琶行","行路难","雨霖铃","苏溪亭",},
{4,"《肥皂》与《伤逝》出自鲁迅的哪部作品集","故事新编","呐喊","华盖集","彷徨",},
{4,"白居易的《草》的最后一句是","恨别鸟惊心","春风吹又生","报得三春晖","萋萋满别情",},
{4,"哪个不是元曲四大家","白朴","关汉卿","马致远","王实甫",},
{4,"“一畦春韭绿,十里稻花香”出自：","西厢记","唐诗","桃花扇","红楼梦",},
{4,"被誉为香港袋袋书大帝的作家是哪一位","刘墉","金庸","蔡澜","倪匡",},
{4,"巴黎圣母院中的人物不包括","加西莫多","法比","甘果瓦","沙威",},
{4,"《聊斋志异》这部短篇小说共收作品几多篇？","276","581","308","491",},
{4,"哪一部作品被称为新〈新儒林外史〉？","〈中国小说史略〉","〈谈艺录〉","〈管锥篇〉","〈围城〉",},
{4,"下列思想家中,被誉为“启蒙运动无可争辩的领袖”的是","狄德罗","孟德斯鸠","卢梭","伏尔泰",},
{4,"《公输》的作者是谁？","孔子","庄子","老子","墨子",},
{4,"“能者多劳”出自","《大学》","《庄子》","《孔子》","《列子》",},
{4,"小说家查尔斯狄更斯是哪一个国家的人？","澳洲","美国","加拿大","英国",},
{4,"《母亲》的作者是：","托尔斯泰","巴尔扎克","契坷夫","高尔基",},
{4,"〈福尔摩斯探案全集〉作者？","莫里哀","大仲马","雨果","柯南道尔",},
{4,"全世界最早的诗歌集是？","希腊诗集","荷马史诗","离骚","诗经",},
{4,"红楼梦中的<<西江月>>写得是谁?","贾母","林黛玉","王熙凤","贾宝玉",},
{4,"<<灯>>的作者是谁?","朱自清","冰心","鲁迅","巴金",},
{4,"自传体三部曲《童年》、《少年》、《青年》的作者是","阿·康·托尔斯泰","高尔基","阿·托尔斯泰","列夫·托尔斯泰",},
{4,"“望洋兴叹“中的洋是指什么？","北海","东海","南海","勃海",},
{4,"“唯楚有才、于斯为甚“的岳麓书院始建于哪个朝代？","北魏","南宋","南唐","北宋",},
{4,"空想社会主义史上的第三颗明珠是","托马斯·康帕内拉的《太阳城》","柏拉图的《理想国》","托马斯·莫尔的《乌托邦》","安德里亚的《基督城》",},
{4,"下列不属于希腊文学史上三大悲剧诗人的是：","欧里庇得斯","埃斯库罗斯","索福克勒斯","赫拉克勒斯",},
{4,"被称为“历史之父”的历史家是：","荷马","柏拉图","亚里斯多德","希罗多德",},
{4,"在古希腊神话中,阿尔忒弥斯 是：","爱与美神","智慧女神","战神","月亮神",},
{4,"罗马神话中的 尢比特 即希腊神话中的","阿尔特弥斯","雅典娜","阿佛罗狄特","宙斯",},
{4,"《却上心头》是谁的作品？","苏雪林","张爱玲","汪国真","琼瑶",},
{4,"在古希腊神话中雅典娜是：","爱与美神","太阳神","月亮神","智慧女神",},
{4,"《写在墙上的脸》的作者是谁？","李明松","高明松","李晓松","高晓松",},
{4,"“风枝惊暗鹊,露草泣寒虫”出自哪个诗人？","李商隐","韦应物","刘长卿","戴叔伦",},
{4,"白居易的诗句：“绿蚁新醅酒,红泥小火炉。晚来天欲雪......”的尾句是哪一句？","山风摇青竹。","独居在小屋。","冰心在玉壶。","能饮一杯无？",},
{4,"<古丛军行>是谁的作品?","白居易","李白","杜甫","李欣",},
{4,"海明威的小说《丧钟为谁而鸣》是以哪次战争为历史背景的？","美国南北战争","第一次世界大战","美西战争","西班牙内战",},
{4,"“朝闻道,夕死可矣”出自？","《老子》","《礼记》","《孟子》","《论语》",},
{4,"”顺天者存,逆天者亡”出自？","《荀子》","《老子》","《孔子》","《孟子》",},
{4,"“大器晚成,大音希声”出自？","《论语》","《孔子》","《孟子》","《老子》",},
{4,"郭沫若的诗集有：","《红烛》","《野草》","《死水》","《女神》",},
{4,"范仲淹（989—1052）,字:","临川","介甫","半山","希文",},
{4,"创作时间最长的一部著作是","呐喊","悲惨世界","人间喜剧","浮士德",},
{4,"《渡荆门送别》的著者是谁？","杜甫","孟浩然","杜牧","李白",},
{4,"《基度山伯爵》男主角的原名是什么？","维尔福","卡德罗斯","邓格拉司","爱德蒙·邓蒂斯",},
{4,"儒家经典之一《大学章句》被记载在哪里？","中庸》","《论语》","孟子》","《礼记》",},
{4,"第一本,《老夫子》漫画出于哪一年？","1962年","1965年","1950年","1964年",},
{4,"《敕勒歌》是哪个民族的诗歌？","羌","回纥","吐蕃","鲜卑",},
{4,"贺敬之和谁集体创作了〈〈白毛女〉〉？","田间","屈原","何为","丁毅",},
{4,"袁珂的代表作是什么？","<<路>>","<<长江三日>>","<<土地>>","<<中国古代神话>>",},
{4,"“塞下秋风风景异,衡阳雁去无留意“是谁的名词句？","陆游","辛弃疾","苏东坡","范仲淹",},
{4,"种豆南山下——的下句是什么","背日而锄之","晨兴理荒秽","带月荷锄归","草盛豆苗稀",},
{4,"《乐羊子妻》出自？","《史记》","《汉书》","《三国志》","《后汉书》",},
{4,"江北烟花里,淮南胜事多。作者是？","李白","王郎","杜甫","姚合",},
{4,"“夕阳落在井口边！”打一成语？","是","我","明","名",},
{4,"“猿啼洞庭树,人在木兰周。”是谁的诗句？","刘禹锡","李白","刘长卿","马戴",},
{4,"以下作品,不是白居易的是：","《东林寺白莲》","《隋堤柳》","《草茫茫》","《少年游》",},
{4,"《飘》（乱世佳人）作者是：","阿加莎·克里斯蒂","马克·吐温","玛格丽特·杜拉斯","玛格丽特·米切尔",},
{4,"“曲则全,枉则直,洼则盈,敝则新,少则多,多则惑”。出自：","《韩非子》","《孟子》","《孔子》","《老子》",},
{4,"普希金是怎么死的？","病死","自杀","他杀","决斗",},
{4,"“物壮诚有衰,势雄良易极”是谁的诗：","李贺","王勃","李商隐","陈子昂",},
{4,"“旧时王谢堂前燕,飞入寻常百姓家”是谁的诗：","杜甫","白居易","李白","刘禹锡",},
{4,"“节物风光不相待,桑田碧海须臾改”是谁的诗：","白居易","李白","杜牧","卢照邻",},
{4,"〈〈三国志〉〉共多少卷","80","24","35","65",},
{4,"“欲就麻姑买沧海,一杯春露冷如冰”是谁的诗：","李贺","韩愈","王勃","李商隐",},
{4,"“南风吹山作平地,帝谴天吴移海水”是谁的诗：","杜甫","李白","杜牧","李贺",},
{4,"“春风桃李花白开,秋雨梧桐叶落时”是谁的诗：","韩愈","李白","杜甫","白居易",},
{4,"成语见义勇为出自","古代小说","诗词","曲","论语",},
{4,"多乎哉,不多矣 是谁的话","孟子","孔鲤","孔乙己","孔子",},
{4,"道德经分多少章","56","99","100","81",},
{4,"与蒲松龄《聊斋志异》中《口技》同名的古文作者是谁？","柳宗元","蒲松龄本人","欧阳修","林嗣环",},
{4,"“以其人之道,还治其人之身”出自：","《韩非子》","《孟子》","《孙子兵法》","《中庸》",},
{4,"“月满则亏,水满则溢”出自哪本著作：","《三国》","《西游记》","《水浒》","《红楼梦》",},
{4,"“辅车相依,唇亡齿寒”出自哪本著作：","《列子》","《老子》","《古风》","《左传》",},
{4,"“种瓜得瓜,种豆得豆”出自哪本著作：","《警世通言》","《吕式春秋》","《涅磐经》","《答奥村庸礼问》",},
{4,"《杂说》是谁的有名作品？","杜牧","柳宗元","杜甫","韩愈",},
{4,"“眼前无长物,窗下有清风。”的作者是谁？","韩愈","李白","杜甫","白居易",},
{4,"<老子>又称","道经","逍遥游","庄子","道德经",},
{4,"“巧妇安能作无面汤饼”出自哪本著作：","《神灭论》","《颜式家训》","《颜乐亭》","《老学庵笔记》",},
{4,"“不塞不流,不止不行”出自哪本著作：","《孙子》","《老子》","《庄子》","《原道》",},
{4,"“有风方起浪,无潮水自平”出自哪本著作：","《三国》","《红楼梦》","《水浒》","《西游记》",},
{4,"“皮之不存,毛将安缚”出自哪本著作：","《列国》","《春秋》","《古风》","《左传》",},
{4,"“圣人千虑,必有一失；愚人千虑,必有一得”出自哪本著作：","《颜乐亭》","《史记》","《金石录后序》","《晏子春秋》",},
{4,"“尺有所短,寸有所长”出自哪本著作：","《孙子》","《老子》","《庄子》","《卜居》",},
{4,"“魂兮归来哀江南”的作者是：","李商隐","段玉","杜牧","宋玉",},
{4,"故乡何处是？忘了除非醉。是 谁写的?","李昱","李格非","苏轼","李清照",},
{4,"“日出江花红胜火,春来江水绿如蓝。”出自谁口？","王维","李白","杜甫","白居易",},
{4,"以下谁不是扬州八怪","高翔","金农","郑板桥","朱耷",},
{4,"汤显祖的作品是什么？","菊花亭","唱歌声","桃花扇","牡丹亭",},
{4,"哲学家苏格拉底是哪里人？","美国","中国人","澳大利亚","雅典人",},
{4,"哲学家苏格拉底的去世年代？","公元前402","公元前400","公元前401","公元前399",},
{4,"哲学家苏格拉底的诞辰？","公元前472","公元前470","公元前471","公元前469",},
{4,"“冻死不拆屋,饿死不掳掠”是描写谁？","解放军","杨家将","红军","岳家军",},
{4,"哲学家马克思是出生在德国哪个省？","慕尼黑","柏林","法兰克福","莱茵",},
{4,"哲学家马克思是哪年去世的？","1886","1884","1885","1883",},
{4,"哲学家马克思是哪年出生的？","1821","1819","1820","1818",},
{4,"帕拉图式爱情指的是？","同性式","性爱式","无聊式","精神式",},
{4,"著名作家路遥最崇拜的作家是谁？","老舍","巴金","鲁迅","柳青",},
{4,"《在困难的日子里》是谁写的？","老舍","鲁迅","巴金","路遥",},
{4,"王羲之喜欢什么（1个字）","鸡","鸭","猪","鹅",},
{4,"五湖旧约（作者）","白居易","李白","杜甫","姜夔",},
{4,"日暮相关何处是,烟波江上使人愁是谁的作品","王维","高适","柳永","崔颢",},
{4,"西施咏是谁的作品？","杜甫","李白","张九龄","王维",},
{4,"17世纪继莎士比亚之后英国最伟大的诗人是","塞万提斯","莫尔","拉伯雷","弥尔顿",},
{4,"以下哪个不是词牌名？","汉宫春","安公子","贺新郎","天净沙",},
{4,"《国风》包括多少个诸侯国和地区的诗歌？","19","16","20","15",},
{4,"最早的一部戏曲史《宋元戏曲考》是王维国于何年著作的？","1014","1909","1908","1912",},
{4,"《梁父吟》是谁写的？","杜甫","屈原","李白","孔明",},
{4,"鲁迅这个名字是怎么来的","以前某个人的名字","由作品中人物的名字而来","任意的","由英文音译而来",},
{4,"被誉为黑色幽默文学的代表作的是","《哈克贝利 芬恩历险记》","《飘》","《麦琪的礼物》","《第二十二条军规》",},
{4,"书湖阴先生壁选自哪里？","稼轩长短句","临川先生文集","杜少陵集","王荆文公诗笺注",},
{4,"《六经二字》出自","孟子治国篇","孔子论语篇","老子道德篇","庄子天运篇",},
{4,"<<红楼梦>>中珍珠是哪个","龄官","晴雯","芳官","袭人",},
{4,"《蝴蝶》这篇短篇小说是下面哪个人的作品？","张爱玲","贾平凹","路遥","王蒙",},
{4,"哪个地方在印第安语中是“多山的地方”？","墨西哥","秘鲁","古巴","海地",},
{4,"“人定胜天”的观点是谁提出的？","孟子","庄子","老子","荀子",},
{4,"下列谁比较短寿？","墨子","孟子","孔子","韩非",},
{4,"“各人自扫门前雪,休管他人瓦上霜”出自：","醒事恒言","增广贤文","警世通言","事林广记",},
{4,"“有心栽花花不发,无心插柳柳成荫”出自何书？","红楼梦","蓬轩别记","金瓶梅","平妖传",},
{4,"“人逢喜事精神爽,月到中秋分外明”出自何书？","水浒传","警世通言","红楼梦","醒事恒言",},
{4,"“夫妻本是同林鸟,巴到天明各自飞”出自何书？","事林广记","喻世明言","醒事恒言","警世通言",},
{4,"诗鬼指谁？","杜甫","李商隐","李白","李贺",},
{4,"“一语在然万古新,豪华落尽见真淳”是元遗山对谁的评语？","王维","李后主","刘禹锡","陶渊明",},
{4,"“忍把浮名,换了浅斟低唱”是的这词的词牌名是什么？","念奴娇","蝶恋花","声声慢","鹤冲天",},
{4,"下面哪部不是选自鲁迅的《傍徨》？","《伤逝》","《祝福》","《高老夫子》","《社戏》",},
{4,"先秦时期的“老子”姓李名什么？","科","目","号","耳",},
{4,"称为两榜出身的是：","举人出身","解元出身","状元出身","进士出身",},
{4,"“无本”曾是哪位诗人的法号？","李商隐","苏东坡","刘禹锡","贾岛",},
{4,"《小职员之死》的作者的国籍是？","苏联","芬兰","挪威","俄国",},
{4,"下面谁不属于“桐城派”？","方苞","姚鼐","刘大魁","洪亮吉",},
{4,"《庄子》又名?","《淮南子》","《逍遥游》","《道德经》","《南华经》",},
{4,"“自古皆贵中华,贱夷狄,朕独爱之如一。”是谁说的？","唐肃宗","唐玄宗","唐高祖","唐太宗",},
{4,"大智若愚,大巧若拙出自？","孙子","孔子","墨子","老子",},
{4,"我国第一部白话文小说是什么？","故乡","孔乙己","药","狂人日记",},
{4,"中国第一部白话文小说是谁写的？","矛盾","陈独秀","毛泽东","鲁迅",},
{4,"李白出生于？","南亚碎叶","东亚碎叶","西亚碎叶","中亚碎叶",},
{4,"“采菊东篱下,悠然见南山”出自：","《杂诗》","《归园田居》","《移居》","《饮酒》",},
{4,"现代小说家郁达夫的处女作是：","〈〈春城飞花〉〉","《春风沉醉的晚上》","〈〈薄奠〉〉","《沉沦》",},
{4,"下面谁是“竹林七贤”之一？","杜牧","李白","陆游","嵇康",},
{4,"古代的四书是指？","经、诗、书、史","经、史、春秋、书","经、史、子、易","经、史、子、集",},
{4,"现代作家中是谁进行了“立体化”语言的实验？","贾平凹","郁达夫","张爱玲","王蒙",},
{4,"“紫丁香一样的姑娘”是谁写的诗句？","徐志摩","舒婷","艾青","戴望舒",},
{4,"谁的诗在当时“传乎乐章,布在人口”,传世仅六首。","孟郊","岑参","李贺","王之涣",},
{4,"“黑夜给了我黑色的眼睛,我却用它来寻找光明。”选自？","《眼》","《黑夜》","《光明》","《一代人》",},
{4,"徐志摩 笔名是？","镜如","志摩","浪子","南湖",},
{4,"易安居士是谁的号？","陆游","柳永","辛弃疾","李清照",},
{4,"《东周列国志》共多少回？","78回","110回","85回","108回",},
{4,"露浓花瘦,薄汗轻衣透。 出自？","好事近","浣溪沙","菩萨蛮","点绛唇",},
{4,"“只缘感君一回顾,使我思君朝与暮”出自？","宋词三百首","诗经","唐诗三百首","古乐府",},
{4,"“风定落花深,帘外拥红堆雪。”出自谁？","苏轼","李商隐","李贺","李清照",},
{4,"“人悄悄,月依依,翠帘垂”出自？","浣溪沙","好事近","忆秦娥","诉衷情",},
{4,"《艺文类聚》的作者是谁？","司马迁","欧阳修","吴均","欧阳询",},
{4,"”风定落花深“得下一句是？","青缸暗明灭","长记海棠开後","正是伤春时节","帘外拥红堆雪",},
{4,"《东周列国志》的作者是？","鲁迅","司马迁","司马光","冯梦龙",},
{4,"诗魔是谁？","贾岛","杜甫","李白","白居易",},
{4,"隋洛文是谁用过的笔名？","白莽","田汗","朱自清","鲁迅",},
{4,"华阳居士是指谁？","李白","李清照","李格非","陶弘景",},
{4,"时刻准备着是谁提出的？","朱德","毛泽东","周恩来","列宁",},
{4,"不属于〈〈春秋三传〉〉的是：","〈〈春秋左氏传〉〉","〈〈公羊传〉〉","〈〈谷梁传〉〉","〈〈左传〉〉",},
{4,"“兰陵美酒郁金香,玉碗盛来琥珀光。”的作者是谁？","苏轼","白居易","杜甫","李白",},
{4,"诗豪是谁？","杜牧","白居易","李商隐","刘禹锡",},
{4,"空山不见人,但闻人语响的作者是谁?","杜甫","李白","白居易","王维",},
{4,"水浒英雄中扛帅旗的是？","曹正","安道全","李云","郁保四",},
{4,"《高老庄》是谁写的？","老舍","路遥","三毛","贾平凹",},
{4,"“争天下者必先争人”是谁的话？","荀子","墨子","孔子","管子",},
{4,"墨子哪国人？","赵","宋","秦","鲁",},
{4,"《闻笛赋》又名？","《三都赋》","《建安赋》","《两都赋》","《思旧赋》",},
{4,"胡笳指的是什么？","兵器","文章","菜名","乐器",},
{4,"下面不是《战国策》的别名的是 ？","《国策》","《国事》","《短长》","《国史》",},
{4,"寓言最早出现在那本书里？","《国语》","《战国策》","《孟子》","《庄子》",},
{4,"先秦文学分为几部分？","2","3","5","4",},
{4,"故荷戈驱驰,不遑宁处,前后陈表,于今历年矣“出自？","《清稿》","《元史》","《宋史》","《晋书》",},
{4,"以下哪部作品不是矛盾写的？","《过年》","《雾重庆拾零》","《清明前后》","《孤独》",},
{4,"《准风月谈》的作者是谁？","矛盾","朱自清","孙中山","鲁迅",},
{4,"《淮海居士长短句》是谁的作品？","辛弃疾","晏殊","姜夔","秦观",},
{4,"《巨人传》作者拉雷伯是哪国人？","意大利","英国","德国","法国",},
{4,"《水浒》中哪位“逢夏而擒,逢腊而执,听潮而圆,见信而寂”？","西门庆","林冲","武松","鲁智深",},
{4,"卡洛琳是下列哪本书中的人物","悲惨世界","老人与海","茶花女","廊桥遗梦",},
{4,"〈水浒〉中说仁宗是哪位大仙下凡？","武曲星","玉皇大帝","文曲星","赤脚大仙",},
{4,"以下哪部作品不是梁启超之作？","《西政丛书叙》","《论中国之强将》","《新中国未来记》","《中国人民的心》",},
{4,"李白的《嘲鲁儒》中诗“秦家丞相俯”的下一句是什么？","中自诛褒疸","世俗褒称实","周王伐有褒","不重褒衣人",},
{4,"日本著名作家川端康成的哪一篇作品于1968年获得了诺贝尔文学奖","<千鹤纸>","<古都>","<雪国>","<伊豆的歌女>",},
{4,"岩扉松径长寂寥,惟有幽人独来去。出自哪里?","舟中晓望","望洞庭湖赠张丞相","与诸子登岘首","夜归鹿门歌",},
{4,"小说《飘》的英文名《gone with the wind》出自谁的诗句？","雪莱","拜伦","伊丽莎白 巴雷特","欧内斯特",},
{4,"海明威的<<老人与海>>在哪一年获得了诺贝尔文学奖","1955","1952","1953","1954",},
{4,"一八七六年完稿的<<处女地>>是屠格涅夫六部长篇小说中的第几部","第五部","第四部","第三部","第六部",},
{4,"哪部小说不是茅盾作品《蚀》三部曲之一？","追求","幻灭","动摇","腐蚀",},
{4,"韩寒的作品最好的是哪一本?","<雨衣","<零下一度","<儿子韩寒","<三重门",},
{4,"威廉.福克纳原来叫什么","威廉.法克福","威廉.艾克纳","威廉.法福纳","威廉.法克纳",},
{4,"克努特.汉姆生的世界著名小说是","〈在林荫的小路上〉","〈大地硕果〉","〈畜牧神〉","〈维多利亚〉",},
{4,"挪威有史以来第一位获得国王颁发大十子奖的女子是","阿纳托尔.法朗士","格拉齐亚.黛莱达","克努特.汉姆生","西格丽特.温塞特",},
{4,"《水浒》作者施耐庵的原名是什么？","李竟","王有制","刘苑","郭勋",},
{4,"诺贝尔文学奖什么时候开始颁发","1903","1904","1902","1901",},
{4,"宋徽宗的原名？","赵子龙","赵成","赵安","赵佶",},
{4,"风吹柳花满店香,吴姬压酒劝尝。出自何人之手？","杜甫","孟浩然","岑叁","李白",},
{4,"梧桐相待老,鸳鸯会双死。作者是？","杜甫","李白","李清照","孟郊",},
{4,"《红玫瑰和白玫瑰》是谁的作品？","石评梅","苏青","琼瑶","张爱玲",},
{4,"<全唐诗>收录了唐诗多少首?","3万5千首","3万8千首","4万5千首","4万8千首",},
{4,"“落花有意意有情,流水无情情无意”作者是谁？","周海军","蔡德武","王振江","苏家锋",},
{4,"被称为现代文学界的泰斗是：","余杰","王朔","琼瑶","季羡林",},
{4,"我国第一部目录学著作是什么？","《目录》","《左传》","《国语》","《别录》",},
{4,"下列哪部不是贾谊的作品？","《鵩鸟赋》","《论陈政事疏》","《吊屈原赋》","《思旧赋》",},
{4,"“桃李春风一杯酒,江湖夜雨十年灯”一句是谁写的？","韩世忠","岳飞","陆游","黄庭坚",},
{4,"“夏虫不知冷冰”一语出自何处？","史记","庄子","列子","三国志",},
{4,"苏轼字什么？","子展","子","子菩","子瞻",},
{4,"诗歌《次北固山下》的作者是以下哪一位诗人？","贺知章","王维","李白","王湾",},
{4,"“明月装饰了你的窗子,你装饰了别人的梦”是谁的作品？","雪莱","舒婷","徐志摩","卞之琳",},
{4,"“人之患在好为人师”是谁说的？","孙子","孔子","庄子","孟子",},
{4,"“简洁是智慧的灵魂。”是谁说的？","爱迪生","富兰克林","爱因斯坦","莎士比亚",},
{4,"“虚伪的心不会有坚硬的腿。”是谁说的？","富兰克林","鲁迅","杜甫","莎士比亚",},
{4,"“不为人知的高尚行为,是最值得尊敬的。”是哪国的名言？","俄罗斯","美国","英国","法国",},
{4,"《断肠集》是哪个女词人所作？","蔡文姬","李清照","穆易夫人","朱淑真",},
{4,"宋朝女词人朱淑真一生悲叹自己嫁错人,她的丈夫是什么样的人？","地方恶霸","好赌败家之子","朝庭败类","村夫俗子",},
{4,"诸葛亮的《出师表》写于","224年","226年","225年","227年",},
{4,"愿化作青烟一屡,的上句是什么？","我值何人喜爱","我值何人关心","来去无阻无碍","我值何人怜爱",},
{4,"《生命中不可承受之轻》是谁写的？他是哪国人？","海明威   美国","雨果  法国","歌德  德国","米兰`昆德拉   捷克",},
{4,"《在云彩上面》这首诗适合在那个节日吟诵","教师节","八一建军节","国庆节","五一劳动节",},
{4,"戴望舒的成名作是","五月的鲜花","我用残损的手掌","航","雨巷",},
{4,"“天子一跬步皆关民命”是谁说的？","魏征","欧阳修","辛弃疾","蒲松龄",},
{4,"《资治通鉴》记载了多少年的历史？","1365","1364","1361","1362",},
{4,"《论语》有多少章？","21","19","18","20",},
{4,"下面哪个不是词牌《念奴娇》的又名？","《酹江月》","《百字会》","《大江东去》","《卜算子》",},
{4,"谁称李白为“谪仙人”？","孟浩然","杜甫","苏轼","贺知章",},
{4,"“才下眉头,却上心头。”出自谁的词？","苏轼","柳永","辛弃疾","李清照",},
{4,"闲梦远,南国正清秋；千里江山寒色暮……（作者）","杜牧","王维","李白","李煜",},
{4,"《逢雪宿芙蓉山主人》作者","杜牧","王维","李白","刘长卿",},
{4,"《白氏长庆集》是以什么命名的？","籍贯","官职","谥号","年号",},
{4,"“司马青衫”出自何处？","《扬琴行》","《笛箫行》","《古筝行》","《琵琶行》",},
{4,"《搜神记》的作者是谁？","郦道元","陆机","陈寿","干宝",},
{4,"刘基字是什么？","汝忠","子安","严易","伯温",},
{4,"北宋第一个专业词人是谁？","司马光","范仲淹","王安石","柳永",},
{4,"“生无可恋甘为鬼,来生再续未了缘”作者是谁？","蔡德武","潘武","江一华","苏家锋",},
{4,"“怅望梅花驿,凝情杜若洲。”的作者是谁？","李商隐","柳永","苏轼","范成大",},
{4,"司马光写《资治通鉴》花了多少年？","17","18","20","19",},
{4,"欧阳修的谥号是","文山","文公","文正","文忠",},
{4,"“知彼知己,百战不殆。”出自那里？","《汉书》","《史记》","《老子》","《孙子兵法》",},
{4,"曹雪芹写《红楼梦》花了多少年？","40年","20年","30年","10年",},
{4,"两水夹明镜,双桥落彩虹”描写的是哪里？","江苏镇江","浙江杭州","云南丽江","安徽宣城",},
{4,"屈原最后遗作是","《橘颂》","《九歌》","《离骚》","《怀沙》",},
{4,"“臣心一片磁针石”下一句是什么？","鬼神掌着生死权","借高枝炫耀自己","也不能屈辱的活","不指南方不肯休",},
{4,"《逢雪宿芙蓉山主人》作者是?","李商隐","李白","杜甫","刘长卿",},
{4,"成语“一决雌雄”是从谁的话中引出？","刘备","刘邦","曹操","项羽",},
{4,"别开生面出自谁的诗？","王安石","李白","王维","杜甫",},
{4,"闲梦远,南国正清秋；千里江山寒色暮……的作者是？","苏东坡","李白","李世民","李煜",},
{4,"诗经六艺指什么？","风雅颂词偶乐","风雅颂赋偶兴","风雅颂词比兴","风雅颂赋比兴",},
{4,"“兵不厌诈‘语出：","《左传》","《战国策》","《孙子兵法》","《韩非子》",},
{4,"鲁迅死于那一年？","1923","1943","1931","1936",},
{4,"“苾妃愁坐芝田馆,用尽陈王八斗才”是谁的诗：","柳永","李白","谢灵运","李商隐",},
{4,"哪一部小说不是我国四大讽刺小说","《蘖海花》","《官场现形记》","《二十年目睹之怪现状》","《儒林外史》",},
{4,"曹植七步为诗,请问七步诗共几句：","10","4","8","6",},
{4,"《诗经》收录了多少篇诗歌？","310","315","302","305",},
{4,"鲁迅出生在那一年？","1892","1891","1882","1881",},
{4,"《战国策》着重记载了策士谋臣的：","政治、外交","策略、攻略","军事、言论","策略、言论",},
{4,"《绿》的作者是谁？","郭沫若","老舍","冰心","朱自清",},
{4,"下列那部作品不是古典十大悲剧之一？","《精忠旗》","《赵氏孤儿》","《精忠谱》","《墙头马上》",},
{4,"《方圆阐幽》的作者是：","冯如","华衡芳","徐寿","李善兰",},
{4,"“匈奴未灭,何以家为”是谁的名言？","狄青","卫青","李广","霍去病",},
{4,"下面哪部不是“四史”之一？","《三国志》","《汉书》","《后汉书》","《吕氏春秋》",},
{4,"世界上第一部科幻小说《月球旅行》的作者是","托勒密","儒勒·凡尔纳","哥白尼","开普勒",},
{4,"曹操月明星稀,乌鹊南飞,绕树三匝,何枝可依 中 乌鹊喻指","孩子","自已","军队","贤才",},
{4,"“蒙太奇”一语源与哪国","德国","英国","意大利","法国",},
{4,"西湖白堤是为了纪念哪为诗人的","韩愈","李白","杜甫","白居易",},
{4,"“潜龙勿用”这个词出自哪里？？","《水浒》","《汉书》","《孙子兵法》","《易经》",},
{4,"《梧桐雨》的作者是：","马致远","王实甫","关汉卿","白朴",},
{4,"“玩人丧德,玩物丧志”出自？","《诸蕃志》","《宋史.鲁宗道传》","《莲社高贤传》","《尚书.旅獒》",},
{4,"《浮生六记》的作者是谁？","李渔","袁枚","冒辟疆","沈复",},
{4,"“卖炭翁”出自下列哪本书?","<<白氏长庆集>>","<<唐诗三白首>>","<<全唐诗>>","<<新乐府>>",},
{4,"下列哪位作家不是《三叶集》的作者？","宗白华","郭沫若","田汉","郁达夫",},
{4,"哪位诗人被称作为“鼓点诗人”？","殷夫","艾青","臧克家","田间",},
{4,"李清照一生中最后一首词作的词牌名是什么","如梦令","蝶恋花","怨王孙","永遇乐",},
{4,"以下哪一篇是钱钟书的文章？","拿来主义","朋友","过年","论复古",},
{4,"顾恺之的小名是","胖儿","鹅黄","阿狗","虎头",},
{4,"“昆仑山高邙山矮,禹王马蹄长青苔”是谁的诗","徐志摩","艾青","田间","贺敬之",},
{4,"玉蝴蝶是谁写的？","孟浩然","谢霆锋","李白","柳永",},
{4,"<<新嫁娘词>>的作者","王昌龄","王涛","王维","王建",},
{4,"按体裁分小说有：话本,章回,日记体和什么？","历史","文言","白话","书信",},
{4,"“南亭亭长”指的谁？","陆游","龚自珍","于谦","李宝嘉",},
{4,"“故人入我梦,明我长相忆。君今在罗网,何以有羽翼？”中“故人”是指：","岑参","杜甫","王建","李白",},
{4,"多宝塔是谁的碑帖？","曹乐","柳公权","王羲之","颜真卿",},
{4,"诗句“秋风萧瑟天气凉,草木摇落露为霜”是谁写的？","孔融","曹操","曹植","曹丕",},
{4,"“我住长江头,君住长江尾”出自何处","李清照的〈声声慢〉","柳永的〈蝶恋花〉","欧阳修的〈蝶恋花〉","李之仪的〈卜算子〉",},
{4,"中国30年代有“洛珈山美人”之称的著名女性作家是：","席绢","肖红","琼瑶","凌叔华",},
{4,"刘禹锡的怀古名作<<金陵五题>>不包括?","<<江令宅>>","<<石头城>>","<<乌衣巷>>","<<西塞山怀古>>",},
{4,"“多少蓬莱旧事,空回首、烟霭纷纷。”出自谁？","周邦彦","辛弃疾","晏殊","秦观",},
{4,"“满目山河空念远,落花风雨更伤春。不如怜取眼前人。”是谁的 诗句？","欧阳修","姜夔","秦观","晏殊",},
{4,"福尔摩斯一生唯一敬佩的女子出现在哪桩案子里？","血字的研究","蓝宝石案","单身贵族案","波希米亚丑闻",},
{4,"谁被称为“纯推理小说之父”？","石原慎太郎","镰田敏夫","远藤周作","江户川乱步",},
{4,"古代“期颐”指多少岁？","六十岁","九十岁","八十岁","一百岁",},
{4,"<毛利姑娘>的作者若埃尔.希利亚德来自:","荷兰","英国","法国","新西兰",},
{4,"以下那部作品不是林语堂的？","中华的国民性","女人","我的戒烟","论经济",},
{4,"中国最早的文人五言试《咏史》的作者是：","司马相如","班超","孔子","班固",},
{4,"喜剧之父阿里斯托芬代表作是什麽？","〈日子〉","〈和平鸽〉","〈堂吉诃德〉","〈鸟〉",},
{4,"“濂溪”先生是指的哪位文人？","韩愈","刘禹锡","王安石","周敦颐",},
{4,"世界上第一部关于光学的书是什么？","《光焰》","《大学》","《孔子》","《墨经》",},
{4,"孙策被谁的家客行刺？","严白虎","袁术","张济","许贡",},
{4,"《送子天王图》是我国哪位著名画家的作品？","顾闳中","顾恺之","荆浩","吴道子",},
{4,"下面哪一首诗不是王维所作？","《少年行》","《老将行》","《观猎》","《雁门太守行》",},
{4,"《乞力马扎罗的雪》是谁所做？","荻耿斯","鲁迅","夏洛蒂","海明威",},
{4,"别开生面”（出自谁的诗）","苏轼","李白","苏洵","杜甫",},
{4,"李白的哪两首词被称为“百代词曲之祖”？","《声声慢》《忆秦娥》","《菩萨蛮》《江成子》","《江成子》《声声慢》","《菩萨蛮》《忆秦娥》",},
{4,"《白雪歌送武判官归京》是唐朝边塞诗人谁的作品？","白居易","李白","杜普","岑参",},
{1,"“宜将剩勇追穷寇,不可沽名学霸王”是谁的诗句","毛泽东","陈毅","周恩来","彭德怀",},
{1,"《镜花缘》是谁写的？","李汝珍 ","蒲松龄","吴敬梓","孙洙",},
{2,"“问君能有几多愁,恰似一江春水向东流”是谁的诗句","李白","李煜","苏东坡","柳永",},
{3,"“天生我才必有用”是谁的诗句","杜牧","杜甫","李白","贺之章",},
{1,"《静静的顿河》的作者是","肖霍洛夫","高尔基","奥斯特洛夫斯基","绥斯绥耶夫斯基",},
{4,"水浒传中放走108星的人是","宋帝","宿太尉","高太尉","洪太尉",},
{1,"“大夫”在我国古代是指","官职","医生","丈夫","侍卫",},
{1,"福尔摩斯探案全集是哪国人写的？","英国","美国","法国","意大利",},
{4,"陆游是什么时代的诗人","唐末","北宋","唐初","南宋",},
{2,"“人有悲欢离合,月有阴晴圆缺”是谁的诗句","李白","苏轼","岳飞","柳宗元",},
{3,"“蜀道之难难于上青天”出自谁的作品？","杜甫","龚自珍","李白","辛弃疾",},
{1,"资治通鉴的作者是谁？","司马光","王安石","司马迁","陆游",},
{4,"“乘风破浪会有时,直挂云帆济沧海”是谁的名句","王维","李商隐","李贺","李白",},
{1,"“满纸荒唐言,一把辛酸泪”出自那部作品","红楼梦","三国演义","水浒传","西游记",},
{2,"“曾经沧海难为水,除却巫山不是云”是谁的诗句？","刘禹锡","元稹","白居易","郁达夫",},
{1,"“抽刀断水水更流,举杯消愁愁更愁”的作者是","李白","孟浩然","佚名","杜牧",},
{1,"“所谓伊人,在水一方”摘自","诗经","离骚","史记","春秋",},
{1,"“笔落惊风雨,诗成泣鬼神“是谁的诗","杜甫","元稹","崔颢","欧阳修",},
{2,"“物是人非事事休,欲语泪先流”是谁的作品","雷震","李清照","李煜","秋瑾",},
{2,"“夕阳无限好,只是近黄昏”是谁的诗句？","李白","李商隐","杜牧","白居易",},
{1,"《捕蛇者说》的作者是","柳宗元","白居易","杜甫","司马光",},
{3,"《卖炭翁》的作者是","李白","杜甫","白居易","柳宗元",},
{4,"“晴川历历汉阳树,芳草萋萋鹦鹉洲”是哪首诗里的？","登鹳雀楼","长干行","登乐游原","黄鹤楼",},
{1,"曹雪芹是哪族人","满","蒙 ","清","回",},
{1,"《西游记》多少回","100","120","80","160",},
{4,"《飘》中的战争为","二战","独立战争","一战","南北战争",},
{2,"柳暗花明又一村是谁的诗句","李白","陆游","刘雨锡","孟浩然",},
{1,"“七步诗”是谁做的？","曹植","曹操","曹丕","刘备",},
{2,"我国第一部断代史书是？","史记","汉书","资治通鉴","后汉书",},
{1,"《聊斋志异》的作者","蒲松龄","杜甫","关汉卿","李白",},
{3,"哪个是田园诗人的代表","岑参","曹植","陶渊明","杜牧",},
{4,"以悲壮豪迈的边塞诗著称的是","白居易","王维","陶渊明","岑参",},
{1,"《少年维特之烦恼》的作者是","歌德","列夫.托尔斯泰","泰戈尔","啊.托尔斯泰",},
{4,"谁不是初唐三大书法家","褚遂良","欧阳洵","虞世南","王羲之",},
{3,"才下眉头,却上心头。是谁的词?","苏轼","琼瑶","李清照","柳永",},
{1,"“人生自古谁无死,留取丹心照汗青”是谁的诗句","文天祥","岳飞","林则徐","陆游",},
{2,"“将军百战死,壮士十年归”出自哪部作品","燕歌行","木兰诗","观猎","出塞",},
{2,"“爆竹声中一岁除”是谁的诗","李清照 ","欧阳修","王安石","王国维",},
{1,"“芳草无情,更在斜阳外”是谁的作品","范仲淹","岑参","王阳明","李清照",},
{1,"鲁迅原名","周树人","周作人","周树堂","周纪年",},
{1,"“生当作人杰,死亦为鬼雄”出自谁的作品？","李清照","项羽","李白","刘邦",},
{3,"下面哪个不是“唐宋八大家”之一？","柳宗元 ","欧阳修","李白","苏轼",},
{1,"中国最早的文言志怪小说是：","搜神记","世说新语","聊斋志异","西游记",},
{1,"《史记》是谁写的","司马迁 ","司马光","王安石","柳宗元",},
{2,"知否？知否？ 应是绿肥红瘦。由谁所写?","三毛","李清照","琼瑶","柳永",},
{1,"“清明时节雨纷纷,路上行人欲断魂”是谁的作品","杜牧","杜甫","李煜","李商隐",},
{3,"《茶馆》的作者","曹禺","巴金","老舍","茅盾",},
{4,"“国破山河在,城春草木深”是谁的名句？","李白","岳飞","陆游","杜甫",},
{2,"“凤凰台上凤凰游,凤去楼空江自流”是谁的作品","解缙","李白","佚名","李颀",},
{1,"“无人信高洁,谁为表予心”的作者是","骆宾王","李白","张先","韩愈",},
{1,"但丁是哪国人","意大利","法国","希腊","土耳其",},
{1,"诸子百家具体一共有多少家","189","240","201","199",},
{2,"我国古代四大名著中,哪一部是分别由两个人完成的？","《西游记》","《红楼梦》","《水浒传》","《三国演义》",},
{3,"《多收了三五斗》是谁的作品？","钱百村 ","赵树理","叶圣陶","老舍",},
{3,"停车坐爱枫林晚,霜叶红于二月花","李白","杜甫","杜牧","李清照",},
{2,"我见青山多妩媚,料青山,见我应如是","李清照","辛弃疾 ","李白","曾晶晶",},
{1,"老通宝是谁笔下的人物？","茅盾","老舍","曹禺","鲁迅",},
{1,"希腊与特洛伊之间十年的战争是为何而起？","美女海伦","宙斯的神秘宝藏","第三只地狱之犬","阿喀琉斯的战甲",},
{4,"顾炎武的字是？","亭风","风月人","林之","亭林",},
{4,"《套中人》的作者","周国平","莫泊桑","巴金","契诃夫",},
{3,"借问酒家何处有,牧童遥指杏花村是谁的诗句？","李白","王维","杜牧","白居易",},
{1,"《王贵与李香香》是谁的作品？","李季","赵树理","李广田 ","以上答案都不是",},
{2,"“到黄昏,点点滴滴,这次第,怎一个愁字了得？”是谁的作品","辛弃疾 ","李清照 ","苏轼","晏殊",},
{2,"曾经沧海难为水,除却巫山不是云是谁的诗?","李白","元稹","李商隐 ","杜牧",},
{2,"《牡丹亭》是谁的作品？","郑祖光 ","汤显祖","王实甫","白朴",},
{1,"《格萨尔》是哪个民族的史诗？","藏","蒙古","维吾尔","傣",},
{1,"作家周作人是哪儿人","绍兴人","北京人","余州人","淮北人",},
{3,"关汉卿是今天哪里人？","上海","天津","北京","重庆",},
{4,"“采菊东篱下,悠然见南山”出自？","刘禹锡","王维","苏轼","陶渊明",},
{1,"下面哪部不是司马相如的作品？","《洛神赋》","《子虚赋》","《上林赋》","《哀秦二世赋》",},
{2,"“身无彩凤双飞翼,心有灵犀一点通”出自谁？","柳宗元","李商隐","白居易","欧阳修",},
{4,"<<庭院里的女人>>一书作者是","冰心 ","李唯心","丁玲","李月红",},
{4,"《彷徨》是谁的作品？","蒲松龄","金庸","冰心","鲁迅",},
{1,"“东风夜放花千树,更吹落,星如雨。”的词牌是什么？","《青玉案》","《临江仙》","《暗香》","《好事近》",},
{3,"请问,《再别康桥》是谁的作品？","于秋雨","钱钟书","徐志摩","陆华",},
{3,"“不能正其身,如正人何？”出自：","《庄子》","《孟子》","《论语》","《墨子》",},
{1,"“午”所对应的生肖是哪一个？","马 ","羊","牛 ","虎",},
{1,"下列哪部作品不是徐志摩写的？","《红烛》","《猛虎集》","《翡冷翠的一夜》","《志摩的诗》",},
{2,"民主革命思想宣传家邹容的代表作是","猛回头","革命军","警世钟","驳康有为论革命书",},
{2,"“流水落花春去也,天上人间”出自谁口？","李清照","李煜","柳永","秦少游",},
{4,"《九三年》的作者是谁？","莫伯桑","大仲马","小仲马","雨果",},
{4,"“一桥飞架南北,天堑变通途”是谁的诗句？","刘少奇 ","周恩来","朱德","毛泽东",},
{1,"《女神》的作者是谁？","郭沫若","屈原","徐志摩","闻一多",},
{2,"朱自清的名作“背影”抒发对谁的感情？","妻子","父亲","母亲","子女",},
{2,"“三姓家奴”是指《三国演义》中的何人？","董卓","吕布 ","太史慈 ","张飞",},
{4,"《第一次的亲密接触》一书作者是","蔡恒智 ","痞子","蔡痞子 ","蔡智恒",},
{1,"“今人为刀俎,我为鱼肉”为何人说的？","樊哙","刘邦","项庄","韩信",},
{1,"“出师未捷身先死”指的是谁？","诸葛亮","岳飞","文天祥","袁崇焕",},
{1,"不是中国四大民间传说的是","木兰从军","白蛇传","梁山伯与祝英台","牛郎织女",},
{4,"白居易的字是","放翁","子美","太白","乐天",},
{1,"中国古代""""四书五经""""中的""""四书""""是指《论语》、《孟子》、《大学》和：","《中庸》","《金瓶梅》","《老子》","《逍遥子》",},
{4,"《藤王阁序》的作者是：","李志立","李藤","王维","王勃",},
{2,"“劝君更进一杯酒,西出阳关无故人”是谁的诗句？","李白","王维","杜甫","白居易",},
{3,"“对酒当歌,人生几何？”是谁写的？","周瑜","孔明","曹操","黄盖",},
{1,"诗佛、诗仙、诗鬼分别是指：","王维、李白、李贺","王维、李白、杜甫","李贺、李白、王维","杜牧、杜甫、李白",},
{1,"“初唐四杰”中有：","王勃","李龟年","王维","李白",},
{4,"“茅盾”是一位作家的名字,这位作家的原名是：","李德","沈德鸿","李沛甘","沈雁冰",},
{4,"《奥德赛》的主人公：","玛基斯","普罗米修斯","普鲁斯","俄底修斯",},
{3,"被誉为“美国生活的幽默的百科全书”的是：","普鲁斯","海明威","欧·亨利","伟易达",},
{1,"我国在公元868年首部印刷出版,属于世界上首次的书是：","《金刚经》","《诗经》","《源氏物种》","《草本纲目》",},
{4,"创作出歌剧《魔笛》的是：","普鲁斯","贝多芬","肖邦","莫扎特",},
{4,"《吕氏春秋》的内容主要是关于儒和：","论 ","法","经 ","道 ",},
{4,"最近获得诺贝尔文学奖的华人作家高行健的代表作品是：","《我的奋斗》","《火山》","《逃亡》","《灵山》",},
{2,"“尺有所长,寸有所短”出自：","李白的诗","《史记》","《诗经》","杜甫的诗",},
{2,"“书不必起仲尼之门”语出：","李商隐","陆贾","杜牧","日本",},
{1,"“刻舟求剑”出自于：","《吕氏春秋》","《史记》","《野火春风斗古城》","《诗经》",},
{3,"海明威获诺贝尔奖是在：","1960年","1969年","1954年","没获过",},
{1,"名句“忽如一夜春风来,千树万树梨花开。”是谁写的？","岑参","杜甫","李白","王维",},
{1,"“孤舟蓑笠翁,独钓寒江雪”是出自于哪位大诗人的手笔？","柳宗元","韩愈","李贺","王维",},
{1,"我国古代小说中人物形象最多的是哪一部？","《红楼梦》","《水浒传》","《三国志》","《西游记》",},
{1,"《红楼梦魇》的作者是：","张爱玲","张丽","鲁迅","老舍",},
{1,"诗歌“有的人活着,可是他已经死了。有的人死了,但他还活着。”作者是：","臧克家 ","鲁迅","茅盾","老舍",},
{3,"莎士比亚是什么时代的作家？","15世纪","16世纪","17世纪","14世纪",},
	};

	CContainer * ob;
	CVector sname;
	int how,i;
	CMapping * skl = me->query_skills();
	if(! strlen(ask))
	{
		if (me->query("combat_exp") < 3000 || me->query("mud_age") < 18000)
		{
			say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
			SendMenu(me);
			return 1;
		}
		if (me->query("combat_exp") >=3000 ) 
		{
			how = 0;
			skl->keys(sname);
			for(i=0; i< sname.count(); i++)
			if (skl->query(sname[i]) >= 10) how ++;
			if(how < 5)
			{
				say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
				SendMenu(me);
				return 1;
			}
		} 
		if(me->query("exam/exam3_count")>10)
		{
			say("你已经参加过了考试了,就不要再来了吧！",me);
			SendMenu(me);
			return 1;
		}
		say("准备好,考试要开始了。每个人只有一次机会，总共可以选择回答十道题目。要注意中途退出可是要算你弃权的哟！", me);
		AddMenuItem("开始考试","y", me);
		AddMenuItem("还是算了吧", "n", me);
	}
	else if(strcmp(ask, "y") == 0)
	{
		if (me->query("combat_exp") < 3000 || me->query("mud_age") < 18000)
		{
			say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
			SendMenu(me);
			return 1;
		}
		if (me->query("combat_exp") >=3000 ) 
		{
			how = 0;
			skl->keys(sname);
			for(i=0; i< sname.count(); i++)
			if (skl->query(sname[i]) >= 10) how ++;
			if(how < 5)
			{
				say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
				SendMenu(me);
				return 1;
			}
		} 
		int idx= random(1479);
		me->set("exam/exam3_key",exam[idx].key);
		me->add("exam/exam3_count", 1);
		me->add("exam/exam3_n", 1);
		if(me->query("exam/exam3_count")>10)
		{
			say("你已经参加过了考试了,就不要再来了吧！",me);
			SendMenu(me);
			return 1;
		}
		say(snprintf(msg,255,"第%d题(正确：%d/10题,)：",me->query("exam/exam3_count"),me->query("exam/exam3_y")),me);
		say(exam[idx].title,me);
		AddMenuItem(exam[idx].key1, "1", me);
		AddMenuItem(exam[idx].key2, "2", me);
		AddMenuItem(exam[idx].key3, "3", me);
		AddMenuItem(exam[idx].key4, "4", me);
	}
	else if(strcmp(ask, "n") == 0)
	{
		return 1;
	}
	else if(strcmp(ask, "1") == 0)
	{
		if(me->query("exam/exam3_key")==1)
		{
			say("恭喜你,答对了这一题。", me);
			me->add("exam/exam3_y", 1);
			me->add("exam/exam3_n", -1);
			me->del("exam/exam3_key");
		}
		else
		{
			say("对不起,你回答错了。", me); 
			me->del("exam/exam3_key");
		}
		if(me->query("exam/exam3_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam3_y")>=6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam3_y"));
				me->add("combat_exp", 888*me->query("exam/exam3_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam3_y"),16888*me->query("exam/exam3_y")),me);
				if(me->query("exam/exam3_y")>=8)
				{
					me->add("per",1);
					tell_object(me, snprintf(msg, 255, "$HIY由于考试成绩优异,你另外获得了永久增加一点魅力的奖励。"));
					message_vision( "$HIR只见金光一闪,$N顿时容光焕发,光彩照人。" , me);
				}
				if(me->query("exam/exam3_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam3_y"));
				me->add("combat_exp", 666*me->query("exam/exam3_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam3_y"),10888*me->query("exam/exam3_y")),me);
			}
			
			if(me->query("exam/exam3_y")==10)
			{
				me->set("exam/exam3",1);
			}
			me->del("exam/exam3_y");
			me->del("exam/exam3_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1)
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异,因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "2") == 0)
	{
		if(me->query("exam/exam3_key")==2)
		{
			say("恭喜你,答对了这一题。", me);
			me->add("exam/exam3_y", 1);
			me->add("exam/exam3_n", -1);
			me->del("exam/exam3_key");
		}
		else
		{
			say("对不起,你回答错了。", me); 
			me->del("exam/exam3_key");
		}
		if(me->query("exam/exam3_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam3_y")>=6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam3_y"));
				me->add("combat_exp", 888*me->query("exam/exam3_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam3_y"),16888*me->query("exam/exam3_y")),me);
				if(me->query("exam/exam3_y")>=8)
				{
					me->add("per",1);
					tell_object(me, snprintf(msg, 255, "$HIY由于考试成绩优异,你另外获得了永久增加一点魅力的奖励。"));
					message_vision( "$HIR只见金光一闪,$N顿时容光焕发,光彩照人。" , me);
				}
				if(me->query("exam/exam3_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam3_y"));
				me->add("combat_exp", 666*me->query("exam/exam3_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam3_y"),10888*me->query("exam/exam3_y")),me);
			}
			
			if(me->query("exam/exam3_y")==10)
			{
				me->set("exam/exam3",1);
			}
			me->del("exam/exam3_y");
			me->del("exam/exam3_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1)
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异,因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "3") == 0)
	{
		if(me->query("exam/exam3_key")==3)
		{
			say("恭喜你,答对了这一题。", me);
			me->add("exam/exam3_y", 1);
			me->add("exam/exam3_n", -1);
			me->del("exam/exam3_key");
		}
		else
		{
			say("对不起,你回答错了。", me); 
			me->del("exam/exam3_key");
		}
		if(me->query("exam/exam3_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam3_y")>=6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam3_y"));
				me->add("combat_exp", 888*me->query("exam/exam3_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam3_y"),16888*me->query("exam/exam3_y")),me);
				if(me->query("exam/exam3_y")>=8)
				{
					me->add("per",1);
					tell_object(me, snprintf(msg, 255, "$HIY由于考试成绩优异,你另外获得了永久增加一点魅力的奖励。"));
					message_vision( "$HIR只见金光一闪,$N顿时容光焕发,光彩照人。" , me);
				}
				if(me->query("exam/exam3_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam3_y"));
				me->add("combat_exp", 666*me->query("exam/exam3_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam3_y"),10888*me->query("exam/exam3_y")),me);
			}
			
			if(me->query("exam/exam3_y")==10)
			{
				me->set("exam/exam3",1);
			}
			me->del("exam/exam3_y");
			me->del("exam/exam3_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1)
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异,因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "4") == 0)
	{
		if(me->query("exam/exam3_key")==4)
		{
			say("恭喜你,答对了这一题。", me);
			me->add("exam/exam3_y", 1);
			me->add("exam/exam3_n", -1);
			me->del("exam/exam3_key");
		}
		else
		{
			say("对不起,你回答错了。", me); 
			me->del("exam/exam3_key");
		}
		if(me->query("exam/exam3_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam3_y")>=6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam3_y"));
				me->add("combat_exp", 888*me->query("exam/exam3_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam3_y"),16888*me->query("exam/exam3_y")),me);
				if(me->query("exam/exam3_y")>=8)
				{
					me->add("per",1);
					tell_object(me, snprintf(msg, 255, "$HIY由于考试成绩优异,你另外获得了永久增加一点魅力的奖励。"));
					message_vision( "$HIR只见金光一闪,$N顿时容光焕发,光彩照人。" , me);
				}
				if(me->query("exam/exam3_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam3_y"));
				me->add("combat_exp", 666*me->query("exam/exam3_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam3_y"),10888*me->query("exam/exam3_y")),me);
			}
			
			if(me->query("exam/exam3_y")==10)
			{
				me->set("exam/exam3",1);
			}
			me->del("exam/exam3_y");
			me->del("exam/exam3_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1)
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异,因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	SendMenu(me);
	return 1;
}

NPC_END;




