// wiz_teacher1.h 武侠考官

NPC_BEGIN(CNwiz_teacher1);

virtual void create()
{
	set_name("柳风影", "liou fen ying");
	set("title", "中州神侠");
	set("long","节日快乐，让我考考你的江湖经历，答对了有好东东送哦。");
	set("gender", "男性");
	set("age", 75);
	set("class", "scholar");
	set("attitude", "friendly");
	set("shen_type", 1);
	set("str", 40);
	set("int", 40);
	set("con", 40);
	set("dex", 40);
	set("per", 40);
 	set("icon",young_man1);
	
	set("max_hp", 15500);
	set("mp", 3000);
	set("max_mp", 5000);
	set("mp_factor", 100);
	set("combat_exp", 10000000);
	set("score", 200000);
}


int do_talk(CChar * me, char * ask = NULL)
{
	char msg[255];
	static struct{
		int key;											//正确答案
		char title[255];									//题目
		char key1[255],key2[255],key3[255],key4[255];		//答案
	}exam[1266] = {
{1,"杨过黯然销魂掌的“杞人忧天”一招出现在神雕侠侣第几回?","34","36","43","33",},
{1,"木剑是独孤大侠用剑的第几个阶段?","4","5","6","7",},
{1,"杨过让郭襄说了几个“大英雄”?","5","6","7","8",},
{1,"据倚天屠龙记记载，明朝共存在了多少年?","277","276","271","278",},
{1,"倚天屠龙记中峨嵋派静字辈共有多少尼姑?","12","13","14","15",},
{1,"倚天屠龙记中神秘黄衫女子救谢逊时带了几个随从?","8","9","7","6",},
{1,"武当长拳共有多少式?","32","33","34","35",},
{1,"左冷禅时期的嵩山派共有几路剑法?","17","18","19","20",},
{1,"玄铁剑是独孤大侠用剑的第几个阶段?","3","4","5","6",},
{1,"李文秀在大漠共生活了多少年?","12年","13年","14年","15年",},
{1,"金庸著第一部小书的时间?","1956","1965","1955","1966",},
{1,"在《神雕侠侣》中，为了阻挠郭靖返回襄阳，金轮法王射出了多少箭?","5箭","6箭","7箭","8箭",},
{1,"霍青桐爱穿什么颜色的衣服?","黄","红","黑","灰",},
{1,"虚竹和梦姑在冰窑中相聚了几天?","3","4","5","6",},
{1,"年?月金庸出版了《香港的前途--明报社评之一》一书?","9月","10月","8月","7月",},
{1,"辟邪剑法有几路?","72","108","36","56",},
{1,"李沅芷出场时几岁?","14","15","16","17",},
{1,"打狗棒除了36招外，还有几字诀?","8","9","10","11",},
{1,"黄药师一生一共有几个弟子?","7","8","9","10",},
{1,"黄蓉是丐帮第几任帮主?","19","20","21","22",},
{1,"萧峰与段愈结拜时几岁?","31","33","30","32",},
{1,"虚竹比段玉大约大几岁?","3","4","5","6",},
{1,"岳灵珊和左冷禅比剑时打了几招?","13","14","15","16",},
{1,"周伯通与黄药师比赛打弹子一共挖了几个洞?","18","19","20","21",},
{1,"金庸写了15部小说后，哪一年他就闭门封刀，不写武侠小说了?","1972","1973","1974","1975",},
{1,"小龙女为等杨过在蜜蜂翅膀上刻了几个字?","6","7","8","9",},
{1,"段誉有几个亲妹妹? ","一个也没有","5个","4个","3个",},
{1,"郭靖在一开始拜谁为师? ","江南七怪","江南六怪","丘处机","柯镇恶",},
{1,"情花毒用什么草药可解?  ","断肠草","断情丹","绝情草","情花的果",},
{1,"洪七公在华山上给杨过吃什么了? ","蜈蚣","鸡","蝎子","蚯蚓",},
{1,"金庸没有从事过的职业是什么?  ","出版","社评","办报","写小说",},
{1,"金庸作品的主角中谁与他的籍贯相同? ","陈家洛","韦小宝","袁承志","令狐冲",},
{1,"韦小宝和苏非娅是在什么地方第一次见面的? ","在亚克莎城的秘道里","在看守小屋里","在莫斯科城外","在神龙岛",},
{1,"《笑傲江湖》中最先出场的是?","林平之","岳灵珊","林震南","余沧海",},
{1,"《天龙八部》中“咱们学武之人，第一不可滥杀无辜”这句话出自谁口? ","乔峰","虚竹","段誉","王语嫣",},
{1,"杨过是何派弟子? ","古墓派","昆仑派","全真派","无门派",},
{1,"金庸的第一部小说叫什么? ","《书剑恩仇录》","《射雕英雄传》","《侠客行》","《碧血剑》",},
{1,"侠客行中的石破天，是谁的儿子? ","石清和闵柔","石清和闵静","石辛和闵柔","石辛和闵静",},
{1,"东方不败是死在谁手里? ","任我行","令狐冲","任盈盈","向问天",},
{1,"张三丰90岁生日时，他哪一位弟子被砍段手脚? ","俞岱岩","殷黎亭","张翠山","俞莲舟",},
{1,"与岳不群争夺“五岳盟主”之位的是谁? ","左冷禅","令狐冲","任我行","莫大先生",},
{1,"杨康被谁所伤? ","被黄蓉的软猬甲所伤","被欧阳峰的蛇所杀","被郭靖的小刀所杀","被丘处机所杀",},
{1,"吴六奇是天地会哪个堂的堂主? ","洪顺堂红旗香主","莲花堂红旗香主","赤火堂红旗香主","青木堂红旗香主",},
{1,"岳不群的妻子叫甚么名字? ","宁中则","宁清","宁正则","宁柔",},
{1,"第一个向杨过传授武功的人是谁? ","穆念慈","郭靖","杨康","丘处机",},
{1,"《射雕英雄传》中西毒欧阳锋曾使用那一种毒药杀海中的鲨鱼? ","蛇毒","化尸粉","鹤顶红","逍遥三步颠",},
{1,"山西一窟鬼中的长须鬼原名叫甚么? ","樊一翁","樊十翁","樊九翁","樊大翁",},
{1,"顺治在给康熙的《四十二章经》首页中写了句甚么话? ","永不加赋","永不扰民","仁义爱民","仁义治国",},
{1,"赵敏手下三大高手中，阿二、阿三的师祖是谁? ","叛寺的火工头陀","昆仑三圣何足道","西域少林苦慧禅师","少林派苦智禅师",},
{1,"赏善罚恶令的使者最初以甚么化名出现? ","张三、李四","赵大，刘二","王五，郑六","吴七，陈八",},
{1,"红花会八当家外号甚么? ","铁塔","金刀","银枪","铜墙",},
{1,"《鹿鼎记》中，少林寺的和尚以哪八个字作辈份的排列?","大觉观晦，澄净华严","苦觉观晦，澄净玄严","空觉观晦，澄净玄严","方觉观晦，澄净华严",},
{1,"胡一刀妻子的表哥所居的山庄叫甚么名字? ","玉笔山庄","玉树山庄","银镜山庄","银剑山庄",},
{1,"绰号甘霖惠七省的是谁? ","汤沛","杨根","盖一鸣","周威信",},
{1,"1953年，哪两个门派的掌门人比武，触发了梁羽生写武侠小说?","太极门和白鹤门","武当派和少林派","少林派和太极门","螳螂门和武当派",},
{1,"杨过黯然销魂掌的“杞人忧天”一招出现在神雕侠侣第几回? ","34","31","32","33",},
{1,"金庸封笔之后，开始专心写什么? ","社论","杂文","散文","日记",},
{1,"“春波碧草，晓寒深处，相对浴红衣”是哪部小说中的词?","射雕英雄传","神雕侠侣","书剑恩仇录","碧血剑",},
{1,"“源思英儿，巴巴西洛着，雪陆文兵”这句话是哪里的?","九阴真经","九阳真经","乾坤大挪移","六脉神剑",},
{1,"射雕英雄专中描写天下至柔的拳术是： ","空明拳","太极拳","云手","落英神剑掌",},
{1,"第二次华山论剑中，欧阳峰咬了黄药师什么部位? ","右手食指","左手食指","右手中指","左手中指",},
{1,"梁子翁是哪部小说中的人物? ","射雕英雄传","碧血剑","神雕侠侣","天龙八部",},
{1,"东天龙门北宗新接任的掌门人是： ","曹云奇","刘元鹤","熊元献","陶子安",},
{1,"韦小宝是什么民族? ","未知","汉","蒙古","回",},
{1,"「返腕翼德闯帐」是谁的剑招? ","苗人凤","胡一刀","胡斐","苗若兰",},
{1,"田青文的师哥是： ","曹云奇","陶子安","刘元鹤","熊元献",},
{1,"保定帝座下大理国司空是： ","巴天石","高升泰","华赫良","范骅",},
{1,"在天龙寺段誉哪个穴位被大轮明王拿住尔被擒?","神封穴","大椎穴","命门穴","风市穴",},
{1,"萧峰被辽国皇帝囚于铁笼，有多少士兵看守? ","100","200","500","2000",},
{1,"看守萧峰的士兵，拿什么武器? ","长矛","长枪","大刀","长戈",},
{1,"天龙八部中守雁门关的宋军将领姓什么?","张","李","王","吴",},
{1,"黄药师的大弟子是谁? ","陆乘风","陈玄风","陈默风","曲灵风",},
{1,"郭靖第一个杀死的人是谁？  ","陈玄风","梅超风","陆乘风","陈默风",},
{1,"李文秀几岁失去父母? ","8","6","7","9",},
{1,"哈卜拉姆是哪部小说中的人物? ","白马啸西风","神雕侠侣","书剑恩仇录","鹿鼎记",},
{1,"徐天宏排行第几? ","7","6","5","4",},
{1,"王剑英是那个门派的高手? ","八卦门","白鹤门","太极门","连环门",},
{1,"瑛姑姓什么？ ","刘","李","赵","陈",},
{1,"卫天望是哪部小说中的人物? ","倚天屠龙记","书剑恩仇录","鹿鼎记","天龙八部",},
{1,"倚天屠龙记中，少林寺罗汉堂首座是： ","无色禅师","空闻禅师","空色禅师","无觉禅师",},
{1,"黄易的“大唐双龙传”中第一个出现的人物是谁？","宇文化及","寇仲","石龙","张士和",},
{1,"黄易的“大唐双龙传”中第26章徐子陵是以什么身份赌赢了胡小仙","弓辰春","雍秦","雷九指",},
{1,"黄易的“大唐双龙传”中“杨公宝藏”的入口在长安哪里","西寄园","跃马桥","无漏寺","永安渠",},
{1,"古龙曾把自己的创作分为几个阶段","3","2","4","5",},
{1,"古龙的哪部作品是由别人续写完成的","圆月弯刀","萧十一郎","白玉老虎","绝代双娇",},
{1,"「返腕翼德闯帐」是谁的剑招？","苗人凤","杨过","令狐冲","袁承志",},
{1,"《鹿鼎记》中韦小宝所用的化尸粉是何人所创？","欧阳峰","何铁手","星宿老怪","王难姑",},
{1,"任我最佩服的3个人中，第一个是谁？","东方不败","方证","风清扬","左冷禅",},
{1,"《绝代双骄》里的小鱼儿与花无缺是什么关系?","双生子","兄弟","仇敌","没关系",},
{1,"《七种武器》作者是谁？","古龙","司马紫烟","卧龙生","温瑞安",},
{1,"贝海石和谢烟客交手是为了谁？","长乐帮帮主","玄铁令","为了让他入帮","石惊天",},
{1,"韦小宝首先约会是对哪个女孩?","蕊初","建宁公主","小郡主","双儿",},
{1,"祖千秋的什么酒杯被桃谷六仙吃掉?","古藤杯","百草杯","翡翠杯","月光杯",},
{1,"令狐冲做恒山派掌门是在哪月哪日?","二月十六","三月十八","二月初二","三月初二",},
{1,"段玉是谁的儿子？","段延庆","段正淳","一灯法师","枯荣大师",},
{1,"金庸最杂乱的小说是哪部?","天龙八部","射雕英雄传","碧血剑","倚天屠龙记",},
{1,"公孙绿萼死在谁的手里?","公孙止","裘千尺","杨过","李莫愁",},
{1,"易三娘和杜百当是哪部小说中的?","倚天屠龙记","神雕侠侣","连诚决","射雕英雄传",},
{1,"萧峰的第2个结拜兄弟是谁？","完颜阿骨打","段誉","虚竹","完颜洪烈",},
{1,"古龙的第一部小说是哪部","苍穹神剑","绝代双娇","白玉老虎","大地飞鹰",},
{1,"欧阳克是欧阳峰的什么人","儿子","侄子","弟弟","徒弟",},
{1,"四大名捕中诸葛神捕原名叫什么？","诸葛正我","诸葛小花","诸葛十三","诸葛寒山",},
{1,"古龙的第一部作品是哪部","苍穹神剑","剑毒梅香","大旗英雄传","武林外史",},
{1,"在《白发魔女》中，慕容冲是：","霍天都的儿子","魔鬼门门主","陈魁的儿子","玉罗刹的哥哥",},
{1,"玉罗刹的眼睛瞎了之后被谁治好？","白石道长","卓一航","妙回春","慕容冲",},
{1,"乔峰少林寺的授业恩师是哪个？","玄苦","玄慈","玄寂","玄难",},
{1,"在电视剧《白发魔女》中，小说没有的但戏份很重的两个人是：","萧笑和妙回春","萧笑和铁珊瑚","妙回春和铁珊瑚","秋霞和萧笑",},
{1,"什么药物也能克制情花毒？","断肠草","断场草","无常丹","绝情丹",},
{1,"邀月和怜星是哪部著作中的人物","绝代双骄","天涯明月刀","萧十一郎","陆小凤传奇",},
{1,"阿朱是化装成哪个进入少林寺的？","止清","止湛","止渊","止滠",},
{1,"七剑下天山是谁的作品？","梁雨生","古龙","金镛","柳残阳",},
{1,"《笑傲江湖》开篇时的恒山掌门是","定闲师太","定逸师太","定远师太","仪清师太",},
{1,"为什么“论剑”在华山","因为这是金庸定的","那里风景美","是练武胜地","祖上规定",},
{1,"欧阳峰是怎么疯了的","倒练九阴真经","被人害","被下毒","本来就是疯子",},
{1,"<<连诚决>>是根据谁的经历写的","仆人","金庸自己","武林高手","是传说",},
{1,"以下哪部是古龙的作品","三少爷的剑","那一剑的风情","七剑下天山","越女剑",},
{1,"金庸的〈射雕英雄传〉中黄药师妻子是怎么死的？","难产","病死","老死","中毒而死",},
{1,"成吉思汗写给花剌子模的战书一共有几个字","6","5","7","8",},
{1,"那位不是恶人谷中的恶人?","杜二娘","杜杀","哈哈儿","阴九",},
{1,"俯仰自得，游心太玄，嘉彼钓叟，得鱼忘筌这句诗由谁变为剑着?","杨过","周芷若","令胡冲","杨萧",},
{1,"段誉和乔锋第一次见面各喝了多少碗酒??","40","30","50","55",},
{1,"苏荃的孩子叫什么名字","铜锤","虎头","板凳","双双",},
{1,"阿珂的孩子叫什么名字","虎头","铜锤","板凳","双双",},
{1,"郑克爽给韦小宝打了多少银子的欠条","三百八十万两","五百万两","一百万两","一百八十万两",},
{1,"《神雕侠侣》中杨过的名字是谁起的？","郭靖","杨康","欧阳峰","穆念慈",},
{1,"《倚天屠龙记》中明教是从当时哪个国家传入中国的？","波斯帝国","奥斯曼帝国","罗马帝国","美国",},
{1,"《倚天屠龙记》中黄容的女儿郭襄创立了什么门派？","峨眉派","恒山派","青城派","衡山派",},
{1,"《神雕侠侣》中郭靖和黄容是怎么死去的？","大战战死","老死","病死","自杀",},
{1,"《笑傲江湖》中曲洋与刘正风得到一本曲谱叫什么名字？","广陵散谱","笑傲江湖曲","清心谱","五线谱",},
{1,"《云海玉弓缘》中毒龙尊者得了一种什么病？","麻风病","天花","梅毒","单思病",},
{1,"韦小宝的“神行百变”轻功是谁传授的","九难","洪教主","陈近南","木桑",},
{1,"《七剑下天山》中主角凌未风身体那一部分残缺？","手指","手","脚指","脚",},
{1,"《白发魔女》中女主角小时候是什么动物喂养大的？","狼","老虎","猿猴","狮子",},
{1,"西毒欧阳风,有没有儿子?","有","没有","说不清楚","可能有,也可能没有",},
{1,"梁羽生的《萍踪侠影》中的男主角是谁？","张丹枫","张三峰","张云风","张山峰",},
{1,"杨过想出了什么办法破解李莫愁的拂尘？","铸造一把大剪刀","铸造一把宝剑","铸造一把宝刀","铸造一把吴钩",},
{1,"温瑞安小说中的萧秋水的徒弟叫什么名字？","方振眉","方振侠","方歌","方人杰",},
{1,"《天龙八步》是金庸和谁一起合作完成的？","卫斯理","古龙","司马翎","梁羽生",},
{1,"楚留香与《铁血大旗门》的主角铁中棠有什么关系？","师兄弟","师徒","没有关系","父子",},
{1,"在神州奇侠书中锦江四兄弟第一个死的是谁？","唐柔","左丘超然","萧秋水","邓玉函",},
{1,"岳灵珊是怎么死的","林平之杀害","自杀殉情","毒死的","劳德诺杀害",},
{1,"白绸子的《四十二章经》原来在谁那里","董鄂妃","太后","螯拜","海公公",},
{1,"林平之的母亲姓什么","王","于","赵","吴",},
{1,"莫大先生是哪一派掌门","衡山","恒山","华山","嵩山",},
{1,"“百变千幻云雾十三式”是哪派的武功","衡山","嵩山","华山","武当",},
{1,"以下哪个人背叛了萧秋水？","左丘超然","唐柔","邓玉函","邱南顾",},
{1,"在四大名捕中谁的内力最深厚？","铁手","无情","追命","冷血",},
{1,"灭绝师太是峨眉第几代掌门人？","3","2","4","5",},
{1,"小鱼儿出恶人谷时，屠娇娇送给他什么？","金叶子","匕首","暗器","迷昏粉",},
{1,"杜杀最害怕的人是谁？","燕南天","屠娇娇","邀月","铁战",},
{1,"李安的电影《卧虎藏龙》改编自什么小说？","《春水驼铃》","《江湖奇侠传》","《武当异人传》","《大漠英雄传》",},
{1,"万春流杀了几个人之后跑到恶人谷？","六十","一百","五十二","十六",},
{1,"王语嫣是在甚莫地方开始对段誉心有所许？","枯井","冰窖","慕容山庄","无量山",},
{1,"是谁教给杨过的弹指神通？","黄药师","黄容","郭静","洪七公",},
{1,"小龙女的守宫砂是在她身体的哪个部位？","右臂","胸口","左臂","颈部",},
{1,"公孙绿萼死在谁的手里？","公孙止","李莫愁","郭芙","裘千尺",},
{1,"《铁血大旗门》中谁把十几年功力给了铁中棠？","夜帝妻子","夜帝","月后","朱青藻",},
{1,"在神州奇侠书中真正的朱大天王是谁？","朱侠武","朱顺水","邓玉平","屈寒山",},
{1,"《蜀山剑侠传》中“南明离火剑”是谁制造的？","达摩老祖","连山大师","慧可禅师","长眉真人",},
{1,"李安拍的《卧虎藏龙》电影其小说的原作者是谁？","王度庐","平江不肖生","宫白羽","郑证因",},
{1,"陆小凤中的老实和尚为了什么与叶孤城交手？","女人","名誉","钱","看叶孤城不顺眼",},
{1,"《鹿鼎记》最早是那一年发表的？","1969年","1967年","1970年","1982年",},
{1,"余鱼同在红花会中排第几","14","12","18","10",},
{1,"《天龙八部》中马大元是丐帮","副帮主","帮主","长老","香主",},
{1,"天龙八部的阿朱最擅长什么??","易容术","用毒","使虫","背记秘籍",},
{1,"梅超风如何得到九阴真经??","从陈玄风的皮上","从古墓里","从郭靖那里","打败丘处机得到",},
{1,"张无忌圣墓里得到什么武功??","乾坤大挪移","九阳神功","凌波微步","九阴真经",},
{1,"张无忌不会的武功??","太极拳","乾坤大挪移","太极剑","九阳神功",},
{1,"《连城诀》中戚芳是谁杀的","万圭","狄云","万震山","吴坎",},
{1,"一灯的四大门徒是","渔、樵、耕、读","渔、隐、农、书","渔、隐、耕、读","渔、樵、农、读",},
{1,"韦小宝是哪里人?","扬州","杭州","苏州","北京",},
{1,"张翠山的大师兄是谁?","宋远桥","俞岱岩","张三丰","宋青书",},
{1,"四十二章经中说大清龙脉在哪?","鹿鼎山","神龙岛","华山","浩天山",},
{1,"欧阳锋从谁手中得到假的九阴真经?","黄容","郭静","杨康","黄药师",},
{1,"小鱼儿的名字是谁起的??","屠娇娇","李大嘴","杜杀","燕南天",},
{1,"铁心兰的父亲外号叫什么?","狂狮","夜鹰","死不了","救不活",},
{1,"轩辕三光最爱好什么??","输钱","赢钱","偷钱","借钱",},
{1,"古龙祖籍","江西","台湾","香港","北京",},
{1,"金庸祖籍","浙江","台湾","香港","上海",},
{1,"“避邪剑法”的心法与哪种武功相同？","《葵花宝典》","《华山剑法》","《洗水经》","《易筋经》",},
{1,"<鹿鼎记>中阿柯的师傅是谁?","九难师太","独臂尼姑","九逸师太","没有师傅",},
{1,"金庸笔下写的黄蓉的原型是谁？","一个电影演员","一个体育明星","一个亲人朋友","一个新闻记者",},
{1,"杨过的重剑是什么打造的","玄铁","生铁","白口铁","钢铁",},
{1,"青衫磊落险峰行出自那部书","天龙八部","笑傲江湖","神雕侠侣","倚天屠龙记",},
{1,"电视剧 一代侠女 是根据谁的作品改编的","梁羽生","金庸","古龙","黄易",},
{1,"《武林外史》是由哪个出版社最先出版的？","春秋出版社","真善美出版社","万盛出版社","汉麟出版社",},
{1,"梁羽生祖籍那里","广西","香港","福建","广东",},
{1,"陆小凤中“绣花大盗”姓什么？","金","公孙","王","赵",},
{1,"楚留香系列中第四个故事是？","蝙蝠传奇","大沙漠","桃花传奇","新月传奇",},
{1,"古龙的第一个儿子长大后成为什么？","柔道高手","厨师","导演","小说家",},
{1,"古龙的第一个儿子姓什么？","郑","古","叶","熊",},
{1,"古龙最早被改编成电影的小说是？","流星。蝴蝶。剑","楚留香","绝代双骄","小李飞刀",},
{1,"下面那一个不是台湾武侠“四大名家”之一？","温瑞安","古龙","司马翎","卧龙生",},
{1,"古龙祖籍在那里？","江西","福建","台湾","广东",},
{1,"〈水浒中的水泊梁山首领宋江的绰号是","及时雨","黑旋风","大刀","母夜叉",},
{1,"《笑傲江湖》中,华山派的大厅叫什么?","正气堂","剑气堂","剑宗堂","正和堂",},
{1,"韦小宝妈妈名字","韦春芳","韦春花","韦春芬","韦春兰",},
{1,"小龙女与杨过第一次相遇是在那座山上？","终南山","武当山","华山","少室山",},
{1,"《鹿鼎记》中韦小宝和康熙谁大？","康熙大","韦小宝大","一样大","小宝大",},
{1,"张三丰的师傅是谁？","觉远禅师","空闻","空性","空智",},
{1,"张三丰从王羲之的哪编文章领悟到上乘武功并传给张翠山","兰亭诗序贴","十七贴","丧乱贴","请贴",},
{1,"黄蓉身穿什么护甲","软猬甲","金丝甲","天蚕衣","披甲",},
{1,"张翠山打都大锦一伙出的第一招是“24字剑决”的那一字剑决？","天字决","刀字决","龙字决","不字决",},
{1,"《天龙八部》中“函谷八友”中老四是谁？","吴领军","薛慕华","苏阿三","苟读",},
{1,"赵半山指的是？","千手如来","千手观音","千手笑佛","千手判官",},
{1,"丁典是怎么死的?","中毒","被斩首","马车车祸","被暗杀",},
{1,"是谁教令狐冲独孤九剑的?","风清扬","独孤求败","岳不群","无",},
{1,"石破天的玄铁令是从那里得来的?","一块烧饼中","饭菜中","酒中","茅屋",},
{1,"金庸小说中的“谢烟客”身居何处？","摩天崖","雪岭","绝情谷","海角天渊",},
{1,"张三丰少年时在哪里学艺？","少林寺","武当山","丐帮","华山",},
{1,"在《天龙八步》中，管少林寺菜园的和尚法号是？","缘根","虚无","缘灭","虚空",},
{1,"史亿刀是谁的别名","石破天","令狐冲","杨过","范遥",},
{1,"雁翎飞天刀姓什么","邱","华","谢","蔡",},
{1,"绰号甘霖惠七省的是谁","汤沛","林月如","何间","阎基",},
{1,"谁自称“终身和一只大马猴锁在一起，再也不分开了","任盈盈","小龙女","双儿","李文秀",},
{1,"“本门功夫以正心诚意为先”这句话是谁说的","陈近南","岳不群","郭靖","张三峰",},
{1,"曲非烟出场时穿着什么颜色的衣服","翠绿","蓝色","白色","湖蓝",},
{1,"莫大先生的剑藏在什么地方？","胡琴之中","胡琴的弓","胡琴的弦","身上",},
{1,"武当七侠中第五是","张翠山","张应松","俞代岩","殷梨亭",},
{1,"洪七公的徒弟是？","黄蓉","杨过","程英","欧阳峰",},
{1,"《白马笑西风》的作者是谁？","金庸","古龙","梁羽生","李凉",},
{1,"杨不悔最后跟谁?","殷梨亭","宋远桥","张翠山","张无忌",},
{1,"全真七子老七","孙不二","郝大通","马钰","谭处端",},
{1,"全真七子老六","郝大通","孙不二","丘处机","王处一",},
{1,"全真七子老三是谁？","刘处玄","马钰","丘处机","孙不二",},
{1,"全真七子老大?","马钰","邱处机","王处一","孙不二",},
{1,"南希仁是哪部小说中的人物","射雕英雄传","神雕侠侣","天龙八部","笑傲江湖",},
{1,"《萍踪侠影录》中丹枫的师傅是","谢天华","任凌波","叶盈盈","潮音大师",},
{1,"《萍踪侠影录》中丹枫是谁的后代","张士诚","朱元璋","陈友谅","郭子兴",},
{1,"独孤九剑的第2剑的名字是什么?","破剑式","破刀式","破枪式","破箭式",},
{1,"佛教徒念佛时手中所持的佛珠有多少颗：","108","81","100","90万",},
{1,"司空摘星的职业","神偷","杀手","无业游民","商人",},
{1,"司空摘星是?笔下的人物","古龙","金庸","梁羽生","倪匡",},
{1,"朱聪在江南七怪中排第几","2","1","3","4",},
{1,"朱聪外号","秒手书生","妙手空空","空空妙手","司空摘星",},
{1,"全真七子中,那一位是女性","孙不二","马钰","邱处机","梅超风",},
{1,"下面谁使过碧血剑？","袁承志","单铁生","玉真子","木桑道人",},
{1,"五宝花蜜酒不是由那一种制成的？","断肠草","青蛇","蜈蚣","蜘蛛",},
{1,"续命八丸不是由下面哪一种药材制成？","雪莲","三七","茯苓","熊胆",},
{1,"《笑傲江湖》中，《有所思》是什么时候的古曲？","汉","秦","唐","三国",},
{1,"林平之的父母是被谁害死的?","余沧海,木高峰","余沧海,左之木","木高峰,高胜严","岳不群,向问天",},
{1,"《笑傲江湖》中，令狐冲被成不忧打伤之后，谁留下来陪他？","陆大有","劳得偌","岳灵珊","林平之",},
{1,"降龙十八掌的第十五掌叫什么？","龙战于野","神龙摆尾","亢龙有悔","飞龙在天",},
{1,"郭襄是几岁创建峨嵋派的?","30","32","31","29",},
{1,"<<笑傲江湖>>里,第一个说话的是谁?","林平之","令狐冲","任盈盈","以上皆非",},
{1,"韦小宝在鳌拜家中抄得多少两银子?","二百三十五万","一百万","三百三十五万","一百五十万",},
{1,"闯王的藏宝图藏在什么地方？","苗若兰的凤钗里","闯王军刀上","苗人凤的剑上","胡斐的背上",},
{1,"胡铁花的嗜好?","酒","诗","画","色",},
{1,"殷野王的老婆是怎么死的??","跳河自杀","服毒自尽","被殷野王杀","被仇家杀死",},
{1,"谁解开了依天剑的密迷?","周芷若","张无忌","谢逊","张三丰",},
{1,"木高峰最后死在谁的手里","林平之","左冷禅","余沧海","莫大先生",},
{1,"段誉受种种苦楚折辱着实不小,但以下那个没有?","中天仙桃毒","无量剑和神农帮欺凌","在曼陀山庆当花匠种花","南海鳄神逼迫",},
{1,"令狐冲误服了老头子的什么药","续命八丸","夺命八丸","续命九丸","夺命九丸",},
{1,"张无忌的九杨神功从何而来！","猿的腹中","山洞","捡的","别人给的",},
{1,"梅超疯是被谁打死的?","欧阳峰","欧阳克","黄药师","郭竟",},
{1,"曲扬是曲飞烟的什么人?","爷爷","爹爹","妈妈","哥哥",},
{1,"《天龙八部》中“无恶不作”指的是四大恶人中的谁?","叶二娘","岳老三","云中鹤","段延庆",},
{1,"谁是台湾武侠小说的开拓者？","郎红浣","诸葛青云","卧龙生","伴霞楼主",},
{1,"十大恶人中有几个没去恶人谷？","6","4","5","7",},
{1,"古龙一生有几部作品是写了一些后由别人续完？","7","6","8","9",},
{1,"“唐诗剑法”是被谁改成“躺尸剑法”的？","戚长发","万震山","言达平","狄云",},
{1,"金庸的《明报》刊登的不是自己的作品是哪一部？","陆小凤","风云第一刀","萧十一郎","流星·蝴蝶·剑",},
{1,"天龙八步中乔峰怎么死的？","跳崖自尽","被慕容复杀死","服毒自尽","没死",},
{1,"杨过的手是被谁砍断的？","郭芙","郭襄","欧阳峰","黄蓉",},
{1,"杨过出场时是什么样的身份？","乞丐","她妈妈是儿子","郭靖的徒弟","欧阳锋的义子",},
{1,"杨康死在哪里？","铁枪庙","药王庙","桃花岛","恶人谷",},
{1,"欧阳克是被谁杀死的？","杨康","郭靖","黄蓉","穆念慈",},
{1,"以下谁是段誉的同门","薛慕华","南海鳄神","巴天石","阿朱",},
{1,"金庸是哪里人？","浙江","江苏","上海","广东",},
{1,"劳德诺的启蒙恩师是谁？","左冷禅","岳不群","定逸","莫大",},
{1,"阿紫的眼睛瞎了后，谁又给了她一双眼睛？","庄聚贤","乔峰","丁春秋","她师兄",},
{1,"张无忌最早练的内功是什么？","武当心法","九阴真经","九阳神功","紫霞神功",},
{1,"康熙对韦小宝的评价：","不学有术","有情有义","大义灭亲","无耻无赖",},
{1,"天龙八部书中武功最高的是","无名老僧","萧峰","虚竹","段誉",},
{1,"冲灵剑法是哪两人创建的？","令狐冲，岳灵珊","岳不群以及他妻子","令狐冲，仪琳","令狐冲，任盈盈",},
{1,"陈禹是哪部小说中的人物?","飞狐外传","倚天屠龙记","笑傲江湖","玉女剑",},
{1,"青城派的哪一位弟子在酒楼上被令狐冲杀死？","罗人杰","申人俊","余人豪","方人智",},
{1,"殷利亨此名取义于<<易经>>中的哪一句？","元亨利贞","利贞元亨","元利亨贞","亨贞利元",},
{1,"无忌几岁时谢逊才教他武功？","8","7","9","5",},
{1,"寻秦记中项少龙第一个遇见的古代女子是谁","美蚕娘","婷芳氏","月雅","素女",},
{1,"黄易的灵琴杀手中灵琴是什么琴","钢琴","小提琴","大提琴","竖琴",},
{1,"宋缺的夙敌是谁","岳山","宁道奇","祝玉研","石之轩",},
{1,"凌度宇是谁笔下的人物","黄易","金庸","黄鹰","谁的也不是",},
{1,"古龙小说《湘妃剑》题目其实是指什么剑？","竹剑","桃木剑","软剑","短剑",},
{1,"在武侠界，谁被称为天下第一快枪手？","于东楼","倪匡","古龙","卧龙生",},
{1,"在武侠小说创作中，哪个从事的时间最长？","柳残阳","古龙","卫斯理","卧龙生",},
{1,"金庸哪一部小说修改最大？","神雕侠侣","碧血剑","飞狐外传","天龙八部",},
{1,"巨雕用什么给杨过补充内力？","金蛇胆","长生果","草还丹","千年首乌",},
{1,"雷损是哪位作家手下的人物？","温瑞安","金庸","古龙","梁羽生",},
{1,"《血河车》的作者是谁？","温瑞安","古龙","卧龙生","梁羽生",},
{1,"权力帮的帮主是谁？","李沉舟","柳随风","楚狂人","朱侠武",},
{1,"金庸最后一本书是什么？","鹿鼎记","倚天屠龙记","鸳鸯刀","碧血剑",},
{1,"段誉的父亲是谁？","段延庆","段正淳","段正明","一灯大师",},
{1,"《笑傲江湖》下面谁的武功最好？","东方不败","令狐冲","岳不群","任我行",},
{1,"张无忌的医术是谁教的？","自学","胡青牛","万春流","神医",},
{1,"大唐双龙传中的李元吉是谁杀的","婠婠","李世民","寇仲","跋锋寒",},
{1,"大唐双龙传中婠婠的天魔大法是谁帮她速成的","徐子陵","寇仲","跋锋寒","石之轩",},
{2,"大唐双龙传中的石之轩亲授给徐子陵什么武艺？","长生诀","不死印法","鬼魂身法","换日大法",},
{2,"《侠客行》中武功最高得是？","谢烟客","石破天","方丈","龙岛主",},
{2,"以下哪种武功不是逍遥派的？","天山六阳掌","参合指","北冥神功","凌波微步",},
{2,"降龙十八掌的明目大部分是从何而来？","金庸","易经","古诗","洪七公",},
{2,"黄蓉的兵器是什么？","宝剑","娥眉刺","暗器","柳叶刀",},
{2,"蛤蟆功的克星是什么？","没有克星","一阳指","天罡北斗阵","左右互搏",},
{2,"韩小莹一直喜欢着谁？","丘处机","张阿生","朱聪","南希仁",},
{2,"黄容的师傅是谁","周伯通","九指神丐","欧阳锋","段王爷",},
{2,"周伯通是在哪里练成左右互搏术","重阳山","桃花岛","华山","恒山",},
{2,"桃花岛门前的对联有多少字?","16","14","12","18",},
{2,"不戒大师开始职业是什么？","和尚","屠夫","小偷","无业",},
{2,"“小李飞刀成绝响”的下一句是什么？","没有","人世不见楚留香","古龙绝笔世成阴","从此江湖无绝招",},
{2,"小鱼儿的师傅是谁？","燕兰天","四大恶人","杜老大","铁战",},
{2,"杨过的爷爷是谁？","杨康","杨铁心","杨广","杨太云",},
{2,"令狐冲曾几次败在田伯光手中？","4","3","2","5",},
{2,"杨铁心是谁的后代","杨广","杨家将","杨雄","杨松",},
{2,"郭啸天是谁的后代","郭子仪","梁山好汉","郭令公","郭 淮",},
{2,"张无忌跟谁学的医术","胡青羊","胡青牛","平一指","薛神医",},
{2,"小龙女的祖师婆婆是谁？？？","林正英","林朝英","林凤英","林丽英",},
{2,"下面哪篇小说是先有电影剧本后有小说？","《风云第一刀》","《萧十一郎》","《欢乐英雄》","《飞刀又见飞刀》",},
{2,"以下哪部小说是以评书的形式最早出现？","《春水驼铃》","《江湖奇侠传》","《七杀牌》","《罗铩夫人》",},
{2,"《火烧红莲寺》这部电影的根据哪篇小说改编的？","铁骑银瓶","江湖奇侠传","七杀牌","长眉真人",},
{2,"古龙写小说，第一年发表了几部？","7","6","8","4",},
{2,"大唐双龙传的宋缺吟诗水上明月浮的下一句是？","水底有明月","水流月不去","月上树梢头","月去水还流",},
{2,"大唐双龙传中的宁道奇的绝招是什么？","长生诀","散手八扑","偷天大法","剑心通明",},
{2,"大唐双龙传的主角的钱庄开张时下列谁没有在场？","李世民","颉利","宋鲁","查杰",},
{2,"大唐双龙传的主角的钱庄开在哪条大道上？","白虎大道","朱雀大道","玄武大道","青龙大道",},
{2,"黄易的寻秦记的后传叫什么？","寻龙记","寻鼎记","寻仙记","寻神记",},
{2,"大唐双龙传中的跋锋寒的弓叫什么？","灭日","亡月","破星","射玄",},
{2,"大唐双龙传中的跋锋寒是在哪里出生的？","成都","高昌","呼伦贝尔","吐鲁春",},
{2,"大唐双龙传中的跋锋寒被毕玄打败后是用什么武功恢复的","长生诀","换日大法","天魔大法","玄冰诀",},
{2,"梁羽生的第一部小说是？","大漠屠龙","龙虎斗京华","云海玉弓缘","狂侠·魔女·天娇",},
{2,"锦江四兄弟中的左丘超然是被谁杀死的？","李沉舟","萧秋水","朱顺水","燕狂徒",},
{2,"《天涯·明月·刀》后传是","《九月鹰飞》","《边城浪子》","《边城刀声》","《飞刀，又见飞刀》",},
{2,"《圆月弯刀》由谁代写？","丁情","司马紫烟","于东楼","中碎梅",},
{2,"《陆小风》有几个故事？","8","7","9","6",},
{2,"《楚留香》有几个故事？","7","8","9","6",},
{2,"杨过用什么武功击败达尔巴","摄心术","移魂大法","美女拳法","黯然销魂掌",},
{2,"快活王死于谁手？","王怜花","王夫人","沈浪","白飞飞",},
{2,"卫天望是哪部小说中的人物?","神雕侠侣","倚天屠龙记","笑傲江湖","射雕英雄传",},
{2,"灭绝师太的俗家姓氏是?","马","方","无","查",},
{2,"令狐冲被困西湖梅庄，在铁板上摸到密笈时最先摸到的是哪四个字?","吸星大法","我行被困","挥刀自宫","笑傲江湖",},
{2,"倚天屠龙记里的紫杉龙王叫什么？","琦丝丽","黛琦丝","黛倚丽","黛奇奇",},
{2,"飞雪？天射白鹿，？书神侠倚碧鸳：","连、遥","连、笑","笑、渺","笑、遥",},
{2,"黄易的异侠系列一共有几部？（到现在已经发行的）","6","5","8","9",},
{2,"《王者之剑》是谁的代表作品？","周郎","易容","古龙","卧龙生",},
{2,"《九龙灯》是谁的代表作品？","周郎","秦红","卧龙生","司马紫烟",},
{2,"《七海飞龙记》是谁的作品？","古龙","柳残阳","卧龙生","诸葛青云",},
{2,"《大侠沈胜衣》是谁的作品？","古龙","黄鹰","司马翎","卧龙生",},
{2,"《飞羽天关》是谁的作品？","卧龙生","司马翎","古龙","陈青云",},
{2,"金庸小说中有几个人会“降龙十八掌”？","5","4","7","8",},
{2,"《雪山飞狐》中药王谷在哪儿拍的？","松花湖","长白山","大青山","小兴安岭",},
{2,"《幽灵山庄》是陆小凤系列的第几个故事？","4","5","3","6",},
{2,"裘无意临死前杀死了谁？","朱侠武","朱顺水","康出渔","李沉舟",},
{2,"古龙最后遗作是","《边城刀声》","《猎鹰·赌局》","《血鹦鹉》","《九月鹰飞》",},
{2,"孟星魂第一个杀的人是谁？","杨玉翎","金枪李","韩棠","杨玉鳞",},
{2,"《多情环》指的是什么武器？","爱情","仇恨","信心","诚实",},
{2,"《长生剑》实际上是指的武器是什么？","信心","笑","仇恨","勇气",},
{2,"《碧玉刀》写的是一种什么武器？","信心","诚实","勇气","坚强",},
{2,"《七种武器》的第一种是什么？（古龙最先写的）","多情环","长生剑","孔雀翎","霸王枪",},
{2,"洪七公没收郭靖做徒弟时教了多少招降龙十八掌给他？","13","15","14","18",},
{2,"《射雕》中，是谁带着李萍远赴大漠？","郭啸天","段天德","杨铁心","邱处机",},
{2,"邱处机与郭，杨两人相遇时提的人头是谁的","曲三","王道乾","秦珲","青庭",},
{2,"杨铁心的妻子叫什么名字？","杨恭如","包惜弱","李萍","穆念慈",},
{2,"邱处机第一次和杨铁心比试，杨铁心用了多少招杨家枪法？","只用了一半","72路","36路","没用",},
{2,"李慕白是何门何派？","青城派","武当派","娥眉派","华山派",},
{2,"程英的师傅是谁？","郭靖","黄药仙","黄蓉","洪七公",},
{2,"东方不败是给谁杀死的？","向问天","令狐冲","任我行","任盈盈",},
{2,"古龙原姓什么？","金","熊","黄","梁",},
{2,"《侠古丹心》是谁的作品？","金庸","梁羽生","卧龙生","温瑞安",},
{2,"金逐流与谁成亲？","公孙燕","史红英","石霞姑","封妙常",},
{2,"＜天龙八部＞中，丐帮的叛逆舵主是：","马大元","权灌清","乔峰","鸠摩智",},
{2,"＜神雕侠侣＞中，瑛姑喜欢谁？","郭靖","周伯通","耶律齐","金轮法王",},
{2,"《神州无敌》是谁的作品？","金庸","温瑞安","古龙","梁羽生",},
{2,"《侠古丹心》中，金逐流是哪个人的儿子？","江海天","金世遗","李墩","姬哓风",},
{2,"寻秦记的作者是谁？","梁羽生","黄易","金庸","卧龙生",},
{2,"紫青双剑录共几卷?","3","6","5","4",},
{2,"＜天龙八部＞中，土蕃国护国法师是：","一灯大师","鸠摩智","段正淳","方正大师",},
{2,"项少龙回古代时最先到那国？","秦","赵","魏","齐",},
{2,"段誉会几种武功？","2","3","4","5",},
{2,"《风铃中的刀声》结尾是谁代写的","丁情","于东楼","司马紫烟","中碎梅",},
{2,"剑王被谁杀死","五剑","六掌","萧秋水","朱顺水",},
{2,"谁破了唐肥的唐花？","唐宋","唐方","萧秋水","唐绝",},
{2,"萧秋水吃了几颗“无级先丹”","4","3","1","2",},
{2,"权力帮为什么攻打剑庐","为了“天下英雄令”","为了《忘情天书》","为了狄夫人","为了报仇",},
{2,"杨过在绝情谷与长须怪打斗用何等武器？","君子剑","柳枝","木棒","赤手",},
{2,"<风云>中,谁告诉聂风,步惊云等人泥菩萨所在处","孔慈","文丑丑","秦霜","雄霸",},
{2,"大唐双龙传中的主角的美人儿师父是谁？","绾绾","云玉真","小鹤儿","师妃暄",},
{2,"段誉第一次见到王语焉时，称王语焉为：","王姑娘","神仙姐姐","姐姐","语焉",},
{2,"段誉与岳老三的关系是：","兄弟","师徒","无关系","江湖朋友",},
{2,"欧阳峰传授给杨过的武功是：","无相神功","蛤蟆功","天魔功","伏魔功",},
{2,"香香公主是怎么死的？","被太后赐死","自杀","中毒","被乾隆赐死",},
{2,"岳不群是谁杀死的？","令狐冲","仪琳","左冷禅","任盈盈",},
{2,"温青青的母亲是谁？","何红药","温仪","温雪宜","夏雪宜",},
{2,"铁萍姑是谁的女儿？","铁战","李大嘴","江别鹤","杜杀",},
{2,"鹿鼎记中出现的最高辈份的人是谁？","木桑道人","归辛树","九难师太","穆人清",},
{2,"何铁手暗恋的是谁？","袁承志","温青青","穆人清","归辛树",},
{2,"九难出家前暗恋谁？","温青青","袁承志","夏雪宜","程青竹",},
{2,"岳不群派谁和岳灵珊一起去林家附近监视青城派动静？","令狐冲","劳德诺","陆大有","梁发",},
{2,"《江湖奇侠传》是下面谁的作品？","朱贞木","平江不肖生","古龙","卧龙生",},
{2,"古龙就读于淡江大学时，其专业为？","法律","英文","企管","中文",},
{2,"卧龙生原名？","张梦还","牛鹤亭","王度庐","牟松亭",},
{2,"古龙口述的作品是?","《风云第一刀》","《飞刀，又见飞刀》","《那一剑的风情》","《三少爷的剑》",},
{2,"《边城刀声》的作者是？","古龙","丁情","倪匡","梁羽生",},
{2,"下面谁不属于台湾武侠小说“三剑客”？","司马翎","古龙","卧龙生","诸葛青云",},
{2,"梁羽生原名？","陈正魁","陈文统","陈令文","周正罡",},
{2,"律香川用什么暗器杀老伯？","暴雨梨花针","七星针","化血神针","透骨神针",},
{2,"黑蝙蝠姓什么？","华","耶律","完颜","独孤",},
{2,"楚留香在《蝙蝠传奇》中看到谁的有我是凶手四个字","高亚男","华真真","一点红","胡铁花",},
{2,"周伯通最怕见到谁?","洪七公","英姑","小龙女","求千尺",},
{2,"<<鹿鼎记>>中的假后是?","方怡","毛东珠","陶红英","双儿",},
{2,"何铁手给了韦小宝什么宝贝?","宝玉","暗器","宝刀","宝剑",},
{2,"天地会中的奸细是谁?","徐天川","风际中","钱老本","韦小宝",},
{2,"谁没有练<辟邪剑谱>?","林平之","左冷蝉","岳不群","都练过",},
{2,"陆小风第二部的名字是什么","风舞九天","银沟赌坊","幽灵山庄","决战前后",},
{2,"楚留香有一个什么样的习惯","挤眼睛","摸鼻子","挖鼻孔","晃脑袋",},
{2,"笑傲江湖中向左使的名字是?","向问地","向问天","向同天","向左问",},
{2,"燕南天在恶人谷中十四条经脉被毁了几条？（万春流诊断）","6","8","10","12",},
{2,"小鱼儿修理的第一个人是谁？（恶人谷外的）","宋三","巴蜀东","桃花","铁心兰",},
{2,"<<风云第一刀>>中谁在兵器谱上排名第五?","李寻欢","吕风先","郭嵩阳","天机老人",},
{2,"张无忌乾坤大挪移练到了几层","6","7","8","9",},
{2,"侠客岛上腊八粥是什么颜色","白","绿","红","黑",},
{2,"识得左右互博个人有","英姑，周伯通，杨过","周伯通，小龙女，郭靖","黄蓉，小龙女，杨过","英姑，郭靖，扬康",},
{2,"郭靖在蒙古有个响当当的称号是？","郭大侠","金刀附马","好安达","神射手",},
{2,"波斯圣火教共有多少宝树王？","11","12","13","18",},
{2,"张三丰的俗名是？","张三风","张君宝","张家宝","张一风",},
{2,"七伤拳是哪家的？","少林","崆峒","武当","青城",},
{2,"金花婆的真实身份是？","张敏","紫袍衫龙王","小昭","不悔",},
{2,"明教的四大法王的排列是？","青金白紫","紫白金青","红白青黑","红黄青紫",},
{2,"被谢逊打死的少林神僧是？","空闻","空见","空性","空虚",},
{2,"张丹枫的妻子是？","云重","云蕾","云菁","云婧",},
{2,"嵩阳铁剑在兵器谱中排名第几","5","4","6","7",},
{2,"古龙的《剑毒梅香》由谁序完","墨余生","上官鼎","乔奇","丁情",},
{2,"路上龙王是谁的父亲","郭大路","林太平","燕七","王动",},
{2,"欢乐英雄中郭大路与谁成亲","孙三娘","燕七","玉玲珑","卫夫人",},
{2,"欢乐英雄中谁是女扮男装","郭大路","燕七","王动","林太平",},
{2,"楚留香身体中没有哪一种感觉?","听觉","嗅觉","视觉","味觉",},
{2,"绝代双骄中天下第一美男子是谁?","江玉郎","江枫","花无缺","小鱼儿",},
{2,"？年9月，台湾远景出版社正式出版《金庸作品集》。","1977","1976","1978","1979",},
{2,"《修罗七绝》是谁的作品？","古龙","柳残阳","卧龙生","司马紫烟",},
{2,"星际浪子里的大亨是指谁？","方舟","巴斯基","封神","天美",},
{2,"下面谁不是韦小宝的师傅","陈近南","吴六奇","九难","康熙",},
{2,"韦小宝在阿珂、双儿和沐剑屏三个之中先认识的是谁？","阿珂","沐剑屏","双儿","一起认识",},
{2,"林平之的外公住在哪里","泉州","福州","漳洲","南平",},
{2,"李凉的天才混混中的主角的师父是谁？","双颠","双狂","双痴","双霸",},
{2,"叶开真正爱的是谁","上官小仙","丁灵琳","妓女","梅吟雪",},
{2,"李凉的天才混混中的主角叫什么名？","真能混","曾能混","增能混","争能混",},
{2,"李凉小说天下第一当中的君小心的父亲是谁？","阴不绝","天下第一当","金天王","七音城主",},
{2,"明教巨木旗的掌旗使是谁？","颜坦","闻苍松","唐洋","辛然",},
{2,"李凉小说中的小偷世家姓什么？","杨","丁","绿","君",},
{2,"六脉神剑中的右手中指是：","关冲剑","中冲剑","商阳剑","少商剑",},
{2,"六脉神剑中的右手食指是：","少商剑","商阳剑","中冲剑","关冲剑",},
{2,"黄易的覆雨翻云中的鹰刀是谁的遗物？","赤尊信","传鹰","风行烈","庞斑",},
{2,"虚夜月在覆雨翻云中的美女里排第几？","4","3","3","6",},
{2,"青城绝技是","松风剑法","九打十八破","青城刺","避邪剑法",},
{2,"陈圆圆的女儿是哪个","陈晓圆","阿珂","李莫愁","程英",},
{2,"黄药师在归云庄嘱咐梅超风办几件事？","二","三","四","五",},
{2,"韩柏有几个妻妾？","6","8","7","5",},
{2,"袁崇焕的家乡是哪里？","湖南","广东","四川","辽宁",},
{2,"《鹿鼎记》中摇头狮子是谁？","柳大洪","吴立身","钱老本","沐天波",},
{2,"江别鹤的真名","江风","江琴","江情","江玉郎",},
{2,"《鹿鼎记》中杀死司徒伯雷的是谁？","韦小宝","巴朗星","孙思克","吴三桂",},
{2,"《侠骨丹心》的作者是？","古龙","梁羽生","黄易","卧龙生",},
{2,"金庸是借谁的口说出古墓是怎么到林朝英手上的？","王重阳","邱处机","小龙女","孙婆婆",},
{2,"古墓派的古墓原来是做什么用的？","放死人","抵抗金兵","藏食物","修炼武功",},
{2,"古墓派个古墓是怎么得来的？","打赌赢的","比武赢的","无意中找到的","抢来的",},
{2,"大唐双龙传中的寇仲的武功叫什么名？","长生诀","井中八法","鬼魂身法","不死印法",},
{2,"大唐双龙传中的毕玄武器叫什么名？","井中月","月狼","偷天","无名",},
{2,"大唐双龙传中的毕玄的武器是什么？","枪","矛","刀","手",},
{2,"大唐双龙传中的李世民几岁学说突厥话？","9","8","7","10",},
{2,"大唐双龙传中的呼延金是哪里人？","汉","契丹","苗","室韦",},
{2,"大唐双龙传中的拜紫亭立国是谁煽动的？","越克蓬","天竺狂僧","呼延金","梁公于",},
{2,"大唐双龙传中的生灭灭尽处，灭灭生机起说的是什么武艺？","长生诀","换日大法","不死印法","散手八扑",},
{2,"《神雕侠侣》中，古墓里有块什么石头可以封死通道？","千斤石","断龙石","万年石","千年锁",},
{2,"雁门关一战，中原高手有几个人没有死？","5","3","2","4",},
{2,"下面哪部书的卧龙生的？","《大侠魂》","《飞花逐月》","《浪子》","《杨小邪》",},
{2,"下面哪篇小说不是司马翎的？","《龙马江湖》","《无名萧》","《飞羽天关》","《剑神传》",},
{2,"《侠骨丹心》中，第一个出场的是谁？","金逐流","秦元浩","金世遗","封妙常",},
{2,"忘情天书没有哪种功夫？","剑法","内功","轻功","掌法",},
{2,"阿九的身份什么？","百姓","公主","官","太子",},
{2,"袁紫衣最终当了什么？","杀手","尼姑","乞丐","浪人",},
{2,"项少龙一共到过几个国家？","6","8","9","5",},
{2,"英雄大会上谁主动借剑给杨过，杨过拒绝了？","程瑶珈","孙不二","赵志敬","尹志平",},
{2,"快活王是谁？","沈天君","柴玉关","王怜花","沈浪",},
{2,"耶律奇的师傅是谁？","黄药师","周伯通","王重阳","洪七公",},
{2,"谁出卖了江枫？","江玉郎","江琴","10大恶人","12星像",},
{2,"10大恶人中谁第2个死？","白开心","杜杀","李大嘴","屠娇娇",},
{2,"《武林外史》的作者是谁？","金庸","古龙","吴承恩","周浩",},
{2,"小鱼儿姓什么？","扈","江","孔","金",},
{2,"《碧血剑》是谁写的？","古龙","金庸","计划反对可是就","恢复搭街坊抗敌素",},
{2,"铁心兰和铁萍姑的父亲","是同一人","都是十大恶人中人","一个是正派中人，一个是恶人谷中人","都是正派中人",},
{2,"铁心兰和铁萍姑是什么关系？","姐妹","没有关系","孪生姐妹","表姐妹",},
{2,"江玉郎的藏宝图来自何处？","从铁心兰处抢得","江别鹤的书房","从不知名的江湖人手中得到","他的朋友送能他的",},
{2,"绝代双骄中是谁假造了藏宝图？","江小鱼","江别鹤","燕南天","铁战",},
{2,"陈近南是谁杀死的？","郑成功","郑克爽","韦小宝","风际中",},
{2,"下面谁曾经参与过降龙十八掌的创立？","汪啸天","洪七公","萧峰","辰百",},
{2,"下面哪种武功在金庸的书中创立时间上有矛盾？（书中历史时间）","打狗棒法","降龙十八掌","一阳指","九阴真经",},
{2,"洪七公传给郭靖的第十五 招掌法是？（降龙十八掌中的）","亢龙有悔","龙战于野","飞龙在天","神龙摆尾",},
{2,"洪七公传给郭靖的第一招掌法是？（降龙十八掌中的）","飞龙在天","亢龙有悔","神龙摆尾","龙战于野",},
{2,"为救杨过而被赫大通错手打死的是：","陈婆婆","孙婆婆","龙婆婆","林婆婆",},
{2,"韦小宝的宝刀是哪里来的?","骗来的","抄来的","偷来的","抢来的",},
{2,"在庙里,解救丐帮群丐的人是谁?","乔峰","段誉","阿碧","白世镜",},
{2,"寻龙记中的主角是哪本书的主角的儿子？","大剑师传奇","寻秦记","覆雨翻云","大唐双龙传",},
{2,"大剑师传奇中的主角最后是用什么方法打败巫帝的？","仇恨的力量","爱的力量","他的武功","用毒",},
{2,"令狐冲上恒山辞卸掌门时乔装成了谁？","军官","哑婆婆","农夫","日月神教教徒",},
{2,"妙贼丁小钩的第一个门徒是什么人？","女人","女孩","男孩","男人",},
{2,"妙贼丁小钩的门徒叫什么名？","小西","小竹","小龙","小木头",},
{2,"如来八法中的主角最后有多少个老婆？","1","2","5","3",},
{2,"杨小邪开了一间什么馆？","八方通吃馆","通吃十锦馆","大小通吃馆","什锦通吃馆",},
{2,"如来八法中邪神的徒弟叫什么名？","江水","江青","江南","江明",},
{2,"武当众人第一次为张无忌疗伤时，宋远桥支持了几柱香时间？","3","2","1","4",},
{2,"“排云掌”第一式是？","排山倒海","行云流水","怒海排仞","翻云覆雨",},
{2,"连城诀血刀老祖是血刀门第几代掌门","3","4","1","2",},
{2,"《寻秦记》中项少龙最后有几妻几妾？","二妻三妾","三妻二妾","三妻四妾","二妻二妾",},
{2,"段誉在哪里第一次见到王语焉？","太湖普仪山庄","太湖曼陀山庄","太湖普陀山庄","太湖曼仪山庄",},
{2,"《天龙八部》中，阿朱被谁杀死?","慕容复","乔峰","段誉","丁春秋",},
{2,"《龙凤宝钗缘》是梁羽生写什么时期的作品？","宋","唐","元","明",},
{2,"《大剑师传奇》是谁写的？","古龙","黄易","金庸","无及",},
{2,"《啸傲江湖》中是谁最先练“葵花宝典”的？","东方不败","太监","岳不群","林平之",},
{2,"《鹿鼎记》中是谁把韦小宝带进宫的？","陈近南","海大富","双儿","自己要求",},
{2,"黄易所写《大剑师传奇》中大剑师用的兵器哪儿来的！","自己检的","魔女所给","主传","山洞中得到的",},
{2,"黄易所写《大剑师传奇》中大剑师用的兵器叫？","明月刀","魔女刃","清风剑","玄铁剑",},
{2,"黄易写的《大剑师传奇中》谁是大剑师？","哥站","兰特","大元帅","华茜",},
{2,"笑傲江湖里的令弧冲曾经一剑刺盲几个蒙面人？","9","8","7","10",},
{2,"天山童姥练的武功叫什么?","无相神功","八荒六合唯我独尊功","天山六阳掌","天山折梅手",},
{2,"[风云]中有几把宝剑？","12","10","8","11",},
{2,"谁喜欢洗澡时带着武器？","叶孤城","凤四娘","萧十一郎","西门吹雪",},
{2,"卧龙生的〈新仙鹤神针〉是下面哪部小说修改而成？","天剑绝刀","飞燕惊龙","玉钗盟","无名萧",},
{2,"在凌度宇生命中对他最重要的女人有几个？","2","3","4","5",},
{2,"凌度宇系列最后一部的名字是什么？","上帝之迷","诸神之战","兽性回归","圣女",},
{2,"以下哪位农民起义领袖是明教教主 ？","宋江","方腊","王小波","李顺",},
{2,"天龙八部 书中哪部份是由别人代写的 ？","枯井底，污泥处","阿紫瞎眼","阿紫虐待刘坦之","大战聚贤庄",},
{2,"岳灵珊使得不对或者不会使的泰山剑法是&nbsp;？","岱宗如何,五大夫剑","岱宗如何,十八盘","快活三,岱宗如何","石关回马,快活三",},
{2,"以下谁亲授了袁承志‘神行百变’？","穆人青","温青青","木桑道长","何惕守",},
{2,"鸳鸯刀 中周威信会的武功是 ？","呼延18鞭","呼延17鞭","尉迟17鞭","尉迟18鞭",},
{2,"袁崇焕是哪里人 ？","广西","广东","河南","湖北",},
{2,"金庸小说中没有明确历史朝代的一共有几部 ？","3","4","5","2",},
{2,"以下小说中没有任何联系的是 ？","碧血剑--鹿鼎记","书剑恩仇录--雪山飞狐","书剑恩仇录--飞狐外传","倚天屠龙--神雕侠侣",},
{2,"除温青青之外，袁承志最爱的女子是 ？","安小惠","阿九","何惕守","焦宛儿",},
{2,"以下可解情花之毒的是 ？","腐骨穿心草","断肠草","升龙木","七虫七花膏",},
{2,"〈神雕侠侣〉中何师我的真名是 ？","朱子柳","霍都","鲁有脚","达尔巴",},
{2,"清静散人孙不二明媒正嫁的丈夫是 ？","潭处端","马钰","朱子柳","王处一",},
{2,"韦小宝长子的母亲是 ？","苏荃","阿珂","双儿","建宁公主",},
{2,"连城诀的原名是 ？","空心剑","素心剑","唐赋诀","诗剑诀",},
{2,"以下那一个不是韦小宝曾经担任过的职务 ？","青木堂主","前锋营都统","白龙使","赐婚使",},
{2,"吸星大法主要继承的是 ？","五斗米神功","北冥神功","化功大法","小无相功",},
{2,"大雪山一战，被雪刀老祖先后杀死的南四奇顺序是","刘乘风，水岱","刘乘风，陆天抒","陆天抒，水岱","陆天抒，花铁干",},
{2,"南海玉萧在兵器谱上排名第几 ?","9","10","8","7",},
{2,"韦小宝的女儿最开始起的名字是什么？","双双","板凳","阿珂","小凤",},
{2,"云蕾的哥哥是？","云千里","云重","云靖","云浩",},
{2,"丐帮中哪一种武功只传帮主？","降龙十八掌","打狗棒法","落瑛神掌","百步神拳无影掌",},
{2,"金庸的第一部成名的武侠小说是什么？","雪山飞狐","书剑恩愁录","飞狐外传","射雕英雄传",},
{2,"宝树在遇到田归农苗人凤以前的职业是_________。","屠夫","医生","小偷","和尚",},
{2,"高昌国是被以下哪个朝代灭亡的 （出于白马啸西风 ）","汉","唐","明","清",},
{2,"白马啸西风 中写的：可兰经允许男性教徒可以和以下那些人通婚 ？","A俘虏","A.B.C","B奴婢","C汉人",},
{2,"苗人凤在______________一招中有重大弱点。","反手挪青云","提撩剑白鹤亮翅","飞手追云","擒鹤手",},
{2,"下面是著作哪一部和其他三部不是出于同一人之手？（旧派武侠小说）","鹤惊昆仑","鹰爪王","卧虎藏龙","铁骑银瓶",},
{2,"台湾武侠作者司马翎原名是？","吴思铭","吴思明","吴铭","吴明",},
{2,"北派大家之五一“奇情推理派”指谁？","郑证因","朱贞木","白羽","王度庐",},
{2,"旧中国北派五大家之三——“帮会技击派”是指谁？","朱贞木","郑证因","王度庐","白羽",},
{2,"江小鱼和江玉郎是被谁用情锁锁在一起的?","白开心","萧咪咪","魏无牙","碧蛇神君",},
{2,"江小鱼在流浪逃亡的生活中为了掩饰身份没做过?","药店帐房","富户家丁","戏班杂耍","厨房伙计",},
{2,"小仙女张菁最后与谁在一起了?","黑蜘蛛","顾人玉","江小鱼","南宫柳",},
{2,"铁萍姑最后与谁在一起了?","江小鱼","胡药师","江玉郎","独自远走",},
{2,"绝代双骄中路仲远是怎么死的?","被江别鹤害死","被江玉郎害死","被恶人谷恶人害死","被江小鱼误杀",},
{2,"移花宫二位宫主喜欢谁?","燕南天","江枫","江别鹤","以上都不是",},
{2,"谁向移花宫两位宫主求过亲?","燕南天","魏无牙","江枫","江别鹤",},
{2,"绝代双骄中铜先生是谁?","怜星宫主","邀月宫主","燕南天","江别鹤",},
{2,"江琴的结局是?","自杀","到顾家口种田","被江小鱼和花无缺杀死","被移花宫宫主杀死",},
{2,"江别鹤和江琴是什么关系?","主仆","同一人","兄弟","无关",},
{2,"江小鱼在海家班马戏团做什么?","敲锣","每天翻几百个跟斗","舞剑","吞剑",},
{2,"江小鱼在海家班马戏团时叫什么名字?","江鱼儿","海小呆","海小成","海小聪",},
{2,"绝代双骄中怜星宫主最后怎么样了?","自杀身亡","被邀月杀死","远走他乡,隐居起来","被燕南天杀死",},
{2,"杀人名医平一指怎么死的?","没死","自杀","老死","被仇家所杀",},
{2,"水浒传中绰号没羽箭的是谁?","张青","张清","张横","张顺",},
{2,"梁山好汉中李应的绰号是?","跳涧虎","扑天雕","双头蛇","插翅虎",},
{2,"郭静的师傅中没有?","韩小莹","马钰","哲别","朱聪",},
{2,"杨康死时下面谁不在场?","黄蓉","郭静","欧阳锋","曲傻姑",},
{2,"谁不是《倚天屠龙记》中少林寺四大神僧之一？","空闻","空相","空智","空性",},
{2,"《神雕侠侣》中开头的一首词作者是谁？","柳宗元","欧阳修","韩愈","范仲淹",},
{2,"《神雕侠侣》中开头的一首词是什么？","水龙吟","蝶恋花","虞美人","如梦令",},
{2,"悬空寺在什么山？","衡山","恒山","华山","嵩山",},
{2,"明教教主杨顶天是怎么死的?","被成昆杀死的","走火入魔死的","被气死的","没有死",},
{2,"陈家洛是哪个帮的帮主","天地会","红花会","兄弟会","天煞盟",},
{2,"郭靖的儿子叫什么/","郭冬菇","郭破虏","郭香","大团圆",},
{2,"胡铁花喜欢叫楚留香什么","大萝卜","老臭虫","臭虫","老色狼",},
{2,"燕十三的剑有多少式","12","14","13","11",},
{2,"打狗棒法共有多少路？","18","36","72","108",},
{2,"〈多情剑客无情剑〉开始出单行本发表的时候是分为几部分发表的？","4","2","3","5",},
{2,"射雕三部和拢来一共有多少章节？","90","120","100","150",},
{2,"柯镇恶的武器是？","剑","铁杖","扁担","扇子",},
{2,"杨过在哪里得知父亲有关的事情？","桃花岛","铁枪庙","终南山","重阳宫",},
{2,"在洪七公与欧阳锋两大高手夹击之下，全身筋脉俱废的是谁？","霍都王子","藏边五丑","金轮法王","达尔巴",},
{2,"〈孤星传〉是谁的作品？","卧龙生","古龙","梁羽生","司马翎",},
{2,"〈失魂引〉是谁的作品？","金庸","古龙","卧龙生","李凉",},
{2,"权力帮中的刀王叫什么","屈寒山","兆息秋","鞠秀山","祖金殿",},
{2,"李文秀的母亲叫？","欧阳情","上官虹","上官鸿","欧阳清",},
{2,"郭靖、黄蓉在牛家村密室疗伤时，靠吃什么？","烙饼","西瓜","牛肉","馒头",},
{2,"韩宝驹是江南七怪中第几？","2","3","1","4",},
{2,"《天龙八部》中的无崖子喜欢的是谁？","李秋水的姐姐","李秋水的妹妹","天山童姥","天山童姥的妹妹",},
{2,"《侠客行》中长乐帮在什么地方？","杭州","镇江","常州","无锡",},
{2,"红花会的2帮主做过什么","小二","乞丐","流氓","苦力",},
{2,"周芷若的师傅是？","圆空师太","灭绝师太","绝灭师太","没有师傅",},
{2,"张无忌的爸爸是？","张英挺","张翠山","殷素素","张力俊",},
{2,"谢逊的儿子叫？","张无忌","谢无忌","谢烯","谢挺",},
{2,"温瑞安和古龙哪个先涉足武侠写作？","温瑞安","古龙","同时","都没有",},
{2,"谁不是张无忌的亲戚","阿离","狮王","鹰野王","鹰王",},
{2,"谁杀了周伯通的儿子？","裘千丈","裘千刃","一灯","瑛姑",},
{2,"金庸的射雕三步曲哪个不是？","射雕英雄传","天龙八部","神雕侠侣","倚天屠龙记",},
{2,"<绝代双娇》中的下面哪个生肖没有出现过？","狗","龙","兔","虎",},
{2,"段誉有几位表妹?","3","5","4","2",},
{2,"谁参透了侠客行图谱？","谢烟客","石破天","白自在","石中玉",},
{2,"吴六奇死于何人之手？","归辛树","归钟","吴三桂","冯锡范",},
{2,"打狗棒法中最后一招叫什么名字？","棒打八狗","天下无狗","嗷口夺杖","棒打狗头",},
{2,"笑傲江湖中，被任我行佩服半个的是谁?","左冷禅","武当冲虚","岳不群","余沧海",},
{2,"归辛树属于何门派？","泰山","华山","衡山","昆仑山",},
{2,"天山童姥死对头是谁?","丁春秋","李秋水","无崖子","四大恶人",},
{2,"杨过和小龙女在那里拜堂？","古墓","王重阳像前","全真教大门口","郭府",},
{2,"苗人凤与辽东大侠胡一刀在何处比武?","郑州","沧州","徐州","杭州",},
{2,"“吉藏凶，凶藏吉”这句话是谁唱的?","赵敏","小昭","周芷若","阿蛛",},
{2,"倚天屠龙记中行刺张三峰的少林和尚是：","空闻","空相","空灵","空性",},
{2,"玄冥神掌留在张无忌身上的掌印是什么颜色的?","暗红","碧绿","灰黑","惨白",},
{2,"杨过给郭襄的第三件礼物是：","烟花","打狗棒","人耳","泥偶",},
{2,"杨过给郭襄的第一件礼物是：","烟花","人耳","打狗棒","泥偶",},
{2,"杨过给郭襄的第二件礼物是：","人耳","烟花","打狗棒","泥偶",},
{2,"郭芙在秒门口碰到的肋下撑着一对六尺来的来长的拐杖之人是：","潇湘子","尼摩星","尹克西","马光佐",},
{2,"九尾灵狐是谁养的？","老顽童","瑛姑","杨过","小龙女",},
{2,"木婉清的座骑的名字是什么？","白龙驹","黑玫瑰","赤兔","寒星",},
{2,"谢逊第一次出场，手上拿着什么武器?","双锤","狼牙棒","剑","刀",},
{2,"杨过被郭芙砍断身体哪部分？","左手","右手","右脚","左脚",},
{2,"韦小宝七个老婆中谁的年龄最大？","方怡","苏荃","双儿","阿珂",},
{2,"东邪黄药师的独门暗器","梅花针","附骨针","七星针","血蜂针",},
{2,"斑竹戒指指是哪个帮的信物","丐帮","长鲸帮","权力帮","通吃帮",},
{2,"《大煞手》是下面哪个做者的作品？","古龙","柳残阳","周郎","黄鹰",},
{2,"《三少爷的剑》属于古龙哪一个时期的作品？","早期","后期","中期","中后期",},
{2,"洪七公传过降龙十八掌给下面的谁？","蒙飞","黎生","刘长老","红可",},
{2,"神龙摆尾这招的名字出自？（射雕英雄传）","诗经","易经","大雅","大学",},
{2,"《射雕英雄传》中有几个人会降龙十八掌？","2","3","4","5",},
{2,"玄冥二老假冒什么人将张无忌掳走","五当门人","元兵","少林僧","明教教徒",},
{2,"善柔最后作了：","庄夫人","解夫人","乌夫人","李夫人",},
{2,"谁派人刺杀董匡（项少龙）和龙阳君？","韩闯","太子单","田单","吕不韦",},
{2,"侠客岛上有几位岛住？","3","2","1","4",},
{2,"快活王是谁？","金不换","柴玉关","沈浪","熊天豪",},
{2,"石破天喜欢谁？","丁当","阿绣","侍剑","一个不喜欢",},
{2,"大欢喜女菩萨的大弟子是谁？","蓝蝎子","至尊宝","胡不非","极乐峒主",},
{2,"中原八义和胡不归高陷阱抓住李寻欢是谁幕后主使的?","上官金虹","龙啸云","林仙儿","大欢喜女菩萨",},
{2,"李寻欢接到上官多虹下的战帖后是谁去赴约的?","吕凤先","郭嵩阳","李寻欢","阿飞",},
{2,"风云第一刀中龙小云的母亲是谁?","林仙儿","林诗音","林铃铃","蓝蝎子",},
{3,"金花婆婆的真实身份是？","赵敏之母","明教教主","紫衫龙王","朝庭鹰犬",},
{3,"郭嵩阳死后李寻欢在他身上发现多少处剑伤?","二十九剑","一剑毙命","二十六剑","十三剑",},
{3,"林仙儿最恨的人是谁?","荆无命","阿飞","李寻欢","林诗音",},
{3,"兴云庄外的小酒店卖酒的孙驼子是说书女孙小红的什么人?","没有关系","哥哥","叔叔","叔爷",},
{3,"风云第一刀中大欢喜女菩萨死在谁手里?","蓝蝎子","李寻欢","游龙生","林仙儿",},
{3,"嵩阳手郭嵩阳是谁杀死的?","阿飞","上官金虹","荆无命","吕凤先",},
{3,"风云第一刀中至尊宝是谁杀死的?","阿飞","李寻欢","蓝蝎子","铁嵩阳",},
{3,"《寻秦记》中的天下第一高手是谁？","管仲邪","项少龙","曹秋道","腾翼",},
{3,"《水浒传》中绰号母夜叉的丈夫的绰号是什么？","小尉迟","没羽箭","菜园子","病尉迟",},
{3,"《水浒传》中一丈青的丈夫是谁？","跳涧虎","插翅虎","矮脚虎","锦豹子",},
{3,"石破天出场时是什么身份？","剑客","和尚","乞丐","不轻楚",},
{3,"包不同的女儿的名字是什么？","包不玉","包不倩","包不靓","包不冥",},
{3,"张三丰自创的武功是？","九阴真经","九阳神功","太极拳","太极剑",},
{3,"林冲曾经当过？","流氓","宰相","教头","伙计",},
{3,"熊猫儿是谁的义子？","左公龙","熊天毫","快活王","朱富贵",},
{3,"损人不利几是谁？","哈哈儿","杜杀","白开心","铁战",},
{3,"洪七公用什么引来蜈蚣？","蛇","母鸡","公鸡","小鸡",},
{3,"洪七公在华山上给杨过吃什么了?","蜘蛛","蛇","蜈蚣","灵芝",},
{3,"快活王手下有几个使节！","2","3","4","5",},
{3,"燕南天的什么武功可以跟明玉决分庭抗礼！","天衣决","飞燕剑术","嫁衣神功","龙王神功",},
{3,"下列谁不会左右互搏","小龙女","郭靖","黄蓉","周伯通",},
{3,"柔骨女叫：","凤菲","石素芳","兰宫媛","祝秀贞",},
{3,"胖头陀变瘦的原因是：","腐骨穿心丹","九转回龙丹","豹胎易筋丸","乾坤颠倒丸",},
{3,"阿珂是谁的女儿？","九难","吴三桂","李自成","陈近南",},
{3,"财使是谁","熊猫","宋离","金不换","山佐天音",},
{3,"气使是谁","山佐天音","熊猫","宋离","金不换",},
{3,"萍踪侠影中脱不花结局是？","出家为尼","被其父亲也先强行嫁给一个贵族之子","为了张丹枫自杀身亡","被其父亲下令处死。",},
{3,"弹指惊雷是谁所蓍？","卧龙生","古龙","梁羽生","温瑞安",},
{3,"土木堡之变后出使瓦剌的大臣是谁？","云靖","王振","云重","张凤虎",},
{3,"大唐中石之轩在魔道十大高手中排第几？","第二","第一","没有排进","第三",},
{3,"萍踪侠影录中上官天野的情人萧韵兰以什么作为暗器？","梅花","树叶","竹叶","细小蜂针",},
{3,"玄机逸士门下谁在小寒山面壁十二年？","董岳","谢天华","叶盈盈","云澄",},
{3,"张丹枫一直叫云蕾什么？","蕾妹","小师妹","小兄弟","云姑娘",},
{3,"萍踪侠影中上官天野是什么出身？","官宦","乞丐","强盗","保镖",},
{3,"萍踪侠影中震三界是谁？","周健","谢天华","毕道凡","石英",},
{3,"萍踪侠影中张丹枫的坐骑与潮音和尚的坐骑是？","夫妻","兄弟","母子","没有关系",},
{3,"萍踪侠影中乌蒙夫是上官天野的几弟子?","1","3","2","不是",},
{3,"萍踪侠影中上官天野有几个弟子?","5","4","3","1",},
{3,"萍踪侠影中张丹枫在其先祖留下的藏宝中得到武功秘籍是谁写的?","上官天野","陈玄机","彭和尚","张士诚",},
{3,"张丹枫的坐骑叫做什么？","碧血照丹青","汗血宝马","照夜玉狮子","大宛白玉马",},
{3,"萍踪侠影中詹台镜明最后嫁了谁？","周山民","张丹枫","云重","张凤虎",},
{3,"萍踪侠影中记载张士诚与朱元璋的师父是谁？","庄周","陈玄机","彭莹玉","上官天野",},
{3,"张丹枫探视被俘的明帝祈镇身陷重围被谁救出？","云重","云蕾","脱不花","张凤虎",},
{3,"萍踪侠影中云重的师傅是？","谢天华","上官天野","董岳","陈玄机",},
{3,"屠龙刀中有何秘密","无比锋利","内藏武功密籍","内藏兵法","价值连城",},
{3,"黄易的名字是？","刘化","黄世举","黄祖强","刘嵌",},
{3,"干儿朵的意思是 ？（射雕英雄传 ）","仓库","女卫兵","宫帐","大夫",},
{3,"忙豁仑纽察脱必赤颜的意思是 ？（射雕英雄传 ）","元朝密史","成吉思汗传","蒙古密史","九阴真经",},
{3,"李文秀在少女时代被称为草原上的 ？（白马啸西风 ）","金雀鸟","天铃鸟","银玲鸟","云雀鸟",},
{3,"沙漠迷宫中的统治者的卫士用的是什么制造的兵器 （书剑恩仇录 ）","金","木","铜","铁",},
{3,"段誉的母亲是什么民族？","汉","维吾尔","摆夷","傣",},
{3,"下面那部小说不是古龙的作品？","《剑花·烟雨·江南》","《流星·蝴蝶·剑》","《刀·剑·枪》","《拳头》",},
{3,"全真七子中谁被江湖中称为“铁脚仙”？","马钰","丘处机","王处一","刘处玄",},
{3,"郭靖把屠龙刀传给了：","郭芙","郭襄","郭破虏","杨过",},
{3,"张无忌的第几师伯第一个从万安寺的塔顶上跳下来？","4","3","2","7",},
{3,"劳德诺拜入华山派时，令狐冲已在华山门下几年？","14","13","12","11",},
{3,"项少龙在哪里说“一滴蜜糖的故事”？","将军府大厅","将军府花园","夫人府花园","夫人府大厅",},
{3,"大唐中石青璇和谁结婚？","跋风寒","寇仲","徐子陵","侯系白",},
{3,"“恶犬拦路”在打狗棒法中属什么诀？","杀","挡","封","诛",},
{3,"大唐中徐子陵用什么兵器？","剑","刀","不用","抢",},
{3,"谁解开了珍珑棋局？","乔峰","段誉","虚竹","慕容复",},
{3,"天龙八部》中“咱们学武之人，第一不可滥杀无辜”这句话出自谁口","虚竹","段誉","乔峰","王语嫣",},
{3,"大唐中的魔帅是谁？","祝玉研","庞斑","赵得言","石之轩",},
{3,"六脉神剑大指:","手厥阴心包经","手阳明大肠经","手太阴肺经","手少阳叁焦经",},
{3,"十个胖子九个富  只怕胖子没屁股，出自：","越女剑","碧血剑","鸳鸯刀","长生剑",},
{3,"湖边竹  盈盈绿  报平安  多喜乐，出自：","鹿鼎记","射雕英雄传","天龙八部","神雕侠侣",},
{3,"小昭和金花婆婆是什么关系","没有关系","姐妹","母女","上下属",},
{3,"天下万水俱同源,红花绿叶是一家出自：","白马啸西风","鹿鼎记","书剑恩仇录","鸳鸯刀",},
{3,"下面是小说哪一部不是司马翎所作？","剑神传","刀君剑后","饮马流花河","肚行剑",},
{3,"茅十八是（）的人物？","天龙八部","侠客行","鹿鼎记","笑傲江湖",},
{3,"韦小宝有几个是师父？","2个","1个","3个","4个",},
{3,"金花婆婆是原来明教中的谁？","波斯圣女","龙女","倚黛丝","传教使",},
{3,"陈嘉洛与乾隆的关系？","敌对","君臣","亲兄弟","结拜兄弟",},
{3,"《笑傲江湖曲》是从哪一支古区改编而来？","高山流水","梅花三弄","广陵散","将军行",},
{3,"不是古龙的小说的是","陆小凤","绝代双娇","越女剑","天涯明月刀",},
{3,"圣火令在明教第几代教主手中失落？","33","32","31","30",},
{3,"峨嵋派戒律中，“戒心向外人，倒反师门”是第几戒？","4","2","6","8",},
{3,"江南四友老三叫","黑白子","黄锺公","秃笔翁","丹青生",},
{3,"令狐冲如何得知岳灵珊与林之平成婚的消息的？","收到喜贴从何得知的","田伯光告诉他的","仪琳告诉他的","郑萼告诉他的",},
{3,"林平之的外公是谁?","王天霸","王霸天","王元霸","王霸元",},
{3,"令狐冲受伤后体内共有几道真气？","6","7","8","9",},
{3,"葵花宝典最后怎么样了？","被少林寺收回去了","任我行收回作为日月教镇教之宝","被任我行毁去了","被令狐冲毁去了",},
{3,"执五岳令旗阻止令狐冲任恒山派掌门的嵩山派高手是谁？","费彬","丁勉","乐厚","钟镇",},
{3,"令狐冲接任恒山掌门时派谁去报知华山派的？","仪文和仪真","于嫂和仪灵","于嫂和仪文","仪真和仪琳",},
{3,"<<血河车>>中方歌吟没学过谁的功夫？","宋雪宜","宋自雪","幽冥血奴","任狂",},
{3,"华山派的剑宗之祖是？","风清扬","岳肃","蔡子峰","林红叶",},
{3,"林图远的师傅是谁？","空渡","渡元","红叶","岳肃",},
{3,"最先发现林家辟邪剑谱的是谁？","林平之","沙天江","卜沉","令狐冲",},
{3,"桃谷六仙哪两个分不清是大是小？","桃枝仙、桃花仙","桃干仙、桃花仙","桃枝仙、桃叶仙","桃叶仙、桃花仙",},
{3,"嵩山派大嵩阳手费彬死于谁之手？","向问天","令狐冲","莫大先生","岳不群",},
{3,"恒山派四名大弟中没有下面谁？","仪质","仪和","仪琳","仪真",},
{3,"桃谷六仙中最胆小的是谁？","桃花仙","桃根仙","桃实仙","桃叶仙",},
{3,"梅庄四庄主丹青生说他一生有三绝，第一绝是什么？","品酒","书法","书画","剑术",},
{3,"笑傲江湖中死于华山的十大长老中飞天神魔是谁？","张乘风","范松","赵鹤","张乘云",},
{3,"林远图在少林为僧时的法号是什么?","红叶","玄渡","渡元","玄空",},
{3,"下面的人谁最喜欢狼?","李坏","卜鹰","萧十一郎","叶开",},
{3,"西门吹雪和叶孤成在那决斗?","逍遥阁","小住竹林","紫禁城","天涯海角",},
{3,"十大恶人谁的功夫最好？","轩辕三光","屠娇娇","杜杀","李大嘴",},
{3,"《寻秦记》中，红缨公子是：","武黑","严平","连晋","管而仲",},
{3,"大旗英雄传中夜帝之子名为","朱麻衣","麻衣客","朱藻","麻衣",},
{3,"韦小宝的爸爸是谁?","吴三桂","陈近南","不清楚","康熙",},
{3,"吕四娘看见了金世遗几次？？？","3","1","2","4",},
{3,"张无忌中玄冥二老的什么武功差点命丧黄泉?","如来神掌","寒冰神掌","玄冥神掌","霹雳玄冰掌",},
{3,"以下人物中谁不是金庸笔下的华山派的门人？","鲜于通","归辛树","何足道","英白罗",},
{3,"倚天剑和屠龙刀中有哪把剑的成分？","碧血剑","青冥剑","玄铁剑","金蛇剑",},
{3,"飞刀,又见飞刀中大内库银失窃多少?","300万两","150万两","170万两","400万两",},
{3,"飞刀,又见飞刀中小李探花李家庄园大少爷有几根手指?","10","7","4","5",},
{3,"飞刀,又见飞刀中李寻欢的儿子叫什么名字?","李月白","李秋水","李曼青","李青枫",},
{3,"飞刀,又见飞刀中月神姓什么?","白","雪","薛","梅",},
{3,"公子羽的替身最后结局是?","死于傅红雪之手","死于黑手组织","被迫自杀","死于公了羽手中",},
{3,"郭襄小时候吃了几个月什么动物的乳?","虎","牛","豹子","狼",},
{3,"天涯明月刀中真正的孔雀翎是在哪里?","下落不明","傅红雪手中","公子羽手中","四川唐门",},
{3,"天涯明月刀中燕南飞千方百计要找孔雀翎是想用它来对付谁?","公子羽","叶开","傅红雪","孔雀山庄",},
{3,"天涯明月刀中食子的真名是?","赵无极","赵无量","赵平","赵善",},
{3,"孔雀山庄被毁后庄主秋水清后来怎么样了?","被无名指杀死","被公孙屠杀死","自杀","失踪",},
{3,"天涯明月刀中孔雀山庄的孔雀翎是谁失落的?","秋水清","秋凤梧","秋一枫","秋无痕",},
{3,"天涯明月刀中孔雀是黑手组织五大首领中的哪一个?","中指","拇指","无名指","食指",},
{3,"天涯明月刀中黑手组织的食指在做杀手前没做过什么?","帮会头目","少林知客僧","镖局保镖","丐帮乞丐",},
{3,"天涯明月刀中燕南飞用的是什么剑?","游龙剑","紫薇剑","蔷薇剑","鱼肠剑",},
{3,"天涯明月刀中谁一直是公子羽的替身?","卓玉贞","孔雀","燕南飞","唐蓝",},
{3,"最初前来捉毛十八的官兵是谁","史柏","史龙","史松","万圭",},
{3,"天涯明月刀中真正的公子羽是谁?","唐蓝","公子羽","叶开","燕南飞",},
{3,"天下掌门大会是谁召开的","福康齐","福康禄","福康安","安禄齐",},
{3,"辟邪剑谱第一道法诀是什么?","神功称雄,挥刀自宫","欲练神功,挥刀自宫","武林称雄,挥剑自宫","欲练神功,挥剑自宫",},
{3,"泰山派天门死后是玉字辈谁没有争夺掌门人之位?","玉磐子","玉玑子","玉钟子","玉音子",},
{3,"林平之的结局是?","下落不明","被令狐冲杀死","被关在孤山梅庄","被岳不群杀死",},
{3,"福威镖局被毁后林平之曾以乞讨为生,他第一次讨得的食物是什么?","一碗白米饭","两个冷馒头","四个玉米棒子","半碗稀饭",},
{3,"笑傲江湖中于人豪用什么功夫打败了林震南从而擒住了他?","摧心掌","松风剑法","辟邪剑法","无影幻腿",},
{3,"武当七侠老七是？","张松溪","俞莲舟","莫声谷","殷梨亭",},
{3,"·武当七侠老二是？","俞代岱","张松溪","俞莲舟","莫声谷",},
{3,"哪个不是波斯三使？","流云使","辉月使","寒冰使","妙风使",},
{3,"在<武林外史>中谁是快乐财使","左公龙","金不换","金无望","王怜花",},
{3,"慕容复是哪个民族的人？","突厥","匈奴","鲜卑","汉族",},
{3,"《倚天屠龙记》中屠狮大会比武谁最终取得胜利","黄衣少女","张无忌","周芷若","张三丰",},
{3,"[雪山飞狐]的真正主角是:","苗人凤","胡斐","胡一刀","苗若兰",},
{3,"《鹿鼎记》中，谁是假太后？","苏荃","龙儿","毛东珠","柳燕",},
{3,"六脉神剑右手小指：","手厥阴心包经","手太阳小肠经","手少阴心经","手少阳叁焦经",},
{3,"六脉神剑食指:","手少阳叁焦经","手厥阴心包经","手阳明大肠经","手少阴心经",},
{3,"金庸笔下的汗血马的出产地是现今哪个国家？","哈萨克斯坦","乌兹别克斯坦","土库曼斯坦","吉尔吉斯斯坦",},
{3,"任盈盈用的是什么武器？","短剑","长剑","长短剑","长鞭",},
{3,"《倚天屠龙记》山中老人是哪国人？","天竺","大食","波斯","吐蕃",},
{3,"“他自横来他自恶、我自一口真气足“是哪种内功心法中的口诀？","易经筋","乾坤大挪移","九阳神功","太极神功",},
{3,"“夭骄三松郁青苍“是哪部书中的回目？","《射雕英雄传》","《天龙八部》","《倚天屠龙记》","《神雕侠侣》",},
{3,"赵敏身边的三个仆人中的老大原来是哪个门派的？","武当","少林","丐帮","明教",},
{3,"万劫谷的秘道藏在哪里？","水  底","山洞里","树洞里","夹墙里",},
{3,"花贵如是谁所写的人物？","梁羽生","柳残阳","李凉","古龙",},
{3,"洪金宝所使的武功是？","“霸王枪法”","“飞龙三绝”","“屠龙三式”","“阴阳神功”",},
{3,"争夺五岳掌门时左冷禅被岳不群伤到了哪里？","右眼","左眼","双眼","双手",},
{3,"明教厚土旗的旗使是谁？","辛力火","闻积松","颜坦","沈秋寒",},
{3,"在百晓生兵器谱之后谁又作了江湖名人榜?","明月心","叶开","公子羽","燕南飞",},
{3,"下列小说中哪一部不是古龙的七种武器系列之一?","霸王枪","孔雀翎","情人箭","离别钩",},
{3,"古龙的小说情人箭后来被改名为什么?","怒剑狂花","情人剑","怒剑","长生剑",},
{3,"宁死不吃亏是古龙的哪部小说中的人物?","楚留香传奇","边城浪子","绝代双骄","风云第一刀",},
{3,"“棺材里伸手”是古龙的哪部小说中的人物?","武林外史","绝代双骄","多情剑客无情剑","陆小风传奇系列",},
{3,"绝代双骄中十大恶人死于自相残杀的有几个？","9","7","8","6",},
{3,"七剑下天山中七剑之一的飞红巾一直喜欢的人是谁？","纳兰容若","穆朗","杨云聪","凌未风",},
{3,"阿朱最善易容，下面几个中他没有扮过谁？","白世镜","乔峰","慕容复","段正淳",},
{3,"《剑气洞彻九重天》中四季花魁谁最后跟了江枫?","杏花","菱花","梅花","荷花",},
{3,"《剑气洞彻九重天》是谁的作品？","柳残阳","独孤红","卧龙生","诸葛青云",},
{3,"《鬼堡》是谁的作品?","柳残阳","司马翎","陈青云","卧龙生",},
{3,"水浒传中宋江和方腊打仗胜利后谁穿了方腊的龙袍被治罪?","郁保四","时迁","阮小七","穆弘",},
{3,"水浒传中三十六天罡星最后一位是谁?","张顺","雷横","燕青","阮小七",},
{3,"水浒传中浪子燕青是谁的仆从?","李云","李应","卢俊义","孙立",},
{3,"水浒传中打虎将是谁?","武松","施恩","李忠","邹润",},
{3,"水浒传中下面哪个不是两兄弟?","朱贵和朱富","孙立和孙新","李云和李俊","张横和张顺",},
{3,"水浒传中天巧星是指谁?","智多星吴用","浪里白条张顺","浪子燕青","入云龙公孙胜",},
{3,"水浒传中呼保义是谁的绰号?","杨雄","卢俊义","宋江","樊瑞",},
{3,"金庸写的小说除了那14部外还有什么？","《乾坤残梦》","《七剑下天山》","《越女剑》","《五林外史》",},
{3,"独孤九剑第一式是什么?","破索式","破剑式","总诀式","破枪式",},
{3,"下列哪本不是萧逸武侠小说集的","剑气红颜","剑仙传奇","剑在天涯","甘十九妹",},
{3,"《鹿鼎记》中，韦小宝是怎样抓住吴应熊的？","天地会将其抓住","将其包围，守株待兔。","给他的马吃了巴豆","派人跟踪，下手擒住。",},
{3,"以下没有父子关系的是哪一对？","丁乘风和路小佳","柴玉关和王怜花","白天羽和傅红血","沈浪和阿飞",},
{3,"《鹿鼎记》中，被韦小宝演示的那招沐王府的武功叫什么？","平沙落雁","横扫千军","高山流水","顺水推舟",},
{3,"《鹿鼎记》中，韦小宝为救九难师太，杀了几个喇嘛？","7","3","5","8",},
{3,"全真七子最先死的是谁？","刘处玄","王处一","谭处端","郝大通",},
{3,"江南七怪最先死的是谁？","朱聪","南希仁","张阿生","韩小莹",},
{3,"段正淳的原配夫人刀白凤是怎么死的？","段延庆杀死的","慕容复杀死的","自杀的","没死，出家了",},
{3,"虚竹解开玲珑棋局是谁暗中帮他的？","吴领军","段玉","段延庆","玄难大师",},
{3,"敖拜被擒之后关押在哪？","大内天牢","索额图府","康亲王府","多隆府",},
{3,"令狐冲接任恒山掌门之位谁带着五岳令旗来阻止？","费彬","陆柏","乐厚","钟镇",},
{3,"〈九阴九阳〉的男主角段子羽是怎么得到〈九阴真经〉的？","娥眉掌门传与他的。","在崖壁无意发现。","从古墓偷得。","在鱼腹中发现。",},
{3,"不悔姑娘的母亲是谁？","殷素素","黛猗丝","纪晓芙","杨素平",},
{3,"独孤红的代表作不包括下列哪一个？","《紫凤钗》","《剑胆琴心》","《一代女皇》","《玉翎雕》",},
{3,"令狐冲的八师弟英白罗是谁杀死的？","林平之","劳德诺","岳不群","余沧海",},
{3,"张无忌不会什么武功?","九阳神功","七伤拳","九阴真经","圣火令",},
{3,"《乳房》一书谁写的？","梁羽生","古龙","温瑞安","黄易",},
{3,"在射雕英雄传里面傻姑的爹是怎样死的?","被重阳宫的人杀死的","病死的","皇宫盗宝","被黄药师打死的",},
{3,"下面谁不是碧水赋中人？","夜帝","日后","九子鬼母","风九幽",},
{3,"“武林外史”中谁和快活王没血缘关系","王怜花","白飞飞","沈浪","朱七七",},
{3,"“武林外史”中谁是快活王的义子","王怜花","沈浪","熊猫儿","宋离",},
{3,"明教锐金旗掌旗使姓：","李","张","吴","朱",},
{3,"<<饮马留花河>>的主人公的是谁的儿子?","将军","宰相","皇帝","大侠",},
{3,"<<白如云>>是谁的小说?","李凉","古龙","萧逸","倪匡",},
{3,"赵志敬他们俩为了向小龙女保证的代价是什么？","功力","性命","小拇指","名誉",},
{3,"倚天剑里的是什么？","武墓遗书","玄天九剑","九阴真经","九阳神功",},
{3,"泰山派创派祖师是谁？","天机道人","都灵道人","东灵道人","神玑道人",},
{3,"梁羽生写的《剑网尘丝》的下一部是什么？","《七种武器》","《多情剑客无情剑》","《幻剑灵旗》","《长生剑》",},
{3,"<飘香剑雨>中天争教主的武功被谁所废?","阮伟","吕南人","公输羊","许白",},
{3,"<<飞狐外传>>中毒手药王去世前的名字？","微嗔","一嗔","无嗔","大嗔",},
{3,"小龙女是古墓派第几代传人","二","一","三","四",},
{3,"在风陵渡口，郭襄用什么换酒菜？","项链","金箬","金钗","手镯",},
{3,"《七种武器》实际完成了几种？","4","5","6","7",},
{3,"《风云第一刀》的后传是什么？","大人物","天涯明月刀","《九月鹰飞》","七杀手",},
{3,"<<萍踪侠影>>中云澄和云蕾是什么关系？","祖孙","兄妹","父女","母子",},
{3,"散花女侠是谁的作品","李凉","柳残阳","梁羽生","卧龙生",},
{3,"七剑下天山中“老”七剑和“新”七剑所共有的是？","易兰珠","凌未风","飞红巾","楚昭南",},
{3,"朱丹臣是哪个故事中的人物？","《侠客行》","《碧血剑》","《天龙八部》","《笑傲江湖》",},
{3,"洪七公有几根手指？","10根","8根","9根","11根",},
{3,"项少龙的二哥是谁？","王戬","荆俊","腾翼","王遨",},
{3,"狄云在监狱中丁典为何要打他?","怕他要杀自己","丁典有虐待癖","怕他是奸细","狄云常骂他",},
{3,"青城派余沧海所住的道观叫什么？","青松观","金光观","松风观","素月观",},
{3,"裘千仞是谁打死的？","黄老邪","霍都","金轮法王","英姑",},
{3,"天龙八部中的冰蚕出自哪个山？","武当山","天山","昆仑山","鸡冠山",},
{3,"<天龙八部>中,谭公称呼谭婆什么?","小鹃","小娟","阿慧","阿蕙",},
{3,"矮脚虎是谁的绰号","邹渊","马磷","王英","邹容",},
{3,"在〈卧虎藏龙〉中，李慕白使用的长剑叫什么名字?","赤剑","紫烟剑","青冥剑","紫青剑",},
{3,"张无忌学成乾坤大挪移的时候谁在旁边？","殷离","周芷若","小昭","赵敏",},
{3,"是谁把谢逊带离冰火岛的？","成昆","张无忌","紫衫龙王","张翠山",},
{3,"劳德诺在投华山派之前是哪个门派的?","日月神教","衡山派","嵩山派","魔教",},
{3,"谁把韦小宝甜言蜜语的骗到神龙岛?","双儿","沐剑屏","方怡","康熙",},
{3,"胡斐幼年在商家堡不敌王剑杰是谁指点了他?","文泰来","陆菲青","赵半山","无尘道长",},
{3,"<<寻秦记>>中秦始皇叫什么?","项鹰","赢政","公子盘","吕不韦",},
{3,"方振眉成名５年中杀了多少人？","25","24","无","无数",},
{3,"上官小仙一直在追求谁？","荆无命","傅红雪","叶开","阿飞",},
{3,"卧龙生一共有多少套小说?","40","37","39","38",},
{3,"萧逸定居哪里？","香港","加拿大","美国","澳大利亚",},
{3,"《天马霜衣》是谁的作品？","倪匡","古龙","卧龙生","温瑞安",},
{3,"《陆小凤》中木道人是怎么死的？","花满楼","陆小凤","被自己女儿杀的","西门吹雪",},
{3,"黄眉僧70岁以后有几个脚趾？","8个","10个","9个","7个",},
{3,"多情环代表的武器是什么?","爱情","自信","仇恨","缠绵",},
{3,"《倚天屠龙记》的周芷偌是第几代掌门？","6","5","4","7",},
{3,"段正明出家后的法号是什么？","本参","本因","本尘","本相",},
{3,"下列哪部中不是《陆小凤》系列的？","决战前后","幽灵山庄","决不低头","剑神一笑",},
{3,"《剑气书香》由谁代笔完成的？","碎梅","司马紫烟","墨余生","东楼",},
{3,"中国第一位大侠是","李白","孔丘","墨翟","李寻欢",},
{3,"嵩山派中称为大阴阳手的是谁？","费彬","左泠禅","乐厚","钟镇",},
{3,"韦小宝第一个官是什么","青木堂香主","尚膳司总管","尚膳司副总管","白龙使",},
{3,"哪个是鸣玉坊四大院子之一","鸣香院","丽香院","丽春院","好好院",},
{3,"下面哪个人不是段正淳的亲生骨肉？","阿紫","阿朱","段誉","钟玲",},
{3,"花无缺去求苏樱治伤时称苏樱做什么?","苏大夫","苏前辈","苏老先生","苏姑娘",},
{3,"“听话才是乖孩子,姐姐买糖给你吃”,这句话是苏樱对谁的?","铁心兰","江小鱼","江玉郎","花无缺",},
{3,"金庸小说中下面哪一部没有出现过华山派?","碧血剑","倚天屠龙记","雪山飞狐","鹿鼎记",},
{3,"下面哪一位不是金庸小说《雪山飞狐》里的人物？","殷吉","曹云奇","刘鹤真","熊元献",},
{3,"金庸小说中铁琴先生是哪个门派中人?","衡山","华山","昆仑","崆峒",},
{3,"下面不是金庸写的小说是哪一部？","《鸳鸯刀》","《飞狐外传》","《碧玉刀》","《越女剑》",},
{3,"倚天屠龙记中殷素素和阿蛛是什么关系?","师徒","没有关系","姑侄","同门",},
{3,"倚天屠龙记中张无忌最先认识下面谁?","杨不悔","殷离","周芷若","赵敏",},
{3,"倚天屠龙记中小昭姓什么?","宋","殷","韩","赵",},
{3,"倚天屠龙记中金花婆婆和小昭是什么关系?","姑侄","师徒","母女","没有关系",},
{3,"丁当是下面哪本小说中的人物?","多情剑客无情剑","侠隐岛","侠客行","边城浪子",},
{3,"边城浪子中路小佳的师父是谁?","李寻欢","阿飞","荆无命","智空大师",},
{3,"风云第一刀中真正的梅花大盗是谁?","百晓生","被阿飞杀死了","林仙儿","青魔手伊哭",},
{3,"山西城十里,长亭外林下,这句话是谁写给李寻欢的?","林诗音","林仙儿","上官金虹","荆无命",},
{3,"<鬼堡>是谁的作品?","古龙","黄易","陈青云","梁羽生",},
{3,"红花会中，武诸葛是：","蒋四根","章进","徐天宏","石双英",},
{3,"红花会中，“鬼见愁”是：","章进","徐天宏","石双英","蒋四根",},
{3,"<<倚天屠龙记>>中谁最先出场","杨过","何足道","郭襄","张无忌",},
{3,"全真七子中谁最先死","孙不二","马珏","谭处端","丘处机",},
{3,"天龙八部里叶二娘在虚竹的背上烙了几个香疤？","八个","十个","九个","十二个",},
{3,"大唐双龙传中寇仲有几个老婆!","3","4","2","1",},
{3,"风云第一刀中少林寺叛徒是谁？","心湖","心灯","心鉴","心烛",},
{3,"风云第一刀中少林掌门人是谁？","心眉","心树","心湖","心鉴",},
{3,"和少林僧人一起押送李寻欢回少林的田七是谁杀死的？","李寻欢","阿飞","极乐峒主","蓝蝎子",},
{3,"风云第一刀中下面不会点穴功夫是谁？","林诗音","荆无命","阿飞","林仙儿",},
{3,"绝代双骄中罗三、罗九兄弟本来姓什么？","司徒","司马","欧阳","西门",},
{3,"风云第一刀中跟随李寻欢的侍从哪什么名字？","大力神段开山","血剑阴无极","铁甲金刚铁传甲","赴汤蹈火西门烈",},
{3,"江小鱼和花无缺决战前夕,谁住在玄武宫的方丈室?","铁心兰","江小鱼","花无缺","邀月宫主和怜星宫主",},
{3,"慕容家五姑爷是谁?","梅花公子梅仲良","美玉剑客陈凤超","神眼书生骆道明","洞庭才子柳鹤人",},
{3,"九秀山庄九姐妹中武功最高的是哪个?","慕容九","慕容七娘","慕容双","慕容珊珊",},
{3,"兴云庄保管的武功密籍是谁写的?","李寻欢","沈浪","王怜花","白飞飞",},
{3,"风云第一刀中兴云庄外的孙驼子与天机老人是什么关系?","没有关系","同一人","父子","师徒",},
{3,"百晓生兵器谱排名第二的上官金虹最后结局?","被阿飞杀死","被荆无命杀死","被小李飞刀杀死","被天机老人杀死",},
{3,"百晓生兵器谱排名第一的天机老人的兵器是什么?","追魂索","天机琴","如意棒","翡翠棋",},
{3,"张无忌的义父谢逊是被谁弄瞎了眼？","殷野王","张无忌","殷素素","成昆",},
{3,"广宁子是？","刘处玄","谭处端","郝大通","王处一",},
{3,"洪凌波是哪本小说中的人物？","《笑傲江湖》","《射雕英雄传》","《神雕侠侣》","《碧血剑》",},
{3,"十方秀才是：","袁冠南","余鱼同","全冠清","李志常",},
{3,"《笑傲江湖》中，青龙堂长老是：","童百熊","上官云","贾布","王诚",},
{3,"尼摩星是哪本小说中的人物？","《笑傲江湖》","《射雕英雄传》","《神雕侠侣》","《碧血剑》",},
{3,"《流星 蝴蝶 剑》是谁的作品？","陈青云","金庸","古龙","梁雨生",},
{3,"女贞族中谁与萧峰是兄弟？","完颜康","完颜洪列","完颜阿骨达","完颜索朗",},
{3,"慕容四大护卫中第四叫？","公治乾","包不同","风波恶","邓百川",},
{3,"铁掌帮帮主是谁?","魏小宝","向天问","裘千仞","陈家洛",},
{3,"黄蓉为什么不能练左右互搏？","是女人","太苯","太聪明","结婚了",},
{3,"<白眉大侠>中刘世杰的绰号?","少侠","笑面郎君","义侠太保","飞面杀手",},
{3,"<白眉大侠>中艾虎的师傅是谁?","东方侠","南侠","北侠","大侠",},
{3,"江南七怪和谁打过赌","周伯通","刘处玄","丘处机","王处一",},
{3,"公孙绿萼是谁杀的","裘千尺","黄蓉","公孙止","李莫愁",},
{3,"大悲老人临死前送给石破天什么东西？","风铃","玩具","泥人","不清楚",},
{3,"陆非青刚出场的时候叫什么名字？","封万里","李沉舟","陆高止","朱顺水",},
{3,"关中六魔的第三位是谁？","哈合台","腾一雷","焦文期","风九幽",},
{3,"九子鬼母共收了几个女徒弟？","9","8","7","6",},
{3,"《铁血大旗》中，夜帝姓什么？","水","王","朱","白",},
{3,"《侠客行》中，阿绣的父亲是谁？","封万里","白自在","白万剑","史亿刀",},
{3,"梁羽生一共有几部作品？","36","35","34","37",},
{3,"神龙教原白龙使是：","许雪亭","韦小宝","钟志灵","殷锦",},
{3,"康熙原名","小玄子","玄骅","玄烨","玄丰",},
{3,"瑛姑在交出九尾灵狐前，要求答应","杀了慈恩","弄清楚杨过是谁","见老顽童","要个一灯住在一起？",},
{3,"射雕英雄传中傻姑姓什么？","陈","梅","曲","陆",},
{3,"郭靖受伤在牛家村与黄蓉在密室里疗伤几天？","8","6","7","9",},
{3,"侠客行里石破天的刀法共有几式?","38","36","37","49",},
{3,"红花会四当家是谁？","骆 冰","余鱼同","文泰来","陈家洛",},
{3,"乔峰比段誉大几岁？","13岁","12岁","11岁","10岁",},
{3,"四大恶人中“恶贯满盈”指的是谁？","南海恶神","叶二娘","段延庆","云中鹤",},
{3,"在《神雕侠侣》中，公孙止勾搭上了的婢女的名字是甚么?","碧绿","双儿","柔儿","画眉",},
{3,"〈神州无敌〉后传是","〈侠少·唐方一战〉","〈大侠传奇〉","〈血河车〉","〈四大名捕〉",},
{3,"杨过自创的掌上绝学名叫什么?","天马流星拳","化骨绵掌","黯然消魂掌","太玄经",},
{3,"大唐双龙传的美人儿师傅是谁？","师妃暄","沈落雁","云玉真","楚楚",},
{3,"大理天龙寺的正式名称是什么","身戒寺","大轮寺","崇圣寺","清凉寺",},
{3,"黑玉断续膏在哪一部中出现?","天龙八部","鹿鼎记","倚天屠龙记","爱你一万年",},
{3,"袁紫衣的出家的法名叫什么？","圆梦","圆初","圆性","圆清",},
{3,"《雪山飞狐》中，七心海棠是用什么来浇的？","醋","水","酒","油",},
{3,"《风云》中霍惊觉的真名叫什么？","断浪","聂风","步惊云","秦霜",},
{3,"项少龙是被哪个科学疯子送进古代的？","杨疯子","卢疯子","马疯子","苟疯子",},
{3,"《绝代双骄》中李大嘴第一次吃人是吃谁？","小孩","他仇人","他妻子","女人",},
{3,"袁承志的大师兄是谁？","归钟","归辛树","黄真","冯难敌",},
{3,"《倚天屠龙记》张无忌娶谁为妻时，跟他人跑了","阿珠","赵敏","周芷若","丁敏君",},
{3,"《铁血丹心》中玄铁宝剑最后在谁手上？","史红英","厉南星","金逐流","竺尚义",},
{3,"《铁血丹心》中史白都是怎么死的？","被别人杀死的","被毒死的","自杀","不清楚",},
{3,"① 青城派的哪一位弟子在酒楼上被令狐冲杀死？","方人智","申人俊","罗人杰","余人豪",},
{3,"下列人物谁不是明教中人?","杨逍","范遥","纪晓芙","谢逊",},
{3,"《侠古丹心》中金逐流喜欢谁？","封姑娘","公孙燕","史红英","扬姑娘",},
{3,"《侠古丹心》中谁和厉南星最后是夫妻？","封姑娘","史红英","公孙燕","丐帮帮主的女儿",},
{3,"金风细雨楼的“无法无天”部队是谁率领的？","刀南神","郭东神","莫北神","薛西神",},
{3,"广陵剑的男主角是谁？","单拨群","张无忌","陈石星","雷震天",},
{3,"谁是丐帮污衣派的长老","彭长老","简长老","鲁长老","梁长老",},
{3,"看守金毛狮王的三个和尚是谁","渡厄、渡难、渡善","不见、空智、控闻","渡厄、渡难、渡劫","渡难、渡劫、渡善",},
{3,"“风雪惊变”是哪部小说的首回","侠客行","白马啸西风","射雕英雄传","连城决",},
{3,"钟灵是谁的女儿：","段正明","钟万仇","段正淳","延庆太子",},
{3,"云中鹤所用的兵器是：","双剑","双刀","钢爪","双锏",},
{3,"鸠摩智是那国的护法师：","大宋","大明","吐蕃","大理",},
{3,"武穆遗书是放在什么地方？","牛家村","临安皇宫","铁掌峰","太湖陆家庄",},
{3,"《寻秦记》中，小盘的亲生母亲是","赵雅","赵致","赵妮","赵倩",},
{3,"韦小宝先在哪一座寺出家？","天龙寺","少林寺","清凉寺","皇觉寺",},
{3,"“血战花街”是黄易的哪一部小说中的故事：","寻秦记","破碎虚空","覆雨翻云","大唐双龙传",},
{3,"大唐双龙传中四大伐主中谁居住在南方?","宇文伐","李伐","宋伐","独孤伐",},
{3,"黄易的《大剑师》是接着他哪一部小说的？","兽性回归","大唐双龙记","超级战士","月魔",},
{3,"金银冠蛇毒性天下排名第几?","48","46","47","49",},
{3,"雁门关一役中原武林一方共有多少人手?","17","22","21","18",},
{3,"第一次华山论剑和第二次华山论剑相隔几年?","20","30","25","15",},
{3,"《倚天屠龙记》中殷离学的是什么武功？","鹰爪功","越女剑法","千蛛万毒手","龙爪手",},
{3,"东冥宫主是谁的妻子","尚宏","尚中","尚明","尚飞",},
{4,"具有反宫骨和无双刃的人是谁?","丁小勾","韦小宝","绿小千","杨小邪",},
{4,"被杨过杀死的蒙古皇帝是？","贵由","拖雷","蒙哥","铁木真",},
{4,"杨过将孙婆婆放在了古墓中的第几具石棺？","1","4","3","5",},
{4,"“笑傲江湖”的作者之一刘正风是哪一派的人物？","泰山派","嵩山派","衡山派","华山派",},
{4,"天龙八部中的“聪辩先生”是谁的外号？","苏星海","丁春秋","苏星河","苏兴海",},
{4,"圣火令是从那里传入中原的？","伊拉克","印度","波丝","日本",},
{4,"《绝代双骄》中欧阳丁， 欧阳当兄弟化名为","丁大，当二","张三，李四","罗三，罗九","丁丁，当当",},
{4,"连城诀的原名是？","唐赋诀","空心剑","素心剑","诗剑诀",},
{4,"阎王敌薛伸医的真名:","薛慕百","薛驱华","薛慕华","薛骐",},
{4,"清静散人孙不二明媒正嫁的丈夫是 ？《神雕侠侣 》","王处一","潭处端","马钰","朱子柳",},
{4,"天龙八部 书中哪部份是由别人代写的 ？","乔峰误伤阿朱","大战聚贤庄","阿紫瞎眼","阿紫虐待刘坦之",},
{4,"《雪山飞狐》的真正主角是_______。","苗人凤","苗若兰","胡一刀","胡斐",},
{4,"天龙八部中,马大元是被谁害死的?","马夫人和陈长老","马夫人和全冠清","马夫人和白世镜","蒙面黑衣人",},
{4,"〈天龙卷〉是谁的代表作？","慕容美","秦红","高庸","卧龙生",},
{4,"〈九阳真经〉是写在什么地方的？","〈金刚经〉背面","〈金刚经〉夹缝","〈枷楞经〉夹缝","猴皮上",},
{4,"古龙的处女作是？","苍穹神剑","春","从北国到南国","夜色",},
{4,"下面哪个武侠作者发表小说的时候所用的笔名最多？","古龙","曹若冰","温瑞安","卫斯理",},
{4,"下面那个作者发表武侠小说时用了两个笔名？","陈青云","卧龙生","曹若冰","高庸",},
{4,"《金剑寒梅》是谁的代表作？","古龙","萧逸","曹若冰","诸葛青云",},
{4,"王语嫣指出秦家寨的五虎断门刀缺了几招？","6","4","5","7",},
{4,"祖千秋指教令狐冲，喝梨花酒用？","琉璃杯","夜光杯","翡翠杯","犀角杯",},
{4,"《流星·蝴蝶·剑》中“老伯”是根据什么人物写的？","法官","牧师","教父","父亲",},
{4,"《流星·蝴蝶·剑》是在哪一部小说的基础上写成的？","《呼啸山庄》","《飘》","《教父》","《红与黑》",},
{4,"在《鹿鼎记》中所提到的《射雕英雄传》的人物是谁","黄蓉","郭靖","欧阳峰","黄药师",},
{4,"以下哪部小说不是戊戟写的?","奇侠传奇","江湖传奇","飞风传奇","青凤传奇",},
{4,"天龙八部中，四大恶人的“穷凶极恶”排行第几？","2","1","4","3",},
{4,"天龙八部中，四大恶人的“无恶不作”排行第几？","3","1","2","4",},
{4,"天龙八部中，四大恶人的“穷凶极恶”是谁？","叶二娘","段延庆","云中鹤","南海鳄神",},
{4,"赵敏的哥哥是谁","赵括","赵半山","王保儿","黑侠",},
{4,"丑剑客一书是谁写的","柳残阳","古龙","陈青云","都不是",},
{4,"按照金庸在《越女剑》里的说法，“西子捧心”是因为","生病","思念情人","剑气所伤","中毒",},
{4,"纪晓芙的女儿叫什么？","杨逍","纪昀","杨不悔","范瑶",},
{4,"《凤凰罗汉坐山虎》的作者？？","李凉","金庸","柳残阳","温瑞安",},
{4,"陆小凤凤舞九天中太平王世子是谁？","木道人","老实和尚","宫九","司空摘星",},
{4,"彭和尚的真名?","彭风","彭大同","彭莹玉","彭傲",},
{4,"无色禅师曾送什么礼物给郭襄?","一把剑","一窜佛珠","一对罗汉","一件宝衣",},
{4,"灭绝师抬曾打张无忌三掌,第二掌叫什么?","佛光普照","飘雪穿云掌","截手九式","推心掌",},
{4,"郭襄上少林,当时的方丈是谁?","无相","无色","天鸣","无觉",},
{4,"<倚天屠龙记>中昆仑派成名数百年的剑法是什么?","催青剑法","玉女剑法","两仪剑法","仪心剑法",},
{4,"<倚天屠龙记>少林四大神僧谁先死?","空智","空闻","空见","空性",},
{4,"紫衫龙王离开光明顶后，谁守在地道入口？","范遥","杨逍","谢逊","殷天正",},
{4,"任我行等人上黑木崖时，被东方不败杀死的是？","杨莲亭","向问天","童百熊","上官云",},
{4,"六大派围攻光明顶时，张无忌误认为成昆被谁打死","杨逍","殷天正","殷野王","韦一笑",},
{4,"帮胡斐吸毒疗伤的女孩叫？","何锡手","袁紫夜","程灵素","香香公主",},
{4,"古龙的代表作不包括：","长生剑","白玉老虎","弹指惊雷","霸王枪",},
{4,"假冒燕南天的路仲达是被谁杀死的?","花无缺","江别鹤","江玉郎","自杀",},
{4,"《好运小吉神》快乐营的人用何种方法从白莲教主处得到参王？","硬抢","诈骗","隐身草","迷药",},
{4,"<<寻秦记>>中项少龙的结拜兄弟里荆俊排第几?","2","3","4","1",},
{4,"《寻秦记》中赵国大公主是谁？","赵匡","赵菁","赵雅","赵穆",},
{4,"林平之在那里得到辟邪剑谱？","令狐冲身上","福建家里的佛堂里","华山师傅房间窗边","任我行手里",},
{4,"张三丰创立武当派前在什么地方学艺，学了什么武功？","少林寺，九阴真经","清城派，九阴真经","少林寺，九阳神功","华山派，九阴真经",},
{4,"石破天利用玄铁令向谢烟客提了什么要求","替石破天寻找阿黄","替石破天寻找妈妈","管教石中玉","请谢烟客以后不再杀人",},
{4,"下面那部武侠小说出现过空心菜这个人物","日月神剑","书剑恩仇录","连城决","蜀山奇侠",},
{4,"《神雕侠侣》中蒙古大军兵临襄阳城下时，黄药师摆下什么大阵？","三十六宿大阵","二十四宿大阵","二十八宿大阵","十八宿大阵",},
{4,"杨过在重阳宫曾把哪位道长扣在大钟之下？","王处一","丘处机","孙不二","刘处玄",},
{4,"杨过和小龙女在重阳宫被困，是谁最先搅局？","丘处机","黄蓉","周伯通","王处一",},
{4,"杨过和小龙女再哪里拜堂成亲？","桃花岛","活死人墓","重阳宫","决情谷",},
{4,"《萍踪侠影录》中经历的年间明朝正和谁连年交战？","女真","匈奴","瓦刺","契丹",},
{4,"《素手劫》中的素手指的是谁？","叶湘绮","田秀玲","兰姑","常素玉",},
{4,"《素手劫》的作者是谁？","温瑞安","梁羽生","卧龙生","司马翔",},
{4,"古龙是在几岁时发表他的处女作的？","18","17","19","20",},
{4,"古龙的七种武器一共完成了几种","5","4","6","7",},
{4,"天龙八部中段誉的母亲的道号是什么？","玉闲散人","玉真散人","玉虚散人","玉清散人",},
{4,"谁从俞代岩手里抢走屠龙刀？","白龟寿","殷素素","殷野王","常金鹏",},
{4,"空见受谢逊几掌七伤拳而死？","8","5","13","10",},
{4,"张无忌在绝顶峰练九阴真经几年？","8","3","5","10",},
{4,"蛛儿替张无忌杀了谁？","卫壁","无青婴","朱九真","朱长龄",},
{4,"《倚天屠龙记》天鹰教的天沛堂堂主是谁？","殷素素","殷野王","李天恒","殷天正",},
{4,"《倚天屠龙记》何太冲的原配夫人是？","春儿","五姑","班淑娴","卫四娘",},
{4,"胡青牛的妹妹是被谁害死？","何太冲","西华子","鲜于通","杨顶天",},
{4,"谁杀死了云靖","张丹枫","张宗周","王振","祈镇",},
{4,"<<流星 蝴蝶 剑>>中的叶翔一共杀过多少人","35","27","30","17",},
{4,"“淘氣世家”里的郝大的情人是誰？郝寶的初戀情人是誰？","孫大娘，鬼娘子","鬼娘子，玉女婆婆","玉女婆婆，小雪","小雪，孫大娘",},
{4,"戚芳的女儿叫什么","万云","黄花菜","空心菜","万生",},
{4,"下面哪个人在古龙的书中以狼自喻？","孟星魂","李寻欢","萧十一郎","白玉京",},
{4,"下面哪个人没有背叛“老伯”？《流星·蝴蝶·剑》","陆漫天","冯祥","林秀","凤凤",},
{4,"骆冰在红花会里排第几？","10","12","11","9",},
{4,"杨康的义父完颜洪列是金章宗的第几子？","4","8","6","2",},
{4,"下面哪部小说是先有剧本，后写成小说？","《大剑师》","《楚留香传奇》","《萧十一郎》","《欢乐英雄》",},
{4,"袁承志刚入华山门下时，穆人清教了他什么功夫？","破玉拳","伏虎拳","十锦段","混元掌",},
{4,"秦元浩中了文道庄哪种暗算？","毒镖","暗器","千日醉","毒药",},
{4,"袁承志做了几个省的盟主？","16","15","14","13",},
{4,"《绝代双骄》中的地下宫殿中的武功秘芨记载了几位高手的武功？","7","6","5","8",},
{4,"铁心兰刚出场时穿的是什么颜色的衣服？","蓝色","红色","白色","黄色",},
{4,"小仙女张菁被小鱼儿戏弄了几次？","2","3","4","5",},
{4,"铁胆周仲英有几个儿子(书剑恩仇录)","1","2","3","4",},
{4,"古龙的“英雄无泪”一书中 卓东来是谁杀死的？","朱猛","自杀","小高","萧洫泪",},
{4,"《大唐双龙传》中的宝藏的机关是由谁设计的？","鲁秩","鲁班","鲁妙子","鲁智",},
{4,"在龙门客栈里谁冒死送周淮安他们从暗道里逃走","邱莫言","杨宇轩","金镶玉","曹少钦",},
{4,"全冠清是哪舵舵主？","大义分舵","大勇分舵","大智分舵","大仁分舵",},
{4,"青魔手，乃采集金铁之英，淬以百毒，锻冶（）年而成。","3年","10年","7年","5年",},
{4,"在百晓生的兵器谱排行中列第4的是谁？","阿飞","李寻欢","郭嵩阳","荆无命",},
{4,"柳长街是谁笔下的人物？","南陵笑笑生","金庸","古龙","欧阳兰",},
{4,"《倚天屠龙记》成昆杀了谢逊一家多少口","18","11","13","21",},
{4,"杨小邪是怎么进关的？","马车","轻功","步行","被掳去",},
{4,"丁不三,丁不四是那个门派?","叮当门","洛阳丁氏","六合丁氏","没有门派",},
{4,"陆菲青使用什么宝剑？","君子剑","草织剑","白龙剑","青虹剑",},
{4,"瑛姑在交出九尾灵狐前，要求答应：","杀了慈恩","弄清楚杨过是谁","见老顽童","要个一灯住在一起？",},
{4,"在《白马啸西风中》谁杀死了白马李三？","陈达海","史仲俊","霍元龙","上官虹",},
{4,"无量剑东宗掌门是左子穆，那西宗掌门是？","龚光杰","马五德","辛双清","容子矩",},
{4,"在〈笑傲江湖〉最后一章中成高带了多少炸药？","5000斤","1万斤","2万斤","15000斤",},
{4,"《侠客行》中出场的人物谁第一个拥有玄铁令？","石清","石破天","吴道通","白万剑",},
{4,"洪七公教给杨过什么？","打狗棍心法","打狗棍","打狗棍招式","降龙十八掌",},
{4,"《侠客行》中李白的《侠客行》古风写的是谁和谁的故事？","朱亥和信陵君","候赢和信陵君","候赢和朱亥","候赢和管亥",},
{4,"五犬开花旗是什么颜色？","白色","红色","黑色","金色",},
{4,"胡斐得到《胡家刀法》时，《胡家刀法》缺几页？","3","1","2","4",},
{4,"《偷拳》的作者是","卧龙生","还珠楼主","宫白羽","墨馀生",},
{4,"“意在剑先，绵绵不绝”是形容哪种剑法？","金蛇剑法","独孤九剑","太极剑","玄铁剑法",},
{4,"姑苏慕容氏的“以彼之道，还施彼身”是谁创出的？","慕容垂","慕容格","慕容龙成","慕容德",},
{4,"昆仑派分光剑法共有几招？","96招","72招","108招","100招",},
{4,"兴汉丐帮是哪部书中的?","神雕侠侣","射雕英雄传","雪山飞狐","飞狐外传",},
{4,"郭靖黄蓉第一次见一灯大师时，渔樵耕读中谁没有为难他们？","耕","渔","樵","读",},
{4,"飞狐外传中说皇帝身边的侍卫共分几等?","5","3","4","6",},
{4,"令狐冲在山洞中与田伯光打斗时冒充了谁的名字？","左冷禅","岳不群","劳德诺","余沧海",},
{4,"《寻秦记》中项少龙一共化成几个人进行活动？","二个","一个","三个","四个",},
{4,"在黄河岸边祖千秋拿出来的第一个酒杯是什么酒杯?","古藤杯","犀角杯","羊脂白玉杯","翡翠杯",},
{4,"在黄河岸边祖千秋一闻酒气，便知道这是藏了多少年的二锅头汾酒?","60","63","62","58",},
{4,"项少龙没有到过的国家是那一个?","韩国","楚国","燕国","齐国",},
{4,"明教厚土旗掌旗使是:","韦焕","蔡辛","颜垣","范遥",},
{4,"全真七子的天罡北斗阵中丘处机站在什么位置?","天玑","天璇","天权","天枢",},
{4,"寻秦记里面项羽是谁的亲生儿子？","荆俊","项少龙","滕翼","王剪",},
{4,"令狐冲最后学到的内功是什么？","紫霞神功","扬青风所传内功","易筋经","洗髓经",},
{4,"玉真子是那个门派的？《碧血剑》","华山派","全真教","铁剑门","武当派",},
{4,"圣手神偷是谁？《碧血剑》","程青竹","沙广天","胡桂南","铁罗汉",},
{4,"项少龙的儿子是被谁杀的?","田单","秦始皇","刘邦","李斯",},
{4,"张无忌把武穆遗书交给谁","朱元璋","常遇春","徐达","杨逍",},
{4,"钟万仇的外号是什么？","嫉恶如仇","见人就杀","马王神","没有外号",},
{4,"《天龙八部》中天龙寺的名字是什么？","神寺","龙天","崇圣","天龙",},
{4,"明教每一代有几位圣女","5","4","3","2",},
{4,"是谁和韦小宝带兵去抄鳌拜家的？","康亲王","多隆","索额图","海大富",},
{4,"明教五散人中武功最高的是：","彭莹玉","铁冠道人","冷谦","说不得",},
{4,"下列人物中属于全真第二代弟子的是谁","王重阳","周伯通","马钰","尹志平",},
{4,"三少爷的剑是谁写的？","马荣成","黄易","古龙","金庸",},
{4,"江南七怪老四是","张啊生","全金发","南希仁","韩宝驹",},
{4,"华筝的归宿是哪里？","留在大漠","跟随郭靖","投奔窝阔台","伤心欲绝，自杀",},
{4,"郭襄的生日是？","十月十六","十月二十六","十月二十四","十月二十五",},
{4,"徐子陵和寇仲、跋锋寒在塞外被颉利围困时想到的女人是？","石青璇","师妃暄","商秀徇","沈落雁",},
{4,"金庸的主角能学左右互搏吗","不知道","不能","能","有时能",},
{4,"郭襄第一次遇到张三丰时,他在追尹克西和谁","金轮法王","马光佐","潇湘子","尼摩星",},
{4,"四大名捕老大是","追命","铁手","无情","冷血",},
{4,"笑傲江湖中讲到过几个人会葵花宝典中的武功？","3","4","5","6",},
{4,"赵敏与波斯三使打斗是使用的拼命三招中有？","大漠飞沙","金针渡劫","天地同寿","玉女心经",},
{4,"丐帮中哪位长老刺杀了契丹国左路元帅耶律不鲁？","宋长老","奚长老","陈长老","白长老",},
{4,"萧峰小时候杀过一个什么人？","教书的","剑客","大夫","大盗",},
{4,"“虫豸凝寒掌作冰，草木残生颅铸 出自金庸的哪部作品？","飞狐外传","笑傲江湖","天龙八部","碧血剑",},
{4,"不死神龙是那部小说的人物？","仙剑奇侠传","笑侠楚留香","护花铃","小李飞刀",},
{4,"破恒山剑法为谁人所破","周洪鹰，周铁鹰","张乘云张乘风","范松赵鹤","贾不，贾忖",},
{4,"《云海玉弓缘》是谁的作品？","陈青云","古龙","梁羽生","黄易",},
{4,"神雕侠侣第一回回目是？","全真门下","故人之子","风月无情","玉女心经",},
{4,"铜尸的练门在哪里？","掖下","头顶","肚脐","脚底",},
{4,"<<依天屠龙记>>中谢逊首次在书中亮相是在哪儿?","龙门镖局","冰火岛","王盘山","少室山",},
{4,"当温青青最初出场时，她偷了多少两黄金？","1000两","1500两","2000两","5000两",},
{4,"郭靖第一个订婚对象是谁？","黄蓉","华筝","穆念慈","程谣迦",},
{4,"冷月宝刀被苗人凤藏在哪里？","苗人凤自己那里","苗人凤的女儿那里","胡一刀的墓里","胡一刀的儿子那里",},
{4,"铁掌帮掌门后来成了谁的徒弟？","周伯通","洪七公","一灯","瑛姑",},
{3,"李寻欢是哪部小说的主角？","陆小凤","小李飞刀","多情剑客无情剑","武林外史",},
{4,"下列哪种不是逍遥派的武功？","凌波微步","北冥神功","化功大法","小无相功",},
{4,"全真七子中‘玉阳子’是谁？","刘处玄","丘处机","王处一","谭处端",},
{4,"白发魔女是谁的作品","卧龙生","古龙","梁羽生","金庸",},
{4,"袁紫衣一共夺了几家的掌门？","十三家半","三家","九家半","八家",},
{4,"寻秦记中的腾翼是哪国人？","赵国","齐国","韩国","秦国",},
{4,"哪一个人不会同时一手画圆一手画方？","小龙女","周伯通","黄蓉","郭靖",},
{4,"裘千尺的丈夫是被谁杀的？","小龙女","杨过","裘千尺","黄容",},
{4,"倚天屠龙中是谁最后把屠龙刀焊接好?","杨逍","张无忌","吴劲草","殷素素",},
{4,"郭靖第一次见到黄蓉送了他什麽东西","帽子","戒指","貂皮大衣","双刃剑",},
{4,"韦小宝给了曾柔几个骰子？","4","3","2","6",},
{4,"张无忌第一次见到周芷若在哪里？","黄河","长江","汉水上","淮河",},
{4,"武当有一种不到万不得已不用的武功是什麽？","韦陀掌","摧心掌","虎抓绝户手","阴阳双面掌",},
{4,"郭襄的侍女叫什麽？","李青莲","小柱子","小棒头","荷花",},
{4,"孔雀翎代表什么？","仇恨","诚实","信心","权力",},
{4,"《寻秦记》中谁是赢政的亲生母亲？","朱姬","赵雅","赵妮","晶王后",},
{4,"朱元璋是明教什么旗下的弟子？","朱雀旗","玄武旗","洪水旗","烈火旗",},
{4,"鹤笔翁喜欢什么？","财","色","酒","武",},
{4,"壮士饥餐胡虏肉，笑谈渴饮匈奴血”是谁的诗句？","张可","霍去病","岳飞","霍青",},
{4,"大慈大悲千叶手的第一起手式?","凤凰陧磐","人命呼吸","南海礼佛","万佛朝宗",},
{4,"班淑娴比何太冲大几岁","3岁","1岁","2岁","4岁",},
{4,"<<飘香剑雨>>为古龙什么时期的作品?","末期","中期","早期","以上均不对",},
{4,"丹阳真人是谁？","丘处机","王处一","马钰","刘处玄",},
{4,"穆念慈的武功是谁教的？","杨铁心","周伯通","洪七公","丘处机",},
{4,"“二十四桥明月夜”指的是什么菜？（射雕英雄传）","炒萝卜","炒青菜","蒸豆腐","炒豆腐",},
{4,"玉小仙怎么对付黑鲸门的？","独闯","火烧","水淹","群殴",},
{4,"段誉学回六脉神剑是在什么地方？","少林寺","大理寺","天龙寺","普陀寺",},
{4,"段誉在吸了几个无量剑弟子的内力？","5","6","7","4",},
{4,"江南的孩子叫什么？","江大海","江玉朗","江海天","江南天",},
{4,"项少龙被马疯子送回了多少年？《寻秦记》","公元前246","公元前260","公元前251","公元前216",},
{4,"“台湾三虎”除了陈永华、冯锡范之外，还有一个是：","施琅","郑成功","刘国轩","林兴珠",},
{4,"大唐双龙传中寇仲和徐子陵在哪里长大的？","德州","苏州","扬州","杭州",},
{4,"东方不败喜欢的男子是谁？","任我行","童伯熊","杨莲亭","曲洋",},
{4,"穆念慈死时，杨过几岁？","3","4","5","9",},
{4,"段誉练了北冥神功之后最先吸到谁的内力?","包不同","慕容复","郁光标","葛光佩",},
{4,"白马啸西风中,计爷爷本名是什么?","苏普","瓦尔拉齐","马家俊","史文俊",},
{4,"少林谁的少林龙爪手练得最好？","空闻","空见","空性","空智",},
{4,"鹿鼎记中罗刹人想学习中国的什么技术？","武学","做菜","建桥","武器",},
{4,"韦小宝有三个子女的时候，康熙有几个女儿？","5","4","3","6",},
{4,"鹿鼎记中沐王府有几个人失手被擒在皇宫？","2","4","3","5",},
{4,"鹿鼎记中沐王府中人说的的暗语“黑脚狗”是什么意思？","皇帝","逃命","宫里的武士","太子",},
{4,"鹿鼎记中沐王府中的暗语“点苍上”是什么意思？","问路","冲锋","暂退","杀人",},
{4,"鹿鼎记中鳌拜说谁有异心？","苏哈克萨","苏萨哈克","苏克萨哈","苏克哈萨",},
{4,"倚天屠龙记俞岱岩取得屠龙刀之后天鹰教用什么暗器对付他？","千日醉","行日针","蚊须针","海镖",},
{4,"鹿鼎记中韦小宝从吴三桂那里得到的42章经是什么颜色的？","黄色","红色","蓝色","白色",},
{4,"藏边五丑是谁的弟子？","霍都","金轮法王","达尔巴","灵智上人",},
{4,"“毒蛇作羹，老猫炖盅，斑鱼似鼠，巨虾称龙”是形容那里的菜？（神雕侠侣）","冀","鲁","粤","川",},
{4,"倚天剑和屠龙刀中藏的什么秘密","藏宝图","九阳真经","九阴真经","仁者无敌",},
{4,"在覆雨翻云中韩柏得到十大美女中得几位？","5","4","3","2",},
{4,"星际浪子中的圣婴是谁的孩子？","方舟和姬慧芙","撒拿旦和天美","方舟和天美帝后","方舟和珊娜丽娃",},
{4,"以下哪一部小说不是黄易的作品","成吉思汗","寻秦记","寻龙记","大唐双龙传",},
{4,"寻秦记中项少龙回到古代第一个遇到的女子是谁","周香媚","乌雅芳","美蚕娘","赵雅",},
{4,"《侠客行》中关东四大门派掌门人的姓氏是：","胡，田，秦，赵","范，田，胡，吕","范，风，吕，高","韩，姚，高，吴",},
{4,"谁曾经在风雨交加的江舟中高唱《桃花扇》中《沉江》那一出戏?","张无忌","杨过","吴六奇","浪翻云",},
{4,"谁首先提到宁中则这个名字的？","岳不群","左冷禅","任我行","余沧海",},
{4,"喜欢杨过的女人有几个？","5","3","4","6",},
{4,"神雕侠侣中小龙女和杨过最后到哪去了？","襄阳","小林寺","没有说","终南山",},
{4,"七种武器的第二种是什么?","碧玉刀","长生剑","孔雀翎","离别钩",},
{4,"金花婆婆的丈夫是怎样死的？","生病死的","被杀死的","被毒死的","老死的",},
{4,"《鹿鼎记》中天地会中的清廷叛徒是谁？","樊纲","关安基","风际中","祁彪清",},
{4,"天龙八部中钟灵的貂是谁杀的?","无名老僧","段玉","朱蛤","虚竹",},
{4,"鸳鸯刀的作者是谁？","黄易","古龙","金庸","无极",},
{4,"《天龙八部》的名字是出自那里的？","楚词","诗经","佛经","乐府",},
{4,"《倚天屠龙记》的所有章节都是几个字命名的？","10","8","7","5",},
{4,"韦小宝的老婆里谁的年龄最大？","公主","双儿","苏荃","湘妃",},
{4,"古龙《七种武器》中的哪种讲的是“仇恨”。","离别钩","孔雀翎","多情环","霸王枪",},
{4,"水浒传中花和尚出家前叫什么名字?","鲁智","鲁牛","鲁达","铁牛",},
{4,"下面人物谁不是明教四大法王","谢逊","殷正天","范遥","韦一笑",},
{4,"韦小宝的哪个老婆差点被他气的自杀","公主","方怡","阿珂","双儿",},
{4,"大唐双龙传中瓦岗寨“大龙头”翟让的女儿叫甚麽？","翟无霞","翟无暇","翟无瑕","书中没有出现",},
{4,"布袋和尚是谁？","周颠","彭和尚","说不得","韦一笑",},
{4,"锐金旗旗主的武器是什么？","刀","剑","狼牙棒","棍",},
{4,"阿离是殷野王的第几个孩子？","5","4","3","6",},
{4,"阿离是从谁口中听说张无忌已经死了？","灭绝师太","周芷若","殷梨亭","张三丰",},
{4,"顺水推舟这招是哪个门派的绝学？","少林","华山","武当","峨眉",},
{4,"张无忌是明教第几代教主？","36","35","34","37",},
{4,"张无忌的假名叫什么？","曾牛","张阿牛","曾阿牛","张牛",},
{4,"尹克西临死时遇到了什么人？","杨过","昆仑大圣","昆仑三圣","郭襄",},
{4,"《倚天屠龙记》打死的第一只朱九真的狗叫什么名字？","折冲将军","右将军","左将军","征东将军",},
{4,"《倚天屠龙记》当有人要生吃张无忌和杨不悔时是谁救了他们？","简捷","常遇春","徐达","简鞭",},
{4,"神雕侠侣中杨过第一次看到小龙女是多大？","10","14","15","8",},
{4,"《寻秦记》中项少龙回到古代第一个看到的女人是","朱姬","乌廷芳","善柔","公主",},
{4,"风云系列之《北饮狂刀》是谁的作品？","卧龙生","古龙","黄易","丹云",},
{4,"请问以下哪部不是金庸写的小说？","鸳鸯刀","连城诀","圆月弯刀","书剑恩仇录",},
{4,"峨眉派在屠狮大会上用什么打死司徒千秋？","金顶绵掌","普通暗器","霹雳雷球弹","旋风无敌针",},
{4,"谁的老婆有过目不忘的能力？","杨过","郭靖","黄药师","欧阳风",},
{4,"慕容博第一次偷入藏经阁偷看的是什么武功秘籍？","般若掌法","多罗叶指法","拈花指法","小无相功",},
{4,"石英的先祖是张士诚的亲信卫士，被封什么职位？","勇武大将军","龙骑大将军","龙骑都尉","护驾都尉",},
{4,"杨康的妈妈是谁?","穆念慈","黄蓉","包惜弱","华筝",},
{4,"在百哓生的兵器排行榜中，排第一的是谁？","虚竹","李寻欢","天机老人","啊飞",},
{4,"七残叟出现在古龙哪一部小说中？","苍穹神剑","剑客行","剑玄录","怒剑狂花",},
{4,"《白如云》里，以下哪一位不是龙匀甫的三个师父之一","水梦寒","木苏","墨狐子","星潭",},
{4,"张无忌出生在以下那个岛屿？","侠客岛","灵蛇岛","冰火岛","通吃岛",},
{4,"林平之的爷爷的师傅是谁？","大悲禅师","红木禅师","红叶禅师","无相禅师",},
{4,"令狐冲学吸星大法之前体内有几道真气？","7道","6道","8道","9道",},
{4,"胡青牛是常遇春的什么人？","同教教友","叔叔","师伯","没有关系",},
{4,"张无纪在蝴蝶谷住了几年？","4","3","2","1",},
{4,"《惊艳一枪 》出自温瑞安那部系列？","方振眉","布衣神相","说英雄","神州",},
{4,"江湖三女侠中的冯琳嫁给了谁？","甘凤池","唐晓澜","李治","年羹尧",},
{4,"在《广陵剑》中谁是主角？","厉抗天","云瑚","陈石星","张丹枫",},
{4,"无嗔大师是哪部小说中的人物","笑傲江湖","倚天屠龙记","飞狐外传","鹿鼎记",},
{4,"渭水舟中与张无忌一起的女孩是谁？","小昭","赵敏","周止若","殷离",},
{4,"在古龙小李飞刀系列书籍中出现阿飞最后一次出剑时是用的什么剑？","铁剑","锈剑","竹剑","都不对",},
{4,"汤沛是谁杀的?","程灵素","胡斐","袁紫衣","石万嗔",},
{4,"凤天南是谁杀的?","胡斐","袁紫衣","汤沛","程灵素",},
{4,"倚天屠龙记中峨嵋派静字辈共有多少尼姑?","14","13","12","15",},
{4,"李文秀的地图是什么质地的？","丝","棉","棉，丝","稠",},
{4,"兰特骑的马叫什么？","踏雪","乘风","飞雪","汗血",},
{4,"《江湖三女侠》是谁的著作？","金庸","古龙","梁羽生","黄易",},
{4,"下面那部小说系司马紫烟的成名作","玉露金童","多情浪子","江湖夜雨十年灯","天马行空",},
{4,"圣剑飞霜是谁的作品","卧龙生","古龙","司马翎","温瑞安",},
{4,"王重阳曾经暗中把先天功传给谁？","洪七公","王处一","一灯大师","黄药师",},
{4,"在梁羽生的小说里面，孟华的最厉害的招是","北斗七星","大须弥剑式","胡笳十八拍","天外飞仙",},
{4,"京师的三大高手除了张风府，樊忠还有谁？","杨威","郝宝椿","贯仲","蓝天石",},
{4,"毕道凡家族的怪异透顶的家规中男子到十六岁做什么？","商人","叫化","和尚","大侠",},
{4,"萍踪侠影中的散花女侠是谁？","石翠凤","林仙韵","云蕾","飞天龙女",},
{4,"张宗周在云靖逃到边关时给了他几道锦囊？","2","1","3","4",},
{4,"玄机逸士炼有雌雄双剑，雌剑名叫“青冥”，雄剑呢？","飞将","飞龙","白云","紫云",},
{4,"虚竹和丁春秋恶斗的是时候，是灵鹫4姝中的谁给他酒做生死符的？","兰剑","梅剑","菊剑","竹剑",},
{4,"四大名捕的世叔是：","刘独峰","李布衣","诸葛先生","殷乘风",},
{4,"胡斐和谁一起去为苗人凤找毒手药王？","钟兆能","钟兆英","钟兆文","钟兆雄",},
{4,"胡斐在佛山把凤府家丁当了多少银子？","七千两","八千两","九千两","六千两",},
{4,"石破天的玄铁令是从那里得来的?","一块烧饼中","一个包子里","死者手里","死者临死前给他的",},
{4,"《玉鉤斜》中得女主角最後被甚麼兵器打傷？","刀","寶劍","鐵拐","玉鉤",},
	};

	CContainer * ob;
	int i;
	CMapping * skl = me->query_skills();
	CVector sname;
	int how;
	if(! strlen(ask))
	{
		if (me->query("combat_exp") < 3000 || me->query("mud_age") < 18000)
		{
			say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
			SendMenu(me);
			return 1;
		}
		if (me->query("combat_exp") >=3000 ) 
		{
			how = 0;
			skl->keys(sname);
			for(i=0; i< sname.count(); i++)
			if (skl->query(sname[i]) >= 10) how ++;
			if(how < 5)
			{
				say("上看下看，左看右看，你都好象是个大米ID。多去练练再来领奖励吧！",me);
				SendMenu(me);
				return 1;
			}
		} 
		if(me->query("exam/exam1_count")>10)
		{

			say("你已经参加过了考试了，就不要再来了吧！",me);
			SendMenu(me);
			return 1;
		}
		say("准备好,考试要开始了。每个人只有一次机会，总共可以选择回答十道题目。要注意中途退出可是要算你弃权的哟！", me);
		AddMenuItem("开始考试","y", me);
		AddMenuItem("还是算了吧", "n", me);
	}
	else if(strcmp(ask, "y") == 0)
	{
		if (me->query("combat_exp") < 3000 || me->query("mud_age") < 18000)
		{
			say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
			SendMenu(me);
			return 1;
		}
		if (me->query("combat_exp") >=3000 ) 
		{
			how = 0;
			skl->keys(sname);
			for(i=0; i< sname.count(); i++)
			if (skl->query(sname[i]) >= 10) how ++;
			if(how < 5)
			{
				say("上看下看，左看右看，你都好象是个新注册的ID。多去练练再来领奖励吧！",me);
				SendMenu(me);
				return 1;
			}
		} 
		int idx= random(1266);
		me->set("exam/exam1_key",exam[idx].key);
		me->add("exam/exam1_count", 1);
		me->add("exam/exam1_n", 1);
		if(me->query("exam/exam1_count")>10)
		{
			say("你已经参加过了考试了，就不要再来了吧！",me);
			SendMenu(me);
			return 1;
		}
		say(snprintf(msg,255,"第%d题(正确：%d/10题,)：",me->query("exam/exam1_count"),me->query("exam/exam1_y")),me);
		say(exam[idx].title,me);
		AddMenuItem(exam[idx].key1, "1", me);
		AddMenuItem(exam[idx].key2, "2", me);
		AddMenuItem(exam[idx].key3, "3", me);
		AddMenuItem(exam[idx].key4, "4", me);
	}
	else if(strcmp(ask, "n") == 0)
	{
		return 1;
	}
	else if(strcmp(ask, "1") == 0)
	{
		if(me->query("exam/exam1_key")==1)
		{
			say("恭喜你，答对了这一题。", me);
			me->add("exam/exam1_y", 1);
			me->add("exam/exam1_n", -1);
			me->del("exam/exam1_key");
		}
		else
		{
			say("对不起，你回答错了。", me); 
			me->del("exam/exam1_key");
		}
		if(me->query("exam/exam1_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam1_y")>=6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam1_y"));
				me->add("combat_exp", 888*me->query("exam/exam1_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam1_y"),16888*me->query("exam/exam1_y")),me);
				if(me->query("exam/exam1_y")>=8)
				{
					if(DIFFERSTR(me->querystr("gender"), "男性"))
						ob = load_item("newyear");
					else
						ob = load_item("newyear1");
					ob->move(me);
					message_vision(snprintf(msg, 255, "$HIY由于考试成绩优异,$N获得了一件新年礼服---%s！", ob->name()),me);
				}
				if(me->query("exam/exam1_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam1_y"));
				me->add("combat_exp", 666*me->query("exam/exam1_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam1_y"),10888*me->query("exam/exam1_y")),me);
			}
			
			if(me->query("exam/exam1_y")==10)
			{
				me->set("exam/exam1",1);
			}
			me->del("exam/exam1_y");
			me->del("exam/exam1_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1 )
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异，因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "2") == 0)
	{
		if(me->query("exam/exam1_key")==2)
		{
			say("恭喜你，答对了这一题。", me);
			me->add("exam/exam1_y", 1);
			me->add("exam/exam1_n", -1);
			me->del("exam/exam1_key");
		}
		else
		{
			say("对不起，你回答错了。", me); 
			me->del("exam/exam1_key");
		}
		if(me->query("exam/exam1_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam1_y")>=6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam1_y"));
				me->add("combat_exp", 888*me->query("exam/exam1_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam1_y"),16888*me->query("exam/exam1_y")),me);
				if(me->query("exam/exam1_y")>=8)
				{
					if(DIFFERSTR(me->querystr("gender"), "男性"))
						ob = load_item("newyear");
					else
						ob = load_item("newyear1");
					ob->move(me);
					message_vision(snprintf(msg, 255, "$HIY由于考试成绩优异,$N获得了一件新年礼服---%s！", ob->name()),me);
				}
				if(me->query("exam/exam1_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam1_y"));
				me->add("combat_exp", 666*me->query("exam/exam1_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam1_y"),10888*me->query("exam/exam1_y")),me);
			}
			
			if(me->query("exam/exam1_y")==10)
			{
				me->set("exam/exam1",1);
			}
			me->del("exam/exam1_y");
			me->del("exam/exam1_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1 )
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");	
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异，因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "3") == 0)
	{
		if(me->query("exam/exam1_key")==3)
		{
			say("恭喜你，答对了这一题。", me);
			me->add("exam/exam1_y", 1);
			me->add("exam/exam1_n", -1);
			me->del("exam/exam1_key");
		}
		else
		{
			say("对不起，你回答错了。", me); 
			me->del("exam/exam1_key");
		}
		if(me->query("exam/exam1_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam1_y")>=6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam1_y"));
				me->add("combat_exp", 888*me->query("exam/exam1_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam1_y"),16888*me->query("exam/exam1_y")),me);
				if(me->query("exam/exam1_y")>=8)
				{
					if(DIFFERSTR(me->querystr("gender"), "男性"))
						ob = load_item("newyear");
					else
						ob = load_item("newyear1");
					ob->move(me);
					message_vision(snprintf(msg, 255, "$HIY由于考试成绩优异,$N获得了一件新年礼服---%s！", ob->name()),me);
				}
				if(me->query("exam/exam1_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam1_y"));
				me->add("combat_exp", 666*me->query("exam/exam1_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam1_y"),10888*me->query("exam/exam1_y")),me);
			}
			
			if(me->query("exam/exam1_y")==10)
			{
				me->set("exam/exam1",1);
			}
			me->del("exam/exam1_y");
			me->del("exam/exam1_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1 )
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异，因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	else if(strcmp(ask, "4") == 0)
	{
		if(me->query("exam/exam1_key")==4)
		{
			say("恭喜你，答对了这一题。", me);
			me->add("exam/exam1_y", 1);
			me->add("exam/exam1_n", -1);
			me->del("exam/exam1_key");
		}
		else
		{
			say("对不起，你回答错了。", me); 
			me->del("exam/exam1_key");
		}
		if(me->query("exam/exam1_count")<10)
		{
			AddMenuItem("下一题","y", me);
			AddMenuItem("还是算了吧", "n", me);
		}
		else
		{
			if(me->query("exam/exam1_y")>=6)	
			{
				say("恭喜你,考试过关了。", me);
				say("你好棒啊,这是你的奖励。祝你新年快乐、万事如意！", me);
				CMoney::Pay_Player(me, 16888*me->query("exam/exam1_y"));
				me->add("combat_exp", 888*me->query("exam/exam1_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 888*me->query("exam/exam1_y"),16888*me->query("exam/exam1_y")),me);
				if(me->query("exam/exam1_y")>=8)
				{
					if(DIFFERSTR(me->querystr("gender"), "男性"))
						ob = load_item("newyear");
					else
						ob = load_item("newyear1");
					ob->move(me);
					message_vision(snprintf(msg, 255, "$HIY由于考试成绩优异,$N获得了一件新年礼服---%s！", ob->name()),me);
				}
				if(me->query("exam/exam1_y")==10)
					say("你真聪明!加油,神秘礼物就要到手了耶",me);
			}
			else
			{
				say("哈哈,你还得多多学习。", me);
				say("别难过这是我的一点小意思,祝你新年快乐、万事如意。", me);	
				CMoney::Pay_Player(me, 10888*me->query("exam/exam1_y"));
				me->add("combat_exp", 666*me->query("exam/exam1_y"));
				message_vision(snprintf(msg, 255, "$HIY$N获得了%d的经验奖励、%d的金钱奖励", 666*me->query("exam/exam1_y"),10888*me->query("exam/exam1_y")),me);
			}
			
			if(me->query("exam/exam1_y")==10)
			{
				me->set("exam/exam1",1);
			}
			me->del("exam/exam1_y");
			me->del("exam/exam1_n");
			if(me->query("exam/exam1")==1 && me->query("exam/exam2")==1 && me->query("exam/exam3")==1 )
			{
				me->del("exam/exam1");
				me->del("exam/exam2");
				me->del("exam/exam3");				
				me->set("exam/bing6",1);
				ob = load_item("bing6");
				ob->move(me);
				tell_object(me, snprintf(msg, 255, "$HIY您的表现特别优异，因此您将可以获得额外的奖励$HIR%s$HIY一块！", ob->name()));
			}
		}
	}
	SendMenu(me);
	return 1;
}

NPC_END;




